
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализироватьРеквизитыФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаписатьПараметрыАутентификации(ТекущийОбъект.Ссылка);
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьСтраницыПрокси();
	УстановитьВидимостьЭлементовПоТехнологии();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользоватьПроксиПриИзменении(Элемент)
	УстановитьВидимостьСтраницыПрокси();
КонецПроцедуры

&НаКлиенте
Процедура ТехнологияОбменаПриИзменении(Элемент)
	УстановитьВидимостьЭлементовПоТехнологии();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьСтраницыПрокси()
	Элементы.СтраницаПрокси.Видимость = Объект.ИспользоватьПрокси;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементовПоТехнологии()
	
	Если ЭтоSOAP(Объект.ТехнологияОбмена) Тогда
		Элементы.ПараметрыПодключенияREST.Видимость = Ложь;
		Элементы.ПараметрыПодключенияSOAP.Видимость = Истина;;
	Иначе
		Элементы.ПараметрыПодключенияREST.Видимость = Истина;
		Элементы.ПараметрыПодключенияSOAP.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьРеквизитыФормы()
	
	ИмяПользователя = XMLСтрока(УникальныйИдентификатор);
	ПарольПользователя = XMLСтрока(УникальныйИдентификатор);
		
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПараметрыАутентификации(СервисСсылка)
	
	Если ИмяПользователя = XMLСтрока(УникальныйИдентификатор) 
	     И ПарольПользователя = XMLСтрока(УникальныйИдентификатор) Тогда
		Возврат;	     	
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ОбщегоНазначения
	     .ЗаписатьДанныеВБезопасноеХранилище(СервисСсылка, 
	                                         Новый Структура("ИмяПользователя, ПарольПользователя", 
	                                                         ИмяПользователя, ПарольПользователя), 
	                                         "ИмяПарольПользователя");	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоSOAP(ТехнологияОбмена)
	Возврат гкс_РаботаСВебСервисамиВызовСервера.ЭтоSOAP(ТехнологияОбмена);
КонецФункции

#КонецОбласти



