#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	гкс_ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	ЗаполнитьЕдиницуИзмеренияДляПланаОбработкиСудна();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	гкс_ПроведениеДокументов.ПриЗаписиДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	гкс_ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	гкс_ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьЕдиницуИзмеренияДляПланаОбработкиСудна()
	
	Отбор = Новый Структура("ЕдиницаИзмеренияВеса", Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка());
	СтрокиПланаОбработки = ПланОбработкиСудна.НайтиСтроки(Отбор);
	Для Каждого СтрокаОтбора Из СтрокиПланаОбработки Цикл
		
		СтрокаГруза = Грузы.Найти(СтрокаОтбора.Номенклатура, "Номенклатура");
		Если СтрокаГруза = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаОтбора.ЕдиницаИзмеренияВеса = СтрокаГруза.ЕдиницаИзмеренияВеса;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли