
#Область СлужебныеПроцедурыИФункции

Функция ОписаниеКонтекста() Экспорт	
	Возврат Новый Структура;	
КонецФункции

Функция КлючНастроекКонтекста() Экспорт
	Возврат СтрШаблон("ИАС.Контекст%1", Формат(НомерСеансаИнформационнойБазы(), "ЧГ=0;"));
КонецФункции

Процедура СохранитьАдресКонтекста(АдресХранилища) Экспорт
	ХранилищеОбщихНастроек.Сохранить(КлючНастроекКонтекста(), "АдресХранилищаКонтекста", АдресХранилища);
КонецПроцедуры

Процедура УдалитьАдресКонтекста() Экспорт
	ХранилищеОбщихНастроек.Удалить(КлючНастроекКонтекста(), "АдресХранилищаКонтекста", Неопределено);
КонецПроцедуры

Функция АдресКонтекста() Экспорт

	АдресКонтекста = ХранилищеОбщихНастроек.Загрузить(КлючНастроекКонтекста(), "АдресХранилищаКонтекста");
	Возврат АдресКонтекста;

КонецФункции

Процедура УдалитьКонтекст() Экспорт
	
	АдресКонтекста = АдресКонтекста();
	Если ЭтоАдресВременногоХранилища(АдресКонтекста) Тогда
		УдалитьИзВременногоХранилища(АдресКонтекста);
		УдалитьАдресКонтекста();
	КонецЕсли;
	
КонецПроцедуры

#Область ИменаКонтекстовСобытий

Функция ИмяКонтекстаПолученныхПотоков() Экспорт
	Возврат "КонтекстПолученныхПотоков";
КонецФункции

#КонецОбласти

#КонецОбласти