#Область СлужебныйПрограммныйИнтерфейс

// Проверяет что все переданные регистрации находятся допустимых состояниях. 
// 
// Параметры:
//  ВыбранныеРегистрации - Массив из ДокументСсылка.гкс_РегистрацияНаПЛК - проверяемые документы
//  ВалидныеСостояния - Массив из ПеречислениеСсылка.гкс_СостоянияРегистрации - допустимые состояния
//  ВыводитьСообщения - Булево - Выводить сообщения
// 
// Возвращаемое значение:
//  Булево - Истина если все переданные регистрации находятся допустимых состояниях.
Функция ПроверитьСостояниеРегистраций(ВыбранныеРегистрации, ВалидныеСостояния, ВыводитьСообщения = Ложь) Экспорт
	
	Результат = Ложь;
	СтрокиСообщения = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивРегистраций", ВыбранныеРегистрации);
	Запрос.УстановитьПараметр("Состояния", ВалидныеСостояния);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СостоянияРегистрацииСрезПоследних.ДокументРегистрации КАК ДокументРегистрации,
	|	СостоянияРегистрацииСрезПоследних.Состояние КАК Состояние,
	|	СостоянияРегистрацииСрезПоследних.ТранспортноеСредство КАК ТранспортноеСредство,
	|	ВЫБОР
	|		КОГДА СостоянияРегистрацииСрезПоследних.Состояние В (&Состояния)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоКорректноеСостояние
	|ИЗ
	|	РегистрСведений.гкс_СостоянияРегистрации.СрезПоследних(, ДокументРегистрации В (&МассивРегистраций)) КАК
	|		СостоянияРегистрацииСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЭтоКорректноеСостояние УБЫВ
	|ИТОГИ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Состояние)
	|ПО
	|	ЭтоКорректноеСостояние";
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ЭтоКорректноеСостояние Тогда
			
			// проверка на один вид состояния в выборке
			Результат = ?(Выборка.Состояние = 1, Истина, Ложь);
			Если Не Результат Тогда
				СтрокиСообщения.Добавить(
					НСтр("ru = 'Выбраны регистрации в разных состояниях!
						 |Необходимо выбрать регистрации с одним состоянием.'"));
			КонецЕсли;
			
		Иначе
			
			ПодготовитьСтрокиСообщенияДляНекорректногоСостоянияРегистрации(Выборка, СтрокиСообщения);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ВыводитьСообщения 
		И СтрокиСообщения.Количество() > 0 Тогда
		ТекстСообщения = СтрСоединить(СтрокиСообщения, Символы.ПС);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает список регистраций помеченных для групповой обработки
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма, в которой выполняется команда.
//   
//	Возвращаемое значение:
//		Массив из ДокументСсылка.гкс_РегистрацияНаПЛК
Функция РегистрацииГрупповойОбработки(Форма) Экспорт

	Элементы = Форма.Элементы;
	Настройки = Элементы.СписокРегистрации.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	ИсполняемаяСхема = Элементы.СписокРегистрации.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	Попытка
		МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(ИсполняемаяСхема,
			Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"), Ложь);
	Исключение
		
		ИнформацияОбОшибке 		= ИнформацияОбОшибке();
		СообщениеОбОшибке 		= ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		КраткоеОписаниеОшибки 	= ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
		
		ЗаписьЖурналаРегистрации(
			"АРМ Приемка транспорта",
			УровеньЖурналаРегистрации.Ошибка,,,
			СообщениеОбОшибке);
		
		ЧастиСообщения = Новый Массив;
		ЧастиСообщения.Добавить(НСтр("ru = 'Не удалось получить регистрации групповой обработки!'"));
		ЧастиСообщения.Добавить(СтрШаблон(НСтр("ru = 'Причина: %1'"), КраткоеОписаниеОшибки));
		ТекстОшибки = СтрСоединить(ЧастиСообщения, Символы.ПС);
		
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		Возврат Неопределено;
		
	КонецПопытки;
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных, , , Истина);
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Возврат ТаблицаРезультат.ВыгрузитьКолонку("ДокументРегистрации");
	
КонецФункции

// Проверяет возможность создания направлений на разгрузку для списка регистраций.
// 
// Параметры:
//  ВыбранныеРегистрации - Массив из ДокументСсылка.гкс_РегистрацияНаПЛК - проверяемые документы.
// 
// Возвращаемое значение:
//  Булево - Истина если для всех выбранных регистраций доступно создание направления на разгрузку.
Функция КонтрольПрохожденияНеобходимыхСтатусов(ВыбранныеРегистрации) Экспорт
	
	Результат = Истина;	
	
	Для Каждого ДокументРегистрации Из ВыбранныеРегистрации Цикл
		
		Если Не гкс_ПриемкаТранспорта.НаправлятьНаРазгрузкуРазрешение(ДокументРегистрации) Тогда
			
			Результат = Ложь;
			ТранспортноеСредствоРегистрации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
				ДокументРегистрации, "ТранспортноеСредство");
			
			ТекстСообщения = СтрШаблон(НСтр("ru='Транспорт %1 не готов для направления на разгрузку:
				|	%2'"), ТранспортноеСредствоРегистрации, ДокументРегистрации);
				
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Проверяет, что в переданных регистрациях указана одинаковая номенклатура и возвращает ее. 
// Если номенклатур больше, чем одна, метод выводит сообщение пользователю.
// 
// Параметры:
//  ВыбранныеРегистрации - Массив из ДокументСсылка.гкс_РегистрацияНаПЛК - проверяемые документы
// 
// Возвращаемое значение:
//  Неопределено, СправочникСсылка.Номенклатура - Номенклатура регистраций
Функция НоменклатураРегистраций(ВыбранныеРегистрации) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокРегистраций", ВыбранныеРегистрации);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РегистрацияНаПЛК.Номенклатура КАК Номенклатура
	|ИЗ
	|	Документ.гкс_РегистрацияНаПЛК КАК РегистрацияНаПЛК
	|ГДЕ
	|	РегистрацияНаПЛК.Ссылка В (&СписокРегистраций)
	|СГРУППИРОВАТЬ ПО
	|	РегистрацияНаПЛК.Номенклатура";
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		Результат = Выборка.Номенклатура;
	Иначе
		ТекстСообщения = НСтр(
			"ru='В выбранных строках разная номенклатура! Не возможно применить групповую операцию.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);

		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ДополнитьПараметрыОткрытияЛабАнализа(ДокументРегистрации, ПараметрыОткрытия) Экспорт
		
	ЛабАнализРегистрации = гкс_ПриемкаТранспорта.ОпределитьЛабораторныйАнализ(ДокументРегистрации);
	
	Если ЗначениеЗаполнено(ЛабАнализРегистрации) Тогда
		ПараметрыОткрытия.Вставить("Ключ", ЛабАнализРегистрации);
		ПараметрыОткрытия.Вставить("ИзАРМа", Истина);
	КонецЕсли;
	
	ДополнительныеПараметры = гкс_ПриемкаТранспортаКлиентСервер.ДополнительныеПараметрыДляПробыПриняты(
		ДокументРегистрации);
	ПараметрыОткрытия.Вставить("ЗначенияЗаполнения", ДополнительныеПараметры);
	
КонецПроцедуры

Функция ФормированияПробПоРегистрациям(ВыбранныеРегистрации) Экспорт
	
	МенеджерДокумента = Документы.гкс_ФормированиеНомераПробы;
	МассивОбъектов = Новый Массив;
	Для Каждого ДокументРегистрации Из ВыбранныеРегистрации Цикл 
		
		ДокументФормированиеНомераПробы = МенеджерДокумента.ДокументПоРегистрацииТипуПробы(
			ДокументРегистрации, Перечисления.гкс_ТипыПроб.Единичная);
		
		Если ЗначениеЗаполнено(ДокументФормированиеНомераПробы) Тогда
			МассивОбъектов.Добавить(ДокументФормированиеНомераПробы);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивОбъектов;
	
КонецФункции

Функция ДоступноПодтверждениеРазгрузки(Регистрация) Экспорт
	
	НаправлениеНаРазгрузку = гкс_ПриемкаТранспорта.НаправлениеНаРазгрузкуПоРегистрации(Регистрация);
	Если Не ЗначениеЗаполнено(НаправлениеНаРазгрузку) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РеквизитыНаправления = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		НаправлениеНаРазгрузку, "СлужебнаяНоменклатура,Склад,ЯмаРазгрузки");
		
	Возврат ЗначениеЗаполнено(РеквизитыНаправления.СлужебнаяНоменклатура)
		И ЗначениеЗаполнено(РеквизитыНаправления.Склад)
		И ЗначениеЗаполнено(РеквизитыНаправления.ЯмаРазгрузки);
		
КонецФункции

Функция ЕстьКомментарийОтклоненияПогрузки(ДокументРегистрации) Экспорт
	
	ДанныеВремениПогрузки =
		РегистрыСведений.гкс_ВремяНахожденияТСНаПЛК.ДанныеПоВремениНахожденияНаПЛК(ДокументРегистрации);
	Возврат 
		ЗначениеЗаполнено(ДанныеВремениПогрузки.Комментарий);
	
КонецФункции

Функция ВыполнитьСозданиеНомеровПробНаСервере(ВыбранныеРегистрации, ОтборТочкаМаршрута) Экспорт
	
	МестнаяДата = Справочники.гкс_ТочкиМаршрута.ПолучитьМестнуюДатуПоТочкеМаршрута(ОтборТочкаМаршрута);
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Дата",				ТекущаяДатаСеанса());
	ЗначенияЗаполнения.Вставить("ТочкаМаршрута",	ОтборТочкаМаршрута);
	ЗначенияЗаполнения.Вставить("ТипПробы", 		Перечисления.гкс_ТипыПроб.Единичная);
	ЗначенияЗаполнения.Вставить("МестнаяДата", 		МестнаяДата);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.Вставить("ОжидатьЗавершение", Неопределено);
	ПараметрыВыполнения.Вставить("ЗапуститьНеВФоне", Истина);
	
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(
		ПараметрыВыполнения,
		"Обработки.гкс_ПриемкаТранспорта.ГрупповоеСозданиеНомеровПроб",
		ЗначенияЗаполнения, ВыбранныеРегистрации);
			
КонецФункции

Функция НаправлятьНаРазгрузкуРазрешение(Регистрация) Экспорт
	
	Возврат гкс_ПриемкаТранспорта.НаправлятьНаРазгрузкуРазрешение(Регистрация);
	
КонецФункции

Функция ВыполнитьПропускКонтроляКачестваНаСервере(ВыбранныеРегистрации) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.Вставить("ОжидатьЗавершение", Неопределено);
	ПараметрыВыполнения.Вставить("ЗапуститьНеВФоне", Истина);
	
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(
		ПараметрыВыполнения,
		"Обработки.гкс_ПриемкаТранспорта.ЗарегистрироватьПропуcкКонтроляКачества",
		ВыбранныеРегистрации);
		
КонецФункции

Процедура ОтклонитьРегистрациюНаСервере(Комментарий, МассивРегистрации) Экспорт
	
	Менеджер = Обработки.гкс_ПриемкаТранспорта;	
	Для Каждого ДанныеРегистрации Из МассивРегистрации Цикл
		
		ДополнитьКомментарийОтклоненияРегистрации(Комментарий, ДанныеРегистрации.ТранспортныйДокумент);
		Менеджер.ВыполнитьУдалениеСвязиРегистрацииИТранспортногоДокумента(ДанныеРегистрации.ДокументРегистрации);
		
		ЗарегистрироватьНовоеСостояние(
			Перечисления.гкс_СостоянияРегистрации.НеПринято, ДанныеРегистрации.ДокументРегистрации, Комментарий);
			
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗарегистрироватьНовоеСостояние(НовоеСостояние, ДокументРегистрации, Комментарий = "") Экспорт
	
	гкс_ПриемкаТранспорта.ЗарегистрироватьНовоеСостояние(ДокументРегистрации, НовоеСостояние, Комментарий);
	
КонецПроцедуры

Функция ВыполнитьПробыПринятыНаСервере(ВыбранныеРегистрации) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.Вставить("ОжидатьЗавершение", Неопределено);
	ПараметрыВыполнения.Вставить("ЗапуститьНеВФоне", Истина);
	
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(
		ПараметрыВыполнения,
		"Обработки.гкс_ПриемкаТранспорта.ЗарегистрироватьНовоеСостояниеПоСписку",
		ВыбранныеРегистрации, Перечисления.гкс_СостоянияРегистрации.ПринятыПробы);
			
КонецФункции

Процедура РедактироватьПриемкуНаСервере(ПараметрыРедактирования, ДокументРегистрации, ДанныеРегистрации) Экспорт
	
	гкс_ПриемкаТранспортаСлужебный.РедактироватьПриемкуНаСервере(
		ПараметрыРедактирования, ДокументРегистрации, ДанныеРегистрации);
	
КонецПроцедуры

Функция НаправлениеНаРазгрузкуПоРегистрации(Регистрация) Экспорт
	
	Возврат гкс_ПриемкаТранспорта.НаправлениеНаРазгрузкуПоРегистрации(Регистрация);
	
КонецФункции

Функция СлужебнаяНоменклатураДляФормированияНаправленияНаРагрузку(ЛабораторныйАнализ) Экспорт
	
	Возврат 
		гкс_ПриемкаТранспортаСлужебный.СлужебнаяНоменклатураДляФормированияНаправленияНаРагрузку(ЛабораторныйАнализ);
	
КонецФункции

Функция ТекущийКомпозитныйАнализНеПройденПоКачеству(ДокументРегистрации, СостояниеКачества) Экспорт
	
	Возврат 
		гкс_ВходнойКонтрольКачества.ТекущийКомпозитныйАнализНеПройденПоКачеству(
			ДокументРегистрации, СостояниеКачества);
			
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПодготовитьСтрокиСообщенияДляНекорректногоСостоянияРегистрации(Выборка, СтрокиСообщения)
	
	СтрокиСообщения.Добавить(НСтр("ru = 'Несоответствующее состояние документа для проведения операции:'"));
	ВыборкаДетальныеЗаписи = Выборка.Выбрать();	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокиСообщения.Добавить(
			СтрШаблон("%1, %2, %3",
				ВыборкаДетальныеЗаписи.ДокументРегистрации,
				ВыборкаДетальныеЗаписи.Состояние,
				ВыборкаДетальныеЗаписи.ТранспортноеСредство));
	КонецЦикла;
	
КонецПроцедуры

Процедура ДополнитьКомментарийОтклоненияРегистрации(Комментарий, ТранспортныйДокумент)
	
	ТекстПользователя = Комментарий;
	ТекДата = ТекущаяДатаСеанса();
	
	Если ЗначениеЗаполнено(ТранспортныйДокумент) Тогда
		ШаблонКомментария = НСтр("ru='%1 : %2. Дата отклонения: %3'");
		Комментарий = СтрШаблон(ШаблонКомментария, ТранспортныйДокумент, 
			ТекстПользователя, ТекДата);
	Иначе
		ШаблонКомментария = НСтр("ru='%1. Дата отклонения: %2'");
		Комментарий = СтрШаблон(ШаблонКомментария, ТекстПользователя, ТекДата);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти