
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ФормаКомандаРазрешитьРедактировать.Доступность = Пользователи.РолиДоступны("ПолныеПрава");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УстановитьДоступностьЭлементовФормы();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаРазрешитьРедактировать(Команда)
	
	РазрешитьРедактировать = Не РазрешитьРедактировать;
	УстановитьДоступностьЭлементовФормы();
	УстановитьПометкуКоманды();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьДоступностьЭлементовФормы()
	
	Элементы.Порядок.ТолькоПросмотр 						= Не РазрешитьРедактировать;
	Элементы.ВходящиеДанные.ТолькоПросмотр 					= Не РазрешитьРедактировать;
	Элементы.КоличествоНеудачныхОбработок.ТолькоПросмотр 	= Не РазрешитьРедактировать;
	Элементы.СообщениеОбОшибкеОбработки.ТолькоПросмотр 		= Не РазрешитьРедактировать;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкуКоманды()
	
	Элементы.ФормаКомандаРазрешитьРедактировать.Пометка = РазрешитьРедактировать;
	
КонецПроцедуры

#КонецОбласти
