#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Отбор = Новый Структура;

	Если ТипЗнч(ПараметрыВыполненияКоманды.Источник) = Тип("ФормаКлиентскогоПриложения") Тогда
		Параметры = ПараметрыВыполненияКоманды.Источник.Объект;

		Отбор.Вставить("Организация", 	Параметры.Организация);
		Отбор.Вставить("ТочкаМаршрута", 			Параметры.ТочкаМаршрута);
		Отбор.Вставить("Номенклатура", 	Параметры.Номенклатура);
	Конецесли;
	
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	
	ОткрытьФорму("РегистрСведений.гкс_НастройкаПечатиОсобыхОтметокЗПП47АЛЦ.ФормаСписка",
					ПараметрыФормы,,,ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти