#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    ПодготовитьФорму(ЭтотОбъект);
    
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьФорму(Форма)
    
    ОбъектФормы     = Форма.Объект;
    ЭлементыФормы   = Форма.Элементы;
    
    Если Объект.Предопределенный Тогда
        ЭлементыФормы.ТипЗначения.ТолькоПросмотр = Истина;        	
    КонецЕсли; 
    
КонецПроцедуры
 

#КонецОбласти 
