#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
		
	ПоУмолчанию 	= ПредопределенноеЗначение("Справочник.гкс_НастройкиИнтеграцииWarehouse.ПоУмолчанию");
	
	ПараметрыФормы 	= Новый Структура;
	ПараметрыФормы.Вставить("Ключ", ПоУмолчанию);
	
	ОткрытьФорму("Справочник.гкс_НастройкиИнтеграцииWarehouse.Форма.ФормаНастройки",
				ПараметрыФормы, 
				ПараметрыВыполненияКоманды.Источник, 
				ПараметрыВыполненияКоманды.Уникальность, 
				ПараметрыВыполненияКоманды.Окно, 
				ПараметрыВыполненияКоманды.НавигационнаяСсылка,,
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти