#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьСлужебнуюНоменклатуру(НоменклатураИсточник) Экспорт
	
	Если НЕ ЗначениеЗаполнено(НоменклатураИсточник) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПолучитьСлужебнуюНоменклатуру();
	Запрос.УстановитьПараметр("НоменклатураИсточник", НоменклатураИсточник);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ТекстЗапроса

Функция ТекстЗапросаПолучитьСлужебнуюНоменклатуру() Экспорт

	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СлужебнаяНоменклатура.Ссылка КАК Номенклатура
	|ИЗ
	|	Справочник.Номенклатура КАК НоменклатураИсточник
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СлужебнаяНоменклатура
	|		ПО СлужебнаяНоменклатура.ПродуктоваяГруппа = НоменклатураИсточник.ПродуктоваяГруппа
	|		И СлужебнаяНоменклатура.ОбъектКачества
	|ГДЕ
	|	НЕ СлужебнаяНоменклатура.ПометкаУдаления
	|	И НоменклатураИсточник.Ссылка = &НоменклатураИсточник";

	Возврат ТекстЗапроса

КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли