// Область ПрограммныйИнтерфейс и Экспорт для подавления замечаний SQ

#Область ПрограммныйИнтерфейс

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт
	Источник = ПараметрыВыполненияКоманды.Источник;
	КомандаПечатьАктРасхожденияВВесе(Источник);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура КомандаПечатьАктРасхожденияВВесе(Форма)
	
	Элементы = Форма.Элементы;
	ТекущиеДанные = Элементы.СписокРегистрации.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(ТекущиеДанные.ДокументРегистрации) Тогда
		
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(ТекущиеДанные.ДокументРегистрации);
		
		ОписаниеКоманды = Новый Структура();
		ОписаниеКоманды.Вставить("ОбъектыПечати",	МассивОбъектов);
		ОписаниеКоманды.Вставить("Форма",			Форма);
		ОписаниеКоманды.Вставить("Идентификатор",	"ПФ_MXL_АктРасхожденияВеса_by");
		ОписаниеКоманды.Вставить("Представление",	НСтр("ru = 'Акт расхождения веса'"));
		ОписаниеКоманды.Вставить("МенеджерПечати",	"Обработка.гкс_ПечатьАктРасхожденияВеса");
		ОписаниеКоманды.Вставить("ПроверкаПроведенияПередПечатью", Истина);
		ОписаниеКоманды.Вставить("Обработчик",
			"гкс_УправлениеПечатьюКлиент_by.ВыполнитьКомандуПечати_АктРасхожденияВеса");
		
		гкс_УправлениеПечатьюКлиент_by.ВыполнитьКомандуПечати_АктРасхожденияВеса(ОписаниеКоманды);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не заполнена регистрация на ПЛК'"));
	КонецЕсли;

КонецПроцедуры

#КонецОбласти