#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаСкопировать(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;	
	ПарматрыОткрытия = ПолучитьНастройкиТекущейСтроки(ТекущиеДанные.Объект);	
	ОткрытьФорму("РегистрСведений.гкс_НастройкиНапоминанияПользователя.ФормаЗаписи", ПарматрыОткрытия, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьНастройкиТекущейСтроки(Объект)
	
	ЗначенияЗаполнения = гкс_НапоминанияПользователяСервер.ПодготовитьНастройкиНапоминания(Объект);
		
	ПарматрыОткрытия = Новый Структура();
	ПарматрыОткрытия.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	Возврат ПарматрыОткрытия;
	
КонецФункции

#КонецОбласти
