
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Вес") Тогда
		Вес	= Параметры.Вес;
	КонецЕсли;
	
	ВесИзменен	= Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВесПриИзменении(Элемент)
	
	ВесИзменен	= Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ОК(Команда)
	
	Закрыть(Новый Структура("Вес,ВесИзменен", Вес, ВесИзменен));
	
КонецПроцедуры
#КонецОбласти

