#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Вызывается для формирования состава полей, из которых формируется 
// представление справочника транспортных средств.
//
// Параметры:
//  Поля                 - Массив - массив, содержащий имена полей, которые нужны для формирования представления объекта
//                                  или ссылки.
//  СтандартнаяОбработка - Булево - в данный параметр передается признак выполнения стандартной (системной) обработки события.
//                                  Если в теле процедуры-обработчика установить данному параметру значение Ложь,
//                                  стандартная обработка события производиться не будет.
//
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка) Экспорт 
	
	Поля.Добавить("Наименование");
	Поля.Добавить("НаименованиеПолное");
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

// Вызывается при получении представления справочника транспортных средств.
//
// Параметры:
//  Данные               - Структура - содержит значения полей, из которых формируется представление.
//  Представление        - Строка - в данный параметр нужно поместить сформированное представление.
//  СтандартнаяОбработка - Булево - в данный параметр передается признак формирования стандартного представления.
//
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка) Экспорт
		
	Представление = СокрЛП(СтрШаблон("%1 (%2)", Данные.НаименованиеПолное, Данные.Наименование));
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
