#Область СлужебныеПроцедурыИФункции

Функция ВесПоТранспортномуДокументу(ТранспортныйДокумент) Экспорт
	
	Вес = 0;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТранспортныйДокумент", ТранспортныйДокумент);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СУММА(ТранспортныйДокументТранспортныеСредства.ВесНетто) КАК ВесНетто
	|ИЗ
	|	Документ.гкс_ТранспортныйДокумент.ТранспортныеСредства КАК ТранспортныйДокументТранспортныеСредства
	|ГДЕ
	|	ТранспортныйДокументТранспортныеСредства.Ссылка = &ТранспортныйДокумент";
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Вес = Выборка.ВесНетто;
	КонецЕсли;
	
	Возврат Вес;
	
КонецФункции

Функция ДанныеЗаполненияПрибытияСуднаНаПЛК(Фрахт) Экспорт
	
	Реквизиты = Новый Структура;
	ТранспортныеДокументы = Новый Массив;
	ТаблицыЗапроса = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Фрахт", Фрахт);
	Запрос.Текст = ТекстЗапросаДанныеЗаполненияПрибытияСуднаНаПЛК(ТаблицыЗапроса);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Если Не РезультатЗапроса[ТаблицыЗапроса.Реквизиты].Пустой() Тогда
		Реквизиты = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(
			РезультатЗапроса[ТаблицыЗапроса.Реквизиты].Выгрузить()[0]);
	КонецЕсли;
	
	Если Не РезультатЗапроса[ТаблицыЗапроса.ТранспортныеДокументы].Пустой() Тогда
		ТранспортныеДокументы = ОбщегоНазначения.ТаблицаЗначенийВМассив(
			РезультатЗапроса[ТаблицыЗапроса.ТранспортныеДокументы].Выгрузить());
	КонецЕсли;
	
	ДанныеЗаполнения 	= Новый Структура;
	ДанныеЗаполнения.Вставить("Реквизиты", Реквизиты);
	ДанныеЗаполнения.Вставить("ТранспортныеДокументы", ТранспортныеДокументы);
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

Функция ТекстЗапросаДанныеЗаполненияПрибытияСуднаНаПЛК(ТаблицыЗапроса)
	
	ТаблицыЗапроса.Вставить("ПланыРазгрузкиСудов", ТаблицыЗапроса.Количество());
	ТаблицыЗапроса.Вставить("Реквизиты", ТаблицыЗапроса.Количество());
	ТаблицыЗапроса.Вставить("ТранспортныеДокументы", ТаблицыЗапроса.Количество());
	
	Возврат  
	"ВЫБРАТЬ
	|	ПланыРазгрузкиСудов.Фрахт КАК Фрахт,
	|	ПланыРазгрузкиСудов.Номенклатура КАК Номенклатура,
	|	ПланыРазгрузкиСудов.Трюм КАК Трюм,
	|	ПланыРазгрузкиСудов.Количество КАК Количество,
	|	ПланыРазгрузкиСудов.ЕдиницаИзмеренияВеса КАК ЕдиницаИзмеренияВеса,
	|	ПланыРазгрузкиСудов.Порядок КАК Порядок
	|ПОМЕСТИТЬ ПланыРазгрузкиСудов
	|ИЗ
	|	РегистрСведений.гкс_ПланыРазгрузкиСудов КАК ПланыРазгрузкиСудов
	|ГДЕ
	|	ПланыРазгрузкиСудов.Фрахт = &Фрахт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПланыРазгрузкиСудов.Фрахт КАК Фрахт,
	|	ПланыРазгрузкиСудов.Номенклатура КАК Номенклатура,
	|	ПланыРазгрузкиСудов.ЕдиницаИзмеренияВеса КАК ЕдиницаИзмеренияВеса
	|ИЗ
	|	ПланыРазгрузкиСудов КАК ПланыРазгрузкиСудов
	|СГРУППИРОВАТЬ ПО
	|	ПланыРазгрузкиСудов.Фрахт,
	|	ПланыРазгрузкиСудов.Номенклатура,
	|	ПланыРазгрузкиСудов.ЕдиницаИзмеренияВеса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПланыРазгрузкиСудов.Трюм КАК Трюм,
	|	ПланыРазгрузкиСудов.Порядок КАК Порядок,
	|	СУММА(ПланыРазгрузкиСудов.Количество) КАК КоличествоВТрюме
	|ИЗ
	|	ПланыРазгрузкиСудов КАК ПланыРазгрузкиСудов
	|СГРУППИРОВАТЬ ПО
	|	ПланыРазгрузкиСудов.Трюм,
	|	ПланыРазгрузкиСудов.Порядок
	|
	|УПОРЯДОЧИТЬ ПО
	|	Трюм";
	
КонецФункции

// Возвращает коллекцию транспортных документов по судну в виде массива.
// 
// Параметры:
//  Судно - СправочникСсылка.ТранспортныеСредства - Судно для поиска записей
// 
// Возвращаемое значение:
//  Массив из ДокументСсылка.гкс_ТранспортныйДокумент - Коллекция транспортных документов по судну
Функция КоллекцияТранспортныхДокументовПоСудну(Судно) Экспорт
	
	КоллекцияТранспортныхДокументов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТранспортноеСредство", Судно);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТранспортныйДокумент.Ссылка КАК Коносамент,
	|	ТранспортныйДокумент.Дата КАК КоносаментДата
	|ПОМЕСТИТЬ ТранспортныеДокументыПоСудну
	|ИЗ
	|	Документ.гкс_ТранспортныйДокумент.ТранспортныеСредства КАК ТранспортныйДокументТранспортныеСредства
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ТранспортныйДокумент КАК ТранспортныйДокумент
	|		ПО ТранспортныйДокументТранспортныеСредства.Ссылка = ТранспортныйДокумент.Ссылка
	|ГДЕ
	|	ТранспортныйДокументТранспортныеСредства.ТранспортноеСредство = &ТранспортноеСредство
	|	И НЕ ТранспортныйДокумент.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТранспортныеДокументыПоСудну.Коносамент КАК Коносамент
	|ИЗ
	|	ТранспортныеДокументыПоСудну КАК ТранспортныеДокументыПоСудну
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_ПрибытиеСуднаНаПЛК.ТранспортныеДокументы КАК ТранспортныеДокументыОформленные
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ПрибытиеСуднаНаПЛК КАК ДокументПрибытиеСуднаНаПЛК
	|			ПО ТранспортныеДокументыОформленные.Ссылка = ДокументПрибытиеСуднаНаПЛК.Ссылка
	|			И НЕ ДокументПрибытиеСуднаНаПЛК.ПометкаУдаления
	|		ПО ТранспортныеДокументыПоСудну.Коносамент = ТранспортныеДокументыОформленные.ТранспортныйДокумент
	|ГДЕ
	|	ТранспортныеДокументыОформленные.Ссылка ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТранспортныеДокументыПоСудну.КоносаментДата";
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		КоллекцияТранспортныхДокументов = ОбщегоНазначения.ВыгрузитьКолонку(
			РезультатЗапроса.Выгрузить(), "Коносамент", Истина);
	КонецЕсли;
	
	Возврат КоллекцияТранспортныхДокументов;
	
КонецФункции

// Возвращает коллекцию Фрахтов, не использованных в документах Прибытие судна на ПЛК в виде массива.
// 
// Возвращаемое значение:
//  Массив из ДокументСсылка.гкс_Фрахт - Фрахты, не привязанные к Прибытию судна на ПЛК.
Функция КоллекцияНеобработанныхФрахтов() Экспорт
	
	КоллекцияДокументов = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокументФрахт.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.гкс_Фрахт КАК ДокументФрахт
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_ПрибытиеСуднаНаПЛК КАК ДокументПрибытиеСуднаНаПЛК
	|		ПО ДокументПрибытиеСуднаНаПЛК.Фрахт = ДокументФрахт.Ссылка
	|		И НЕ ДокументПрибытиеСуднаНаПЛК.ПометкаУдаления
	|ГДЕ
	|	ДокументФрахт.Проведен
	|	И ДокументФрахт.ВидОперации = ЗНАЧЕНИЕ(Перечисление.гкс_ВидыОперацийФрахта.ПоставкаСырья)
	|	И ДокументПрибытиеСуднаНаПЛК.Ссылка ЕСТЬ NULL";
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		КоллекцияДокументов = ОбщегоНазначения.ВыгрузитьКолонку(
			РезультатЗапроса.Выгрузить(), "Ссылка", Истина);
	КонецЕсли;
	
	Возврат КоллекцияДокументов;
	
КонецФункции

// см. гкс_МорскаяЛогистика.ФрахтПоДокументуРегистрации
//
Функция ФрахтПоДокументуРегистрации(ДокументРегистрации) Экспорт
	Возврат гкс_МорскаяЛогистика.ФрахтПоДокументуРегистрации(ДокументРегистрации);
КонецФункции

// см. гкс_МорскаяЛогистика.ТрюмыФрахта
//
Функция ТрюмыФрахта(Фрахт) Экспорт
	
	Возврат гкс_МорскаяЛогистика.ТрюмыФрахта(Фрахт);
	
КонецФункции

// см. гкс_МорскаяЛогистика.СменыФрахта
//
Функция СменыФрахта(Фрахт, ТолькоОткрытые = Ложь) Экспорт
	
	Возврат гкс_МорскаяЛогистика.СменыФрахта(Фрахт, ТолькоОткрытые);
	
КонецФункции

#КонецОбласти