#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если НЕ ЗначениеЗаполнено(ПараметрКоманды) Тогда		
		ТекстСообщения = НСтр("'Не выбраны объект(ы) для обработки'");
		гкс_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;		
	КонецЕсли;
		
	ОбработатьБезОчереди(ПараметрКоманды);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбработатьБезОчереди(Объекты)
	
	УстановитьПривилегированныйРежим(Истина);
	Обработки.гкс_УправлениеОбъектамиИнтеграции.ОбработатьОбъектыБезОчереди(Объекты);
	
КонецПроцедуры

#КонецОбласти
