#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом
//
// Параметры:
// Ограничение - См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ТочкаМаршрута)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

// Зарегистировать в АРМ Приемки на ПЛК
//
// Параметры:
//	ДокументРегистрации - ДокументСсылка.гкс_РегистрацияНаПЛК
//
Процедура ЗарегистрироватьВАРМПриемкиНаПЛК(ДокументРегистрации) Экспорт

	Если ТипЗнч(ДокументРегистрации) <> Тип("ДокументСсылка.гкс_РегистрацияНаПЛК") Тогда
		Возврат;
	КонецЕсли;

	НачатьТранзакцию();

	Попытка
		Блокировка = Новый БлокировкаДанных();
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.гкс_АРМПриемкиНаПЛКСписокРегистраций");
		ЭлементБлокировки.УстановитьЗначение("ДокументРегистрации", ДокументРегистрации);
		Блокировка.Заблокировать();

		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДокументРегистрации.Установить(ДокументРегистрации);

		Таблица = ВыполнитьПолноеЗаполнениеИнформацииПоРегистрации(ДокументРегистрации);

		Если Таблица <> Неопределено Тогда
			НаборЗаписей.Загрузить(Таблица);
		КонецЕсли;

		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);

		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();

		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Произошла ошибка регистрации в АРМ приемки по документу %1:
				       |%2'"),
			ДокументРегистрации,
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));

		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'АРМ Приемки'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));

		ВызватьИсключение ТекстОшибки;
	КонецПопытки;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Возвращает записи для регистрации в АРМе на ПЛК
//
// Параметры:
//   ДокументРегистрации - ДокументСсылка.гкс_РегистрацияНаПЛК - документ регистрации
//
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица для загрузки в регистр.
//
Функция ВыполнитьПолноеЗаполнениеИнформацииПоРегистрации(ДокументРегистрации)

	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаЗаполнениеИнформацииПоРегистрации();

	Запрос.УстановитьПараметр("ДокументРегистрации", ДокументРегистрации);

	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		ЗаписьВРегистр = Неопределено;
	Иначе
		ЗаписьВРегистр = РезультатЗапроса.Выгрузить();
	КонецЕсли;

	Возврат ЗаписьВРегистр;

КонецФункции

Функция ТекстЗапросаЗаполнениеИнформацииПоРегистрации()

	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РССостоянияРегистрацииСрезПоследних.ТочкаМаршрута КАК ТочкаМаршрута,
	|	РССостоянияРегистрацииСрезПоследних.ВидПеревозки КАК ВидПеревозки,
	|	РССостоянияРегистрацииСрезПоследних.ТипРегистрации КАК ТипРегистрации,
	|	РССостоянияРегистрацииСрезПоследних.ДокументРегистрации КАК ДокументРегистрации,
	|	РССостоянияРегистрацииСрезПоследних.ТранспортноеСредство КАК ТранспортноеСредство,
	|	РССостоянияРегистрацииСрезПоследних.Период КАК Период,
	|	РССостоянияРегистрацииСрезПоследних.Состояние КАК Состояние,
	|	РССостоянияРегистрацииСрезПоследних.МестнаяДата КАК МестнаяДата
	|ПОМЕСТИТЬ ВТ_СостоянияРегистрации
	|ИЗ
	|	РегистрСведений.гкс_СостоянияРегистрации.СрезПоследних(, ДокументРегистрации = &ДокументРегистрации) КАК
	|		РССостоянияРегистрацииСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФормированиеНомераПробыСписокРегистраций.ДокументРегистрации КАК ДокументРегистрации,
	|	ФормированиеНомераПробыСписокРегистраций.Ссылка КАК ДокументФормированиеНомераПробы,
	|	СопоставлениеФНП.ЛабораторныйАнализ КАК ЛабораторныйАнализ
	|ПОМЕСТИТЬ ВТ_ФормированиеНомераПробы
	|ИЗ
	|	Документ.гкс_ФормированиеНомераПробы.СписокРегистраций КАК ФормированиеНомераПробыСписокРегистраций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ФормированиеНомераПробы КАК ДокументФНП
	|		ПО ФормированиеНомераПробыСписокРегистраций.Ссылка = ДокументФНП.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СостоянияРегистрации КАК ВТ_СостоянияРегистрации
	|		ПО ФормированиеНомераПробыСписокРегистраций.ДокументРегистрации = ВТ_СостоянияРегистрации.ДокументРегистрации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СопоставлениеФНПЛабАнализа КАК СопоставлениеФНП
	|		ПО ФормированиеНомераПробыСписокРегистраций.Ссылка = СопоставлениеФНП.ФормированиеНомераПробы
	|		И СопоставлениеФНП.ТипПробы = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыПроб.Единичная)
	|		И СопоставлениеФНП.НазначениеИспользования = ЗНАЧЕНИЕ(Перечисление.гкс_НазначенияИспользованияКачества.Приемка)
	|ГДЕ
	|	ДокументФНП.Проведен
	|	И ДокументФНП.ТипПробы = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыПроб.Единичная)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_СостоянияРегистрации.ТочкаМаршрута КАК ТочкаМаршрута,
	|	ВТ_СостоянияРегистрации.ВидПеревозки КАК ВидПеревозки,
	|	ВТ_СостоянияРегистрации.ТипРегистрации КАК ТипРегистрации,
	|	ВТ_СостоянияРегистрации.ДокументРегистрации КАК ДокументРегистрации,
	|	ВТ_СостоянияРегистрации.ТранспортноеСредство КАК ТранспортноеСредство,
	|	ВТ_СостоянияРегистрации.Период КАК Период,
	|	ВТ_СостоянияРегистрации.Состояние КАК Состояние,
	|	МАКСИМУМ(ЕСТЬNULL(ВзвешиваниеВъезд.Ссылка, НЕОПРЕДЕЛЕНО)) КАК ДокументРегистрацииВъезда,
	|	МАКСИМУМ(ЕСТЬNULL(ВзвешиваниеВыезд.Ссылка, НЕОПРЕДЕЛЕНО)) КАК ДокументРегистрацииВыезда,
	|	МАКСИМУМ(ЕСТЬNULL(НаправлениеНаРазгрузку.Ссылка, НЕОПРЕДЕЛЕНО)) КАК ДокументНаправлениеНаРазгрузку,
	|	МАКСИМУМ(ЕСТЬNULL(ФормированиеНомераПробы.ДокументФормированиеНомераПробы, НЕОПРЕДЕЛЕНО)) КАК
	|		ДокументФормированиеНомераПробы,
	|	МАКСИМУМ(ЕСТЬNULL(ФормированиеНомераПробы.ЛабораторныйАнализ, НЕОПРЕДЕЛЕНО)) КАК ДокументРегистрацииАнализов,
	|	ВТ_СостоянияРегистрации.МестнаяДата КАК МестнаяДата,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(Комментарии.Комментарий, """") КАК СТРОКА(300)) КАК Комментарий,
	|	ЕСТЬNULL(СвязьРегистрацииИТранспортногоДокумента.ТранспортныйДокумент,
	|		ЗНАЧЕНИЕ(Документ.гкс_ТранспортныйДокумент.ПустаяСсылка)) КАК ТранспортныйДокумент
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	ВТ_СостоянияРегистрации КАК ВТ_СостоянияРегистрации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_РегистрацияНаПЛК КАК ДокументРегистрация
	|		ПО ВТ_СостоянияРегистрации.ДокументРегистрации = ДокументРегистрация.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_Взвешивание КАК ВзвешиваниеВъезд
	|		ПО ВТ_СостоянияРегистрации.ДокументРегистрации = ВзвешиваниеВъезд.ДокументРегистрации
	|		И ВзвешиваниеВъезд.Проведен
	|		И ВзвешиваниеВъезд.ТипВзвешивания = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыВзвешивания.Въезд)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_Взвешивание КАК ВзвешиваниеВыезд
	|		ПО ВТ_СостоянияРегистрации.ДокументРегистрации = ВзвешиваниеВыезд.ДокументРегистрации
	|		И ВзвешиваниеВыезд.Проведен
	|		И ВзвешиваниеВыезд.ТипВзвешивания = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыВзвешивания.Выезд)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_ЛабораторныйАнализ КАК ДокументЛабораторныйАнализ
	|		ПО ВТ_СостоянияРегистрации.ДокументРегистрации = ДокументЛабораторныйАнализ.гкс_ДокументРегистрации
	|		И ДокументЛабораторныйАнализ.Проведен
	|		И
	|			ДокументЛабораторныйАнализ.гкс_НазначениеИспользованияКачества = ЗНАЧЕНИЕ(Перечисление.гкс_НазначенияИспользованияКачества.Приемка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_НаправлениеНаРазгрузку КАК НаправлениеНаРазгрузку
	|		ПО ВТ_СостоянияРегистрации.ДокументРегистрации = НаправлениеНаРазгрузку.ДокументРегистрации
	|		И НаправлениеНаРазгрузку.Проведен
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ФормированиеНомераПробы КАК ФормированиеНомераПробы
	|		ПО ВТ_СостоянияРегистрации.ДокументРегистрации = ФормированиеНомераПробы.ДокументРегистрации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_КомментарииКСтатусуКачествоНеПринято КАК Комментарии
	|		ПО ВТ_СостоянияРегистрации.ДокументРегистрации = Комментарии.ДокументРегистрации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СвязьРегистрацииИТранспортногоДокумента КАК
	|			СвязьРегистрацииИТранспортногоДокумента
	|		ПО ВТ_СостоянияРегистрации.ДокументРегистрации = СвязьРегистрацииИТранспортногоДокумента.ДокументРегистрации
	|ГДЕ
	|	НЕ ВТ_СостоянияРегистрации.Состояние В (ЗНАЧЕНИЕ(Перечисление.гкс_СостоянияРегистрации.Убыл),
	|		ЗНАЧЕНИЕ(Перечисление.гкс_СостоянияРегистрации.НеПринято))
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СостоянияРегистрации.ВидПеревозки,
	|	ВТ_СостоянияРегистрации.ТипРегистрации,
	|	ВТ_СостоянияРегистрации.ДокументРегистрации,
	|	ВТ_СостоянияРегистрации.Период,
	|	ВТ_СостоянияРегистрации.ТранспортноеСредство,
	|	ВТ_СостоянияРегистрации.Состояние,
	|	ЕСТЬNULL(ВзвешиваниеВыезд.КачествоНеПринято, ЛОЖЬ),
	|	ВЫРАЗИТЬ(ЕСТЬNULL(Комментарии.Комментарий, """") КАК СТРОКА(300)),
	|	ВТ_СостоянияРегистрации.ТочкаМаршрута,
	|	ВТ_СостоянияРегистрации.МестнаяДата,
	|	ЕСТЬNULL(СвязьРегистрацииИТранспортногоДокумента.ТранспортныйДокумент,
	|		ЗНАЧЕНИЕ(Документ.гкс_ТранспортныйДокумент.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВзвешиваниеВъезд.Вес, 0) КАК ВесВъезд,
	|	ЕСТЬNULL(ВзвешиваниеВыезд.Вес, 0) КАК ВесВыезд,
	|	ЕСТЬNULL(НаправлениеНаРазгрузку.Склад, ЗНАЧЕНИЕ(Справочник.гкс_ТочкиМаршрута.ПустаяСсылка)) КАК Склад,
	|	ЕСТЬNULL(НаправлениеНаРазгрузку.ЯмаРазгрузки, ЗНАЧЕНИЕ(Справочник.гкс_ТочкиМаршрута.ПустаяСсылка)) КАК ЯмаРазгрузки,
	|	ЕСТЬNULL(ФормированиеНомераПробы.НомерПробы, ЗНАЧЕНИЕ(Справочник.гкс_НомерПробы.ПустаяСсылка)) КАК НомерПробы,
	|	ВТ_Данные.ТочкаМаршрута КАК ТочкаМаршрута,
	|	ВТ_Данные.ВидПеревозки КАК ВидПеревозки,
	|	ВТ_Данные.ТипРегистрации КАК ТипРегистрации,
	|	ВТ_Данные.ДокументРегистрации КАК ДокументРегистрации,
	|	ВТ_Данные.ТранспортноеСредство КАК ТранспортноеСредство,
	|	ВТ_Данные.Период КАК Период,
	|	ВТ_Данные.Состояние КАК Состояние,
	|	ВТ_Данные.ДокументРегистрацииВъезда КАК ДокументРегистрацииВъезда,
	|	ВТ_Данные.ДокументРегистрацииВыезда КАК ДокументРегистрацииВыезда,
	|	ВТ_Данные.ДокументРегистрацииАнализов КАК ДокументРегистрацииАнализов,
	|	ВТ_Данные.ДокументНаправлениеНаРазгрузку КАК ДокументНаправлениеНаРазгрузку,
	|	ВТ_Данные.ДокументФормированиеНомераПробы КАК ДокументФормированиеНомераПробы,
	|	ВТ_Данные.МестнаяДата КАК МестнаяДата,
	|	ВТ_Данные.Комментарий КАК Комментарий,
	|	ВТ_Данные.ТранспортныйДокумент КАК ТранспортныйДокумент,
	|	ЕСТЬNULL(ДокументТранспортныйДокумент.ПунктПогрузки, ЗНАЧЕНИЕ(Справочник.гкс_ТочкиМаршрута.ПустаяСсылка)) КАК
	|		ПунктПогрузки,
	|	ЕСТЬNULL(ДокументТранспортныйДокумент.Отправитель, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Отправитель,
	|	ЕСТЬNULL(ПунктыПогрузки.КодСтанцииЖД, ЗНАЧЕНИЕ(Справочник.гкс_КлассификаторСтанцийЖД.ПустаяСсылка)) КАК СтанцияЖД
	|ПОМЕСТИТЬ ВТ_Расчет
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_Взвешивание КАК ВзвешиваниеВъезд
	|		ПО ВТ_Данные.ДокументРегистрацииВъезда = ВзвешиваниеВъезд.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_Взвешивание КАК ВзвешиваниеВыезд
	|		ПО ВТ_Данные.ДокументРегистрацииВыезда = ВзвешиваниеВыезд.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_НаправлениеНаРазгрузку КАК НаправлениеНаРазгрузку
	|		ПО ВТ_Данные.ДокументНаправлениеНаРазгрузку = НаправлениеНаРазгрузку.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_ФормированиеНомераПробы КАК ФормированиеНомераПробы
	|		ПО ВТ_Данные.ДокументФормированиеНомераПробы = ФормированиеНомераПробы.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_ТранспортныйДокумент КАК ДокументТранспортныйДокумент
	|		ПО ВТ_Данные.ТранспортныйДокумент = ДокументТранспортныйДокумент.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.гкс_ТочкиМаршрута КАК ПунктыПогрузки
	|		ПО ДокументТранспортныйДокумент.ПунктПогрузки = ПунктыПогрузки.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Расчет.ТранспортноеСредство КАК ТранспортноеСредство,
	|	ВТ_Расчет.МестнаяДата КАК ДатаСостояния,
	|	ВТ_Расчет.Состояние КАК Состояние,
	|	ВТ_Расчет.ТочкаМаршрута КАК ТочкаМаршрута,
	|	ВТ_Расчет.ДокументРегистрации КАК ДокументРегистрации,
	|	ВТ_Расчет.ТипРегистрации КАК ТипРегистрации,
	|	ВТ_Расчет.ВидПеревозки КАК ВидПеревозки,
	|	ВТ_Расчет.ДокументРегистрацииВъезда КАК ДокументРегистрацииВъезда,
	|	ВТ_Расчет.ДокументРегистрацииВыезда КАК ДокументРегистрацииВыезда,
	|	ВТ_Расчет.ДокументРегистрацииАнализов КАК ДокументРегистрацииАнализов,
	|	ВТ_Расчет.ДокументНаправлениеНаРазгрузку КАК ДокументНаправлениеНаРазгрузку,
	|	ВТ_Расчет.ДокументФормированиеНомераПробы КАК ДокументФормированиеНомераПробы,
	|	ДокументРегистрацияНаПЛК.Номер КАК Номер,
	|	ДокументРегистрацияНаПЛК.МестнаяДата КАК Дата,
	|	ДокументРегистрацияНаПЛК.Водитель КАК Водитель,
	|	ДокументРегистрацияНаПЛК.Контрагент КАК Контрагент,
	|	ДокументРегистрацияНаПЛК.Номенклатура КАК Номенклатура,
	|	ДокументРегистрацияНаПЛК.НомерДокументаПоставщика КАК НомерДокументаПоставщика,
	|	ЕСТЬNULL(ДокументРегистрацияНаПЛК.ВесБрутто, 0) КАК ВесБруттоДокумент,
	|	ЕСТЬNULL(ДокументРегистрацияНаПЛК.ВесНетто, 0) КАК ВесНеттоДокумент,
	|	ЕСТЬNULL(ДокументРегистрацияНаПЛК.ВесТары, 0) КАК ВесТарыДокумент,
	|	ВЫБОР
	|		КОГДА ВТ_Расчет.ТипРегистрации = ЗНАЧЕНИЕ(Перечисление.гкс_ТипРегистрации.Приемка)
	|			ТОГДА ВТ_Расчет.ВесВъезд
	|		ИНАЧЕ ВТ_Расчет.ВесВыезд
	|	КОНЕЦ КАК ВесБрутто,
	|	ВЫБОР
	|		КОГДА ВТ_Расчет.ТипРегистрации <> ЗНАЧЕНИЕ(Перечисление.гкс_ТипРегистрации.Приемка)
	|			ТОГДА ВТ_Расчет.ВесВъезд
	|		ИНАЧЕ ВТ_Расчет.ВесВыезд
	|	КОНЕЦ КАК ВесТары,
	|	ВТ_Расчет.Склад КАК СкладПлан,
	|	ВТ_Расчет.ЯмаРазгрузки КАК ЯмаРазгрузки,
	|	ВТ_Расчет.НомерПробы КАК НомерПробы,
	|	ВЫБОР
	|		КОГДА ВТ_Расчет.ТипРегистрации = ЗНАЧЕНИЕ(Перечисление.гкс_ТипРегистрации.Приемка)
	|			ТОГДА ВЫБОР
	|				КОГДА ВТ_Расчет.ДокументРегистрацииВыезда = НЕОПРЕДЕЛЕНО
	|					ТОГДА 0
	|				ИНАЧЕ ВТ_Расчет.ВесВъезд - ВТ_Расчет.ВесВъезд
	|			КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|			КОГДА ВТ_Расчет.ДокументРегистрацииВъезда = НЕОПРЕДЕЛЕНО
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|				КОГДА ВТ_Расчет.ДокументРегистрацииВыезда = НЕОПРЕДЕЛЕНО
	|					ТОГДА 0
	|				ИНАЧЕ ВТ_Расчет.ВесВыезд
	|			КОНЕЦ - ВТ_Расчет.ВесВъезд
	|		КОНЕЦ
	|	КОНЕЦ КАК ВесНетто,
	|	ВЫБОР
	|		КОГДА ВТ_Расчет.ТипРегистрации = ЗНАЧЕНИЕ(Перечисление.гкс_ТипРегистрации.Приемка)
	|			ТОГДА ВЫБОР
	|				КОГДА ВТ_Расчет.ДокументРегистрацииВъезда = НЕОПРЕДЕЛЕНО
	|					ТОГДА 0
	|				ИНАЧЕ ВТ_Расчет.ВесВъезд
	|			КОНЕЦ - ЕСТЬNULL(ДокументРегистрацияНаПЛК.ВесБрутто, 0)
	|		ИНАЧЕ ВЫБОР
	|			КОГДА ВТ_Расчет.ДокументРегистрацииВыезда = НЕОПРЕДЕЛЕНО
	|				ТОГДА 0
	|			ИНАЧЕ ВТ_Расчет.ВесВыезд
	|		КОНЕЦ - ЕСТЬNULL(ДокументРегистрацияНаПЛК.ВесБрутто, 0)
	|	КОНЕЦ КАК ОтклонениеБрутто,
	|	ВЫБОР
	|		КОГДА ВТ_Расчет.ТипРегистрации = ЗНАЧЕНИЕ(Перечисление.гкс_ТипРегистрации.Приемка)
	|			ТОГДА ВЫБОР
	|				КОГДА ВТ_Расчет.ДокументРегистрацииВыезда = НЕОПРЕДЕЛЕНО
	|					ТОГДА 0
	|				ИНАЧЕ ВТ_Расчет.ВесВъезд - ВТ_Расчет.ВесВыезд - ЕСТЬNULL(ДокументРегистрацияНаПЛК.ВесНетто, 0)
	|			КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|			КОГДА ВТ_Расчет.ДокументРегистрацииВъезда = НЕОПРЕДЕЛЕНО
	|				ТОГДА 0
	|			ИНАЧЕ ВТ_Расчет.ВесВыезд - ВТ_Расчет.ВесВъезд - ЕСТЬNULL(ДокументРегистрацияНаПЛК.ВесНетто, 0)
	|		КОНЕЦ
	|	КОНЕЦ КАК ОтклонениеНетто,
	|	ЕСТЬNULL(ЗаписьВОчередьПриемкиПЛК.НачалоПериода, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ВремяЗаписи,
	|	ЕСТЬNULL(ДокументРегистрацияНаПЛК.Спецификация,
	|		ЗНАЧЕНИЕ(Документ.гкс_СпецификацияКДоговоруКонтрагента.ПустаяСсылка)) КАК Спецификация,
	|	ВЫБОР
	|		КОГДА РегистрацииПоЭлектроннойОчереди.ЗаписьВОчередь ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЖиваяОчередь,
	|	ВТ_Расчет.Комментарий КАК Комментарий,
	|	ВТ_Расчет.ТранспортныйДокумент КАК ТранспортныйДокумент,
	|	ВТ_Расчет.ПунктПогрузки КАК ПунктПогрузки,
	|	ВТ_Расчет.Отправитель КАК Отправитель,
	|	ВТ_Расчет.СтанцияЖД КАК СтанцияЖД
	|ИЗ
	|	ВТ_Расчет КАК ВТ_Расчет
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_РегистрацияНаПЛК КАК ДокументРегистрацияНаПЛК
	|		ПО ВТ_Расчет.ДокументРегистрации = ДокументРегистрацияНаПЛК.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_РегистрацииПоЭлектроннойОчереди КАК РегистрацииПоЭлектроннойОчереди
	|		ПО ВТ_Расчет.ДокументРегистрации = РегистрацииПоЭлектроннойОчереди.РегистрацияНаПЛК
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_ЗаписьВОчередьПриемкиПЛК КАК ЗаписьВОчередьПриемкиПЛК
	|		ПО РегистрацииПоЭлектроннойОчереди.ЗаписьВОчередь = ЗаписьВОчередьПриемкиПЛК.Ссылка";

КонецФункции

#КонецОбласти

#КонецЕсли
