#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	гкс_ФормыОбъектовИАС.ПриСозданииНаСервереФормыСпискаСообщений(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	УстановитьВидимостьДоступностьКомандНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьИдентификаторов();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеСостоянийСообщений" И Параметр = "Справочник.гкс_ВходящиеСообщенияRMQ" Тогда
		Элементы.Список.Обновить();	
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказатьИдентификаторы(Команда)

	Элементы.ПоказатьИдентификаторы.Пометка = НЕ Элементы.ПоказатьИдентификаторы.Пометка;
	УстановитьВидимостьИдентификаторов();
	 	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "Состояние" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Отбор = Новый Структура("Сообщение", Элементы.Список.ТекущаяСтрока);
		
		ОткрытьФорму("РегистрСведений.гкс_СостоянияВходящихСообщений.ФормаСписка",
		Новый Структура("Отбор, ИсторияСообщения", Отбор, Истина),
		ЭтотОбъект,
		ЭтотОбъект.УникальныйИдентификатор,
		,
		,
		Новый ОписаниеОповещения("ОбновитьСписок", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьДоступностьКомандНаСервере()
	
	Элементы.ФормаПолучитьВсеСообщенияИзОчереди.Видимость = 
	                         гкс_ОчередьСообщенийRMQ.РазрешеноРучноеПолучениеСообщенийИзОчереди();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(Результат, ДополнительныеПараметры) Экспорт	
	Элементы.Список.Обновить();	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьИдентификаторов()
	
	Элементы.ИдентификаторСообщения.Видимость = Элементы.ПоказатьИдентификаторы.Пометка;
	Элементы.КорневойИдентификаторСообщения.Видимость = Элементы.ПоказатьИдентификаторы.Пометка;
	
КонецПроцедуры

#КонецОбласти
