#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет является переданное значение ЖД перевозкой
// 
// Параметры:
//  Значение - ПеречислениеСсылка.гкс_ТипыТранспортныхСредствДоставки - 
// 
// Возвращаемое значение:
//  Булево - Это ЖДПеревозк
//
Функция ЭтоЖДПеревозка(Значение) Экспорт	
	Возврат ЖДТранспорт = Значение;	
КонецФункции

// Определяет является переданное значение Авто перевозкой
// 
// Параметры:
//  Значение - ПеречислениеСсылка.гкс_ТипыТранспортныхСредствДоставки - 
// 
// Возвращаемое значение:
//  Булево - Это авто перевозка
//
Функция ЭтоАвтоПеревозка(Значение) Экспорт	
	Возврат Автомобиль = Значение;	
КонецФункции

#КонецОбласти

#КонецЕсли