#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	СтруктураПараметров = Новый Структура;
	
	Для Каждого Параметр Из МакетКомпоновки.ЗначенияПараметров Цикл
		Если Параметр.Имя = "Период" Тогда
			СтруктураПараметров.Вставить("НачалоПериода", Параметр.Значение.ДатаНачала);
			СтруктураПараметров.Вставить("ОкончаниеПериода", Параметр.Значение.ДатаОкончания);
		Иначе
			СтруктураПараметров.Вставить(Параметр.Имя, Параметр.Значение);
		КонецЕсли;	
	КонецЦикла;
		
	ВнешнийНаборДанных = Новый Структура("ТаблицаДанных", ДанныеОтчета(СтруктураПараметров));
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешнийНаборДанных, ДанныеРасшифровки);
	
	ДокументРезультат.Очистить();
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеОтчета(СтруктураПараметров)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РегистрацияНаПЛК.Ссылка КАК Регистрация,
		|	СвязьРегистрацииИТранспортногоДокумента.ТранспортныйДокумент КАК ТранспортныйДокумент,
		|	СвязьРегистрацииИТранспортногоДокумента.ЗаявкаНаПеревозку КАК ЗаявкаНаПеревозку,
		|	РегистрацияНаПЛК.ТранспортноеСредство КАК Транспорт,
		|	РегистрацияНаПЛК.Номенклатура КАК Номенклатура,
		|	РегистрацияНаПЛК.ВидПеревозки КАК ВидПеревозки,
		|	РегистрацияНаПЛК.ТочкаМаршрута КАК ТочкаМаршрута
		|ИЗ
		|	Документ.гкс_РегистрацияНаПЛК КАК РегистрацияНаПЛК
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СвязьРегистрацииИТранспортногоДокумента КАК СвязьРегистрацииИТранспортногоДокумента
		|		ПО РегистрацияНаПЛК.Ссылка = СвязьРегистрацииИТранспортногоДокумента.ДокументРегистрации
		|ГДЕ
		|	РегистрацияНаПЛК.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		|	И РегистрацияНаПЛК.Проведен
		|	И РегистрацияНаПЛК.ТипРегистрации = ЗНАЧЕНИЕ(Перечисление.гкс_ТипРегистрации.Приемка)";
	
	Запрос.УстановитьПараметр("НачалоПериода", СтруктураПараметров.НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", СтруктураПараметров.ОкончаниеПериода);
	
	Если СтруктураПараметров.Свойство("Номенклатура") Тогда
		Запрос.Текст = Запрос.Текст + "
		| И РегистрацияНаПЛК.Номенклатура В(&СписокНоменклатуры)";
		Запрос.УстановитьПараметр("СписокНоменклатуры", СтруктураПараметров.Номенклатура);
	КонецЕсли;
	
	Если СтруктураПараметров.Свойство("Транспорт") Тогда
		Запрос.Текст = Запрос.Текст + "
		| И РегистрацияНаПЛК.ТранспортноеСредство В(&СписокТС)";
		Запрос.УстановитьПараметр("СписокТС", СтруктураПараметров.Транспорт);
	КонецЕсли;
	
	Если СтруктураПараметров.Свойство("ТранспортныйДокумент") Тогда
		Запрос.Текст = Запрос.Текст + "
		| И СвязьРегистрацииИТранспортногоДокумента.ТранспортныйДокумент В(&СписокТранспортныйДокумент)";
		Запрос.УстановитьПараметр("СписокТранспортныйДокумент", СтруктураПараметров.ТранспортныйДокумент);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ДанныеЗапроса = РезультатЗапроса.Выгрузить();
	ДанныеЗапроса.Колонки.Добавить("ВнешняяПроба");
	ДанныеЗапроса.Колонки.Добавить("Показатель");
	ДанныеЗапроса.Колонки.Добавить("ЗначениеПоказателя");
	
	ИтоговаяТаблица = ДанныеЗапроса.СкопироватьКолонки();

	Для Каждого СтрокаДанных Из ДанныеЗапроса Цикл
		
        НоваяСтрока = ИтоговаяТаблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);
		
		ЗначенияВнешнейПробы = гкс_РаботаСПоказателямиНоменклатуры.ПоискДокументаВнешнейПробы(СтрокаДанных.Регистрация);		
		Если Не ЗначениеЗаполнено(ЗначенияВнешнейПробы) Тогда
			Продолжить;
		КонецЕсли;	
		
		НомерИтоговогоУзла = 0;
		ИтоговыйУзел = ЗначенияВнешнейПробы.Строки[НомерИтоговогоУзла];	
		
		Если ИтоговыйУзел.ЕстьВнешний Тогда 
			Сч = 0;
			Пока Сч < ИтоговыйУзел.Строки.Количество() Цикл
				ДанныеВнешнейПробы = ИтоговыйУзел.Строки[Сч]; 
				
				Если Сч > 0 Тогда
					НоваяСтрока = ИтоговаяТаблица.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);
				КонецЕсли;
				
				НоваяСтрока.ВнешняяПроба = ДанныеВнешнейПробы.ВнешняяПроба;
				НоваяСтрока.Показатель = ДанныеВнешнейПробы.Показатель;
                НоваяСтрока.ЗначениеПоказателя = ДанныеВнешнейПробы.ЗначениеПоказателя;
				НоваяСтрока.ЗаявкаНаПеревозку = ДанныеВнешнейПробы.ЗаявкаНаПеревозку;
				
				Сч = Сч + 1;
			КонецЦикла;	
		КонецЕсли;
	КонецЦикла;
	
	Возврат ИтоговаяТаблица;
		
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли