#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда 
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаПечать(Команда)
	
	ПодписантДолжность = гкс_ПриемкаТранспортаВызовСервера.ДолжностьОтветственного(Подписант);
		
	ДанныеПечати = Новый Структура;
	ДанныеПечати.Вставить("Подписант", Подписант);
	ДанныеПечати.Вставить("ПодписантДолжность", ПодписантДолжность);
	
	Закрыть(Новый Структура("ДанныеПечати", ДанныеПечати));
	
КонецПроцедуры

#КонецОбласти
