#Область ПрограммныйИнтерфейс

Функция ПолучитьСохраненныеНастройки(КлючОбъекта, КлючНастроек) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеНастройки = Новый Соответствие;	
	Отбор = Новый Структура("КлючОбъекта,КлючНастроек", КлючОбъекта, КлючНастроек);
	
	Структура = РегистрыСведений.гкс_ХранилищеНастроек.Получить(Отбор);
	
	Если Не Структура = Неопределено Тогда
		
		Настройки = Структура.Настройки.Получить();
		
		Если ТипЗнч(Настройки) = Тип("Соответствие") Тогда						
			Для Каждого ЭлементНастройки Из Настройки Цикл
				ДанныеНастройки.Вставить(ЭлементНастройки.Ключ, ЭлементНастройки.Значение);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат ДанныеНастройки;
	
КонецФункции

Процедура СохраненитьНастройку(КлючОбъекта, КлючНастроек, Настройки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = РегистрыСведений.гкс_ХранилищеНастроек.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.КлючОбъекта = КлючОбъекта;
	МенеджерЗаписи.КлючНастроек = КлючНастроек;
	МенеджерЗаписи.Настройки = Новый ХранилищеЗначения(Настройки);
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Процедура УдалитьНастройку(КлючОбъекта, КлючНастроек) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = РегистрыСведений.гкс_ХранилищеНастроек.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.КлючОбъекта = КлючОбъекта;
	МенеджерЗаписи.КлючНастроек = КлючНастроек;
	МенеджерЗаписи.Удалить();
	
КонецПроцедуры

#КонецОбласти