#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если Не ЭтоГруппа И МинЗначение > МаксЗначение Тогда

		Отказ = Истина;
		
		ТекстСообщения = НСтр("ru='Значение начала интервала должно быть меньше конца интервала.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);

	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
