#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область Проведение

// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив из Строка - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	
	МеханизмыДокумента.Добавить("МорскаяЛогистика");
	
КонецПроцедуры

// Возвращает таблицы для движений, необходимые для проведения документа по регистрам учетных механизмов.
//
// Параметры:
//  Документ - ДокументСсылка, ДокументОбъект - ссылка на документ или объект, по которому необходимо получить данные
//  Регистры - Структура - список имен регистров, для которых необходимо получить таблицы
//  ДопПараметры - Структура - дополнительные параметры для получения данных, определяющие контекст проведения.
//
// Возвращаемое значение:
//  Структура - см. гкс_ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения.
Функция ДанныеДокументаДляПроведения(Документ, Регистры, ДопПараметры = Неопределено) Экспорт
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = гкс_ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	КонецЕсли;
	
	Если ТипЗнч(Документ) = Тип("ДокументОбъект.гкс_РабочаяСмена") Тогда
		ДокументСсылка = Документ.Ссылка;
	Иначе
		ДокументСсылка = Документ;
	КонецЕсли;
	
	Запрос			= Новый Запрос;
	ТекстыЗапроса	= Новый СписокЗначений;
	
	Если Не ДопПараметры.ПолучитьТекстыЗапроса Тогда
		////////////////////////////////////////////////////////////////////////////
		// Создадим запрос инициализации движений
		ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка, ДопПараметры);
		
		////////////////////////////////////////////////////////////////////////////
		// Сформируем текст запроса
		ТекстЗапросаТаблицаСостоянияОбработкиСудов(ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаОбработкаСудов(ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаСостоянияФрахта(ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаВыработкаСмены(ТекстыЗапроса, Регистры);
		
	КонецЕсли;
	
	// Получим таблицы для движений
	Возврат гкс_ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения(Запрос, ТекстыЗапроса, ДопПараметры);
	
КонецФункции

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Подробней См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа
// 
//  Параметры:
//   Ограничение - Структура - со свойствами:
//    * Текст                             - Строка - ограничение доступа для пользователей.
//                                            Если пустая строка, значит, доступ разрешен.
//    * ТекстДляВнешнихПользователей      - Строка - ограничение доступа для внешних пользователей.
//                                            Если пустая строка, значит, доступ запрещен.
//    * ПоВладельцуБезЗаписиКлючейДоступа - Неопределено - определить автоматически.
//                                        - Булево - если Ложь, то всегда записывать ключи доступа,
//                                            если Истина, тогда не записывать ключи доступа,
//                                            а использовать ключи доступа владельца (требуется,
//                                            чтобы ограничение было строго по объекту-владельцу).
///   * ПоВладельцуБезЗаписиКлючейДоступаДляВнешнихПользователей - Неопределено, Булево - см.
//                                            описание предыдущего параметра.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Фрахт.ТочкаМаршрута)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка, ДопПараметры)
	
	МенеджерВременныхТаблиц = Неопределено;
	
	Если ДопПараметры <> Неопределено
		И ДопПараметры.Свойство("МенеджерВременныхТаблиц", МенеджерВременныхТаблиц) Тогда
		
		МенеджерВременныхТаблиц = ?(МенеджерВременныхТаблиц = Неопределено,
			Новый МенеджерВременныхТаблиц,
			МенеджерВременныхТаблиц);
		
	Иначе
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	КонецЕсли;
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ПустаяДата", гкс_ОбщегоНазначенияКлиентСервер.ПустаяДата());
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	ПодготовитьДанныеДокумента(Запрос);
	
КонецПроцедуры

Процедура ПодготовитьДанныеДокумента(Запрос)
	
	Запрос.Текст = ТекстЗапросаДанныеДокумента();
	Запрос.Выполнить();
	
КонецПроцедуры

Функция ТекстЗапросаДанныеДокумента()
	
	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокументРабочаяСмена.Ссылка КАК Ссылка,
	|	ДокументРабочаяСмена.Дата КАК Период,
	|	ДокументРабочаяСмена.Фрахт КАК Фрахт,
	|	ДокументРабочаяСмена.ДатаОкончания КАК ДатаОкончания,
	|	ДокументРабочаяСмена.ПроизводственныеСутки КАК ПроизводственныеСутки
	|ПОМЕСТИТЬ ДанныеДокумента
	|ИЗ
	|	Документ.гкс_РабочаяСмена КАК ДокументРабочаяСмена
	|ГДЕ
	|	ДокументРабочаяСмена.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РабочаяСменаОбработкаСудна.Ссылка КАК Ссылка,
	|	РабочаяСменаОбработкаСудна.ДатаНачала КАК ДатаНачала,
	|	РабочаяСменаОбработкаСудна.ДатаОкончания КАК ДатаОкончания,
	|	РабочаяСменаОбработкаСудна.Силос КАК Силос,
	|	РабочаяСменаОбработкаСудна.Трюм КАК Трюм,
	|	РабочаяСменаОбработкаСудна.Весы КАК Весы,
	|	РабочаяСменаОбработкаСудна.Количество КАК Количество,
	|	РабочаяСменаОбработкаСудна.ВыгруженПолностью КАК ВыгруженПолностью
	|ПОМЕСТИТЬ ДанныеОбработкиСудна
	|ИЗ
	|	Документ.гкс_РабочаяСмена.ОбработкаСудна КАК РабочаяСменаОбработкаСудна
	|ГДЕ
	|	РабочаяСменаОбработкаСудна.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТранспортныеДокументыФрахта.Фрахт КАК Фрахт,
	|	ТранспортныеДокументыФрахта.Трюм КАК Трюм,
	|	ТранспортныеДокументыФрахта.Коносамент КАК Коносамент
	|ПОМЕСТИТЬ ТранспортныеДокументыФрахта
	|ИЗ
	|	РегистрСведений.гкс_ТранспортныеДокументыФрахта КАК ТранспортныеДокументыФрахта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеДокумента КАК ДанныеДокумента
	|		ПО ТранспортныеДокументыФрахта.Фрахт = ДанныеДокумента.Фрахт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПланыРазгрузкиСудов.Номенклатура КАК Номенклатура,
	|	ПланыРазгрузкиСудов.ЕдиницаИзмеренияВеса КАК ЕдиницаИзмеренияВеса,
	|	ПланыРазгрузкиСудов.Трюм КАК Трюм
	|ПОМЕСТИТЬ ПланыРазгрузкиСудов
	|ИЗ
	|	РегистрСведений.гкс_ПланыРазгрузкиСудов КАК ПланыРазгрузкиСудов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеДокумента КАК ДанныеДокумента
	|		ПО ПланыРазгрузкиСудов.Фрахт = ДанныеДокумента.Фрахт";

КонецФункции

Процедура ТекстЗапросаТаблицаСостоянияОбработкиСудов(ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "гкс_СостоянияОбработкиСудов";
	
	Если Не гкс_ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли; 
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Фрахт КАК Фрахт,
	|	ДанныеОбработкиСудна.ДатаНачала КАК ДатаНачала,
	|	ДанныеОбработкиСудна.ДатаОкончания КАК ДатаОкончания,
	|	ДанныеОбработкиСудна.ВыгруженПолностью КАК ВыгруженПолностью,
	|	ДанныеОбработкиСудна.Трюм КАК Трюм,
	|	ДанныеОбработкиСудна.Силос КАК Силос,
	|	ДанныеОбработкиСудна.Весы КАК Весы,
	|	ДанныеДокумента.ПроизводственныеСутки КАК ПроизводственныеСутки,
	|	ЕСТЬNULL(ТранспортныеДокументыФрахта.Коносамент, ЗНАЧЕНИЕ(Документ.гкс_ТранспортныйДокумент.ПустаяСсылка)) КАК
	|		Коносамент
	|ПОМЕСТИТЬ ДанныеОбработкиСуднаПолный
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеОбработкиСудна КАК ДанныеОбработкиСудна
	|			ЛЕВОЕ СОЕДИНЕНИЕ ТранспортныеДокументыФрахта КАК ТранспортныеДокументыФрахта
	|			ПО ДанныеОбработкиСудна.Трюм = ТранспортныеДокументыФрахта.Трюм
	|		ПО ДанныеДокумента.Ссылка = ДанныеОбработкиСудна.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеОбработкиСуднаПолный.ДатаНачала КАК Период,
	|	ДанныеОбработкиСуднаПолный.Фрахт КАК Фрахт,
	|	ДанныеОбработкиСуднаПолный.Коносамент КАК Коносамент,
	|	ДанныеОбработкиСуднаПолный.Трюм КАК Трюм,
	|	ДанныеОбработкиСуднаПолный.Силос КАК Силос,
	|	ДанныеОбработкиСуднаПолный.Весы КАК Весы,
	|	ДанныеОбработкиСуднаПолный.ПроизводственныеСутки КАК ПроизводственныеСутки,
	|	ЗНАЧЕНИЕ(Перечисление.гкс_СостоянияОбработкиСудна.Выгружается) КАК Состояние
	|ИЗ
	|	ДанныеОбработкиСуднаПолный КАК ДанныеОбработкиСуднаПолный
	|ГДЕ
	|	НЕ ДанныеОбработкиСуднаПолный.ДатаНачала = &ПустаяДата
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеОбработкиСуднаПолный.ДатаОкончания,
	|	ДанныеОбработкиСуднаПолный.Фрахт,
	|	ДанныеОбработкиСуднаПолный.Коносамент,
	|	ДанныеОбработкиСуднаПолный.Трюм,
	|	ДанныеОбработкиСуднаПолный.Силос,
	|	ДанныеОбработкиСуднаПолный.Весы КАК Весы,
	|	ДанныеОбработкиСуднаПолный.ПроизводственныеСутки,
	|	ЗНАЧЕНИЕ(Перечисление.гкс_СостоянияОбработкиСудна.Выгружен)
	|ИЗ
	|	ДанныеОбработкиСуднаПолный КАК ДанныеОбработкиСуднаПолный
	|ГДЕ
	|	ДанныеОбработкиСуднаПолный.ВыгруженПолностью
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеОбработкиСуднаПолный.ДатаОкончания,
	|	ДанныеОбработкиСуднаПолный.Фрахт,
	|	ДанныеОбработкиСуднаПолный.Коносамент,
	|	ДанныеОбработкиСуднаПолный.Трюм,
	|	ДанныеОбработкиСуднаПолный.Силос,
	|	ДанныеОбработкиСуднаПолный.Весы КАК Весы,
	|	ДанныеОбработкиСуднаПолный.ПроизводственныеСутки,
	|	ЗНАЧЕНИЕ(Перечисление.гкс_СостоянияОбработкиСудна.ВыгрузкаОстановлена)
	|ИЗ
	|	ДанныеОбработкиСуднаПолный КАК ДанныеОбработкиСуднаПолный
	|ГДЕ
	|	НЕ ДанныеОбработкиСуднаПолный.ДатаНачала = &ПустаяДата
	|	И НЕ ДанныеОбработкиСуднаПолный.ДатаОкончания = &ПустаяДата
	|	И НЕ ДанныеОбработкиСуднаПолный.ВыгруженПолностью
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период,
	|	Трюм";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
КонецПроцедуры

Процедура ТекстЗапросаТаблицаОбработкаСудов(ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "гкс_ОбработкаСудов";
	
	Если Не гкс_ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли; 
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Фрахт КАК Фрахт,
	|	ДанныеДокумента.ДатаОкончания КАК ДатаОкончанияСмены,
	|	ДанныеОбработкиСудна.Трюм КАК Трюм,
	|	СУММА(ДанныеОбработкиСудна.Количество) КАК Количество
	|ПОМЕСТИТЬ ОбработкаСудов
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеОбработкиСудна КАК ДанныеОбработкиСудна
	|		ПО ДанныеДокумента.Ссылка = ДанныеОбработкиСудна.Ссылка
	|		И НЕ ДанныеДокумента.ДатаОкончания = &ПустаяДата
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Фрахт,
	|	ДанныеДокумента.ДатаОкончания,
	|	ДанныеОбработкиСудна.Трюм
	|ИМЕЮЩИЕ
	|	СУММА(ДанныеОбработкиСудна.Количество) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ОбработкаСудов.Фрахт КАК Фрахт,
	|	ОбработкаСудов.ДатаОкончанияСмены КАК Период,
	|	ОбработкаСудов.Трюм КАК Трюм,
	|	ОбработкаСудов.Количество КАК Количество,
	|	ЕСТЬNULL(ТранспортныеДокументыФрахта.Коносамент, ЗНАЧЕНИЕ(Документ.гкс_ТранспортныйДокумент.ПустаяСсылка)) КАК
	|		Коносамент,
	|	ЕСТЬNULL(ПланыРазгрузкиСудов.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	|	ЕСТЬNULL(ПланыРазгрузкиСудов.ЕдиницаИзмеренияВеса, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) КАК
	|		ЕдиницаИзмеренияВеса
	|ИЗ
	|	ОбработкаСудов КАК ОбработкаСудов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТранспортныеДокументыФрахта КАК ТранспортныеДокументыФрахта
	|		ПО ОбработкаСудов.Фрахт = ТранспортныеДокументыФрахта.Фрахт
	|		И ОбработкаСудов.Трюм = ТранспортныеДокументыФрахта.Трюм
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланыРазгрузкиСудов КАК ПланыРазгрузкиСудов
	|		ПО ОбработкаСудов.Трюм = ПланыРазгрузкиСудов.Трюм
	|
	|УПОРЯДОЧИТЬ ПО
	|	Трюм";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
КонецПроцедуры

Процедура ТекстЗапросаТаблицаСостоянияФрахта(ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "гкс_СостоянияФрахта";
	
	Если Не гкс_ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли; 
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Период КАК Период,
	|	ДанныеДокумента.Фрахт КАК Фрахт,
	|	ЗНАЧЕНИЕ(Перечисление.гкс_СостоянияТранспортныхСредств.ВыгрузкаРазрешена) КАК Состояние
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_Фрахт КАК ДокументФрахт
	|		ПО ДанныеДокумента.Фрахт = ДокументФрахт.Ссылка";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
КонецПроцедуры

Процедура ТекстЗапросаТаблицаВыработкаСмены(ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "гкс_ВыработкаСмены";
	
	Если Не гкс_ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли; 
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Фрахт КАК Фрахт,
	|	ДанныеДокумента.ПроизводственныеСутки КАК ПроизводственныеСутки,
	|	ДанныеОбработкиСудна.ДатаОкончания КАК ДатаОкончанияОперации,
	|	ДанныеОбработкиСудна.Трюм КАК Трюм,
	|	ДанныеОбработкиСудна.Силос КАК Силос,
	|	ДанныеОбработкиСудна.Количество КАК Количество
	|ПОМЕСТИТЬ ВыработкаСмены
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеОбработкиСудна КАК ДанныеОбработкиСудна
	|		ПО ДанныеДокумента.Ссылка = ДанныеОбработкиСудна.Ссылка
	|		И ДанныеОбработкиСудна.Количество > 0
	|		И НЕ ДанныеОбработкиСудна.ДатаОкончания = &ПустаяДата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыработкаСмены.Фрахт КАК Фрахт,
	|	ВыработкаСмены.ДатаОкончанияОперации КАК Период,
	|	ВыработкаСмены.ПроизводственныеСутки КАК ПроизводственныеСутки,
	|	ВыработкаСмены.Трюм КАК Трюм,
	|	ВыработкаСмены.Силос КАК Силос,
	|	ВыработкаСмены.Количество КАК Количество,
	|	ЕСТЬNULL(ПланыРазгрузкиСудов.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	|	ЕСТЬNULL(ПланыРазгрузкиСудов.ЕдиницаИзмеренияВеса, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) КАК
	|		ЕдиницаИзмеренияВеса
	|ИЗ
	|	ВыработкаСмены КАК ВыработкаСмены
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланыРазгрузкиСудов КАК ПланыРазгрузкиСудов
	|		ПО ВыработкаСмены.Трюм = ПланыРазгрузкиСудов.Трюм
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период,
	|	Трюм";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли