
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ФормаКомандаРазрешитьРедактировать.Доступность = Пользователи.РолиДоступны("ПолныеПрава");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УстановитьДоступностьЭлементовФормы();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура ТекстыСообщенияЗначениеОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка 	= Ложь;
	ТекСтрока 				= Элементы.ТекстыСообщения.ТекущиеДанные;
	
	ОткрытьЗначение(ТекСтрока.Значение);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаРазрешитьРедактировать(Команда)
	
	РазрешитьРедактировать = Не РазрешитьРедактировать;
	УстановитьДоступностьЭлементовФормы();
	УстановитьПометкуКоманды();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьДоступностьЭлементовФормы()
	
	Элементы.ГруппаШапка.ТолькоПросмотр 			= Не РазрешитьРедактировать;
	Элементы.ДатаСоздания.Доступность 				= РазрешитьРедактировать;
	Элементы.Обработан.Доступность 					= РазрешитьРедактировать;
	
	Элементы.ГруппаВходящиеЗначения.ТолькоПросмотр 	= Не РазрешитьРедактировать;
	Элементы.ДатаИзменения.Доступность 				= РазрешитьРедактировать;
	Элементы.ДатаПробы.Доступность 					= РазрешитьРедактировать;
	Элементы.ДатаПогрузки.Доступность 				= РазрешитьРедактировать;
	Элементы.ИДКомпозитнойПробы.Доступность 		= РазрешитьРедактировать;
	Элементы.ИДПробы.Доступность 					= РазрешитьРедактировать;
	Элементы.Комментарий.Доступность 				= РазрешитьРедактировать;
    Элементы.МестоИнспекции.Доступность 			= РазрешитьРедактировать;
	Элементы.НомерДокумента.Доступность 			= РазрешитьРедактировать;
	Элементы.НомерЗаявки.Доступность 				= РазрешитьРедактировать;
	
	Элементы.ТекстыСообщения.ТолькоПросмотр 		= Не РазрешитьРедактировать;
	Элементы.ТекстыСообщенияКлюч.Доступность 		= РазрешитьРедактировать;
	Элементы.ТекстыСообщенияЗначение.Доступность 	= РазрешитьРедактировать;
	Элементы.ТекстыСообщенияТипОбъекта.Доступность 	= РазрешитьРедактировать;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкуКоманды()
	
	Элементы.ФормаКомандаРазрешитьРедактировать.Пометка = РазрешитьРедактировать;
	
КонецПроцедуры

#КонецОбласти
