
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СДИЗНаПЛКОбороты.СДИЗ КАК СДИЗ,
	|	СДИЗНаПЛКОбороты.КоличествоОборот КАК ПогашеноНаПЛК
	|ИЗ
	|	РегистрНакопления.гкс_СДИЗНаПЛК.Обороты(,,, СДИЗ В (&СписокСДИЗ)) КАК СДИЗНаПЛКОбороты";
	Запрос.УстановитьПараметр("СписокСДИЗ", Строки.ПолучитьКлючи());
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаСписка = Строки[Выборка.СДИЗ];
		СтрокаСписка.Данные["ПогашеноНаПЛК"] = Выборка.ПогашеноНаПЛК;
		СтрокаСписка.Оформление["ПогашеноНаПЛК"].УстановитьЗначениеПараметра("Формат", "ЧЦ=15; ЧДЦ=3; ЧРГ=; ЧН=;");
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

