
&НаСервере
Процедура ПроверитьСоединениеНаСервере()
	Клиент = ОчередьСообщений.СоздатьЭкземплярКомпоненты();
	Если Объект.БезопасноеСоединение Тогда
		Клиент.УстановитьБезопасноеСоединение(
		    Объект.ПутьКФайлуСертификатаУдостоверяющегоЦентра,
		    Объект.ПутьКФайлуЗакрытогоКлюча,
		    Объект.ПутьКФайлуСертификатаКлиента,
		    Объект.АдресСервера,
		    Объект.Логин,
		    Объект.Пароль,
		    Объект.Порт,
		    Объект.ВиртуальныйХост,
		    ,
		    Объект.ПроверкаСоответствияИмениСервера);
	Иначе
		Клиент.УстановитьСоединение(
			Объект.АдресСервера,
			Объект.Логин,
			Объект.Пароль,
			Объект.Порт,
			Объект.ВиртуальныйХост);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСоединение(Команда)
	Попытка
		ПроверитьСоединениеНаСервере();
		ПоказатьОповещениеПользователя(НСтр("ru = 'Соединение успешно установлено'"));
	Исключение
		Сообщить(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
КонецПроцедуры
