
#Область ПрограммныйИнтерфейс

// Обработчик регламентного задания гкс_ОповещениеОПроблемахДоставкиСообщений
//
Процедура ОповещениеОПроблемахДоставкиСообщенийСРПВ() Экспорт

	РегламентноеЗадание = Метаданные.РегламентныеЗадания.гкс_ОповещениеОПроблемахДоставкиСообщенийСРПВ;
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(РегламентноеЗадание);

	УстановитьПривилегированныйРежим(Истина);

	ЗаписьЖурналаРегистрации(РегламентноеЗадание.Представление(),
		УровеньЖурналаРегистрации.Информация,,,
		НСтр("ru = 'Начато регламентное задание оповещения о проблемах обмена с СРПВ.'"));

	Если Не (ПолучитьФункциональнуюОпцию("ИспользоватьШаблоныСообщений")
		И ПолучитьФункциональнуюОпцию("ИспользоватьЭлектроннуюПочтуВШаблонахСообщений")) Тогда

		Текст = НСтр("ru = 'Регламентное задание недоступно по функциональным опциям:
						|<Использовать шаблоны сообщений>/<Использовать электронную почту в шаблонах сообщений>.
						|Выполнение прервано. Задание отключено.'");
		РегламентныеЗаданияСервер.ОтменитьВыполнениеЗадания(РегламентноеЗадание, Текст);
		Возврат;
	КонецЕсли;

	ВыполнитьОповещениеДляПроблемПодготовкиОтправки();
	ВыполнитьОповещениеДляПроблемДоставкиОбработки();

	ЗаписьЖурналаРегистрации(РегламентноеЗадание.Представление(),
		УровеньЖурналаРегистрации.Информация,,,
		НСтр("ru = 'Закончено регламентное задание оповещения о проблемах обмена с СРПВ.'"));

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Обработчик подписки на событие "При записи" регистра Состояния исходящих сообщений.
// Извлекает из источника сообщения, для которых существуют Настройки подтверждения доставки,
// и добавляет записи в регистр Подтверждения доставки сообщений.
//
// Параметры:
//  Источник	 - РегистрСведенийНаборЗаписей.гкс_СостоянияИсходящихСообщений - набор записей для извлечения и фиксации событий.
//  Отказ		 - Булево - возможность отказаться от записи набора-источника.
//  Замещение	 - Булево - режим записи набора-источника.
//
Процедура ЗафиксироватьСобытиеДляПодтверждениеДоставки(Источник, Отказ, Замещение) Экспорт

	Если Не Источник.Количество() Тогда
		Возврат;
	КонецЕсли;

	КоллекцияСообщений 	= КоллекцияСообщенийДляОбработки(Источник.Отбор);
	Если КоллекцияСообщений = Неопределено Тогда
		Возврат;
	КонецЕсли;

	МенеджерРегистра 	= РегистрыСведений.гкс_ПодтвержденияДоставкиСообщений;
	НаборЗаписей		= МенеджерРегистра.СоздатьНаборЗаписей();
	Для Каждого СтрокаКоллекции Из КоллекцияСообщений Цикл

		Если Не ЗначениеЗаполнено(СтрокаКоллекции.КлючИдентификатораСобытия) Тогда
			Продолжить;
		КонецЕсли;

		Если МенеджерРегистра.СостояниеСообщенияОтражено(
			СтрокаКоллекции.Состояние, СтрокаКоллекции.ИдентификаторСообщения) Тогда
			Продолжить;
		КонецЕсли;

		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.Период = ТекущаяДатаСеанса();
		ЗаполнитьЗначенияСвойств(ЗаписьНабора, СтрокаКоллекции);
		Попытка

			ЗаписьНабора.ИдентификаторСобытия = ИзвлечьИдентификаторСобытия(
				СтрокаКоллекции.Сообщение, СтрокаКоллекции.КлючИдентификатораСобытия);

		Исключение

			ИнформацияОбОшибке 				= ИнформацияОбОшибке();
			КраткоеПредставлениеОшибки 		= ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
			ПодробноеПредставлениеОшибки 	= ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
			ПредставлениеОшибкиДляЖурнала 	= СтрШаблон(
				НСтр("ru = 'Не удалось извлечь Идентификатор события из сообщения!
					|Источник: %1
					|Идентификатор сообщения: %2
					|============================================================================
					|%3
					|============================================================================
					|%4'"),
				СтрокаКоллекции.Источник,
				СтрокаКоллекции.ИдентификаторСообщения,
				СтрокаКоллекции.Сообщение,
				ПодробноеПредставлениеОшибки);

			ЗаписьНабора.ОписаниеОшибки = КраткоеПредставлениеОшибки;
			ЗаписьНабора.Состояние		= Перечисления.гкс_СостоянияИсходящихСообщенийRMQ.ОшибкаФормированияСостояния;

			ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Ошибка,
				СтрокаКоллекции.Источник.Метаданные(),
				СтрокаКоллекции.Источник,
				ПредставлениеОшибкиДляЖурнала);

		КонецПопытки;

	КонецЦикла;

	ЗаписатьНаборПодтвержденияДоставки(НаборЗаписей);

КонецПроцедуры

// Обработчик входящих сообщений. Добавляет в регистр Подтверждения доставки сообщений запись
// по полученным данным.
//
// Параметры:
//  ДанныеСообщения - Структура - Данные полученного сообщения.
//
// Возвращаемое значение:
//  Структура - Обработать входящее сообщение:
// * Успешно - Булево - Истина, если сообщение обработано без ошибок.
// * Источник - Неопределено, ДокументСсылка.гкс_НаправлениеНаРазгрузку - найденный по входящим данным источник события.
Функция ОбработатьВходящееСообщение(ДанныеСообщения) Экспорт

	РезультатОбработки = Новый Структура;
	РезультатОбработки.Вставить("Успешно", 	Истина);
	РезультатОбработки.Вставить("Источник", Неопределено);

	МенеджерРегистра 			= РегистрыСведений.гкс_ПодтвержденияДоставкиСообщений;
	НаборЗаписей				= МенеджерРегистра.СоздатьНаборЗаписей();

	ИдентификаторСобытия		= ДанныеСообщения.messageId;
	РезультатОбработки.Источник	= МенеджерРегистра.ИсточникПоИдентификаторуСобытия(ИдентификаторСобытия);
	Если РезультатОбработки.Источник = Неопределено Тогда

		ПредставлениеОшибкиДляЖурнала 	= СтрШаблон(
			НСтр("ru = 'Не удалось определить источник по идентификатору события!
				|============================================================================
				|%1'"),
			ИдентификаторСобытия);

		ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,
			НаборЗаписей.Метаданные(),,
			ПредставлениеОшибкиДляЖурнала);

	КонецЕсли;

	ЗаписьНабора = НаборЗаписей.Добавить();
	ЗаписьНабора.Период 				= ТекущаяДатаСеанса();
	ЗаписьНабора.Источник 				= РезультатОбработки.Источник;
	ЗаписьНабора.ИдентификаторСобытия 	= ИдентификаторСобытия;
	ЗаписьНабора.ИдентификаторСообщения = ДанныеСообщения.ИдентификаторСообщения;
	ЗаписьНабора.ОписаниеОшибки 		= ДанныеСообщения.Error;
	Если ДанныеСообщения.Success = Истина Тогда
		ЗаписьНабора.Состояние = МенеджерРегистра.СостояниеУспешноДляВходящегоСообщения();
	Иначе
		ЗаписьНабора.Состояние = МенеджерРегистра.СостояниеОшибкаДляВходящегоСообщения();
	КонецЕсли;

	Если Не ЗаписатьНаборПодтвержденияДоставки(НаборЗаписей) Тогда
		РезультатОбработки.Успешно = Ложь;
	КонецЕсли;

	Возврат РезультатОбработки;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИмяСобытияЖурналаРегистрации()
	Возврат НСтр("ru = 'Подтверждение доставки сообщений'");
КонецФункции

Функция ИзвлечьИдентификаторСобытия(Сообщение, КлючИдентификатораСобытия)

	РезультатПриведения = КоннекторHTTP.JsonВОбъект(Сообщение);
	Возврат РезультатПриведения.Получить(КлючИдентификатораСобытия);

КонецФункции

Функция КоллекцияСообщенийДляОбработки(Отбор)

	КоллекцияСообщений = Неопределено;

	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаКоллекцииСообщенийДляОбработки();
	Для Каждого КлючЗначение Из Отбор Цикл
		Запрос.УстановитьПараметр(КлючЗначение.Имя, КлючЗначение.Значение);
	КонецЦикла;

	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		КоллекцияСообщений = РезультатЗапроса.Выгрузить();
	КонецЕсли;

	Возврат КоллекцияСообщений;

КонецФункции

Функция ТекстЗапросаКоллекцииСообщенийДляОбработки()
	Возврат
	"ВЫБРАТЬ
	|	СостоянияИсходящихСообщений.Состояние КАК Состояние,
	|	СправочникИсходящиеСообщения.Сообщение КАК Сообщение,
	|	СправочникИсходящиеСообщения.гкс_ОбъектСобытия КАК ОбъектСобытия,
	|	СправочникИсходящиеСообщения.гкс_НастройкаПолучателя КАК НастройкаПолучателя,
	|	СправочникИсходящиеСообщения.ИдентификаторСообщения КАК ИдентификаторСообщения
	|ПОМЕСТИТЬ СостоянияИсходящихСообщений
	|ИЗ
	|	РегистрСведений.гкс_СостоянияИсходящихСообщений КАК СостоянияИсходящихСообщений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИсходящиеСообщения КАК СправочникИсходящиеСообщения
	|		ПО СостоянияИсходящихСообщений.Сообщение = СправочникИсходящиеСообщения.Ссылка
	|ГДЕ
	|	СостоянияИсходящихСообщений.Сообщение = &Сообщение
	|	И СостоянияИсходящихСообщений.УчастникОбмена = &УчастникОбмена
	|	И СостоянияИсходящихСообщений.УниверсальнаяДатаСобытияВМиллисекундах = &УниверсальнаяДатаСобытияВМиллисекундах
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СостоянияИсходящихСообщений.Состояние КАК Состояние,
	|	СостоянияИсходящихСообщений.Сообщение КАК Сообщение,
	|	СостоянияИсходящихСообщений.ОбъектСобытия КАК ОбъектСобытия,
	|	СостоянияИсходящихСообщений.НастройкаПолучателя КАК НастройкаПолучателя,
	|	СостоянияИсходящихСообщений.ИдентификаторСообщения КАК ИдентификаторСообщения,
	|	ЕСТЬNULL(ИдентификаторыОбъектовМетаданных.Ссылка, ЗНАЧЕНИЕ(Справочник.ИдентификаторыОбъектовМетаданных.ПустаяСсылка)) КАК ТипОбъектаСобытия
	|ПОМЕСТИТЬ СообщенияДляОбработки
	|ИЗ
	|	СостоянияИсходящихСообщений КАК СостоянияИсходящихСообщений
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
	|		ПО (ТИПЗНАЧЕНИЯ(СостоянияИсходящихСообщений.ОбъектСобытия) = ТИПЗНАЧЕНИЯ(ИдентификаторыОбъектовМетаданных.ЗначениеПустойСсылки))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СообщенияДляОбработки.Состояние КАК Состояние,
	|	СообщенияДляОбработки.Сообщение КАК Сообщение,
	|	СообщенияДляОбработки.ОбъектСобытия КАК Источник,
	|	СообщенияДляОбработки.ИдентификаторСообщения КАК ИдентификаторСообщения,
	|	НастройкиПодтвержденияДоставкиСообщений.КлючИдентификатораСобытия КАК КлючИдентификатораСобытия
	|ИЗ
	|	СообщенияДляОбработки КАК СообщенияДляОбработки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гкс_НастройкиПодтвержденияДоставкиСообщений КАК НастройкиПодтвержденияДоставкиСообщений
	|		ПО СообщенияДляОбработки.НастройкаПолучателя = НастройкиПодтвержденияДоставкиСообщений.НастройкаПолучателя
	|			И СообщенияДляОбработки.ТипОбъектаСобытия = НастройкиПодтвержденияДоставкиСообщений.ТипОбъектаСобытия";
КонецФункции

Функция ЗаписатьНаборПодтвержденияДоставки(НаборЗаписей)

	Отказ = Ложь;

	Попытка

		Если НаборЗаписей.Количество() Тогда
			НаборЗаписей.Записать(РежимЗамещения.Слияние);
		КонецЕсли;

	Исключение

		Отказ = Истина;
		ИнформацияОбОшибке 				= ИнформацияОбОшибке();
		ПодробноеПредставлениеОшибки 	= ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ПредставлениеОшибкиДляЖурнала 	= СтрШаблон(
			НСтр("ru = 'Не удалось зафиксировать данные для подтверждения доставки сообщения!
				|============================================================================
				|%1'"),
			ПодробноеПредставлениеОшибки);

		ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,
			НаборЗаписей.Метаданные(),,
			ПредставлениеОшибкиДляЖурнала);

	КонецПопытки;

	Возврат Не Отказ;

КонецФункции

Процедура ВыполнитьОповещениеДляПроблемПодготовкиОтправки()

	Подписка = Справочники.гкс_ПодпискиНаРассылкиИОповещения.ПроблемыПодготовкиОтправкиСообщенийДляСРПВ;
	Если Не ПодпискаНаРассылкуИспользуется(Подписка) Тогда
		Возврат;
	КонецЕсли;

	ПроблемныеСостояния = Новый Массив;
	ПроблемныеСостояния.Добавить(Перечисления.гкс_СостоянияИсходящихСообщенийRMQ.Подготовлено);
	ПроблемныеСостояния.Добавить(Перечисления.гкс_СостоянияИсходящихСообщенийRMQ.ОшибкаФормированияСостояния);

	ОбработатьПроблемныеСообщения(Подписка, ПроблемныеСостояния);

КонецПроцедуры

Процедура ВыполнитьОповещениеДляПроблемДоставкиОбработки()

	Подписка = Справочники.гкс_ПодпискиНаРассылкиИОповещения.ПроблемыДоставкиОбработкиСообщенийОтСРПВ;
	Если Не ПодпискаНаРассылкуИспользуется(Подписка) Тогда
		Возврат;
	КонецЕсли;

	ПроблемныеСостояния = Новый Массив;
	ПроблемныеСостояния.Добавить(Перечисления.гкс_СостоянияИсходящихСообщенийRMQ.Отправлено);
	ПроблемныеСостояния.Добавить(Перечисления.гкс_СостоянияИсходящихСообщенийRMQ.ОшибкаОбработкиПолучателем);

	ОбработатьПроблемныеСообщения(Подписка, ПроблемныеСостояния);

КонецПроцедуры

Функция РезультатЗапросаПоПроблемнымСостояниям(ДатаАктуальности, ПроблемныеСостояния)

	ПериодОжиданияОтветаОтСРПВ = Константы.гкс_ПериодОжиданияОтветаОтСРПВ.Получить();

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущаяДата", ДатаАктуальности);
	Запрос.УстановитьПараметр("ПроблемныеСостояния", ПроблемныеСостояния);
	Запрос.УстановитьПараметр("ПериодОжиданияОтветаОтСРПВ", ПериодОжиданияОтветаОтСРПВ);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПодтвержденияДоставкиСообщений.Период КАК Период,
	|	ПодтвержденияДоставкиСообщений.Источник КАК Источник,
	|	ПодтвержденияДоставкиСообщений.Состояние КАК Состояние,
	|	ПодтвержденияДоставкиСообщений.ИдентификаторСобытия КАК ИдентификаторСобытия,
	|	ПодтвержденияДоставкиСообщений.ИдентификаторСообщения КАК ИдентификаторСообщения,
	|	ПодтвержденияДоставкиСообщений.ОписаниеОшибки КАК ОписаниеОшибки,
	|	ИСТИНА КАК УведомлениеПоОшибкеСформировано
	|ПОМЕСТИТЬ ПодтвержденияДоставкиСообщений
	|ИЗ
	|	РегистрСведений.гкс_ПодтвержденияДоставкиСообщений.СрезПоследних(, РАЗНОСТЬДАТ(Период, &ТекущаяДата,
	|		СЕКУНДА) > &ПериодОжиданияОтветаОтСРПВ) КАК ПодтвержденияДоставкиСообщений
	|ГДЕ
	|	ПодтвержденияДоставкиСообщений.Состояние В (&ПроблемныеСостояния)
	|	И НЕ ПодтвержденияДоставкиСообщений.УведомлениеПоОшибкеСформировано
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Источник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПодтвержденияДоставкиСообщений.Период КАК Период,
	|	ПодтвержденияДоставкиСообщений.Источник КАК Источник,
	|	ПодтвержденияДоставкиСообщений.Состояние КАК Состояние,
	|	ПодтвержденияДоставкиСообщений.ИдентификаторСобытия КАК ИдентификаторСобытия,
	|	ПодтвержденияДоставкиСообщений.ИдентификаторСообщения КАК ИдентификаторСообщения,
	|	ПодтвержденияДоставкиСообщений.ОписаниеОшибки КАК ОписаниеОшибки,
	|	ПодтвержденияДоставкиСообщений.УведомлениеПоОшибкеСформировано КАК УведомлениеПоОшибкеСформировано
	|ИЗ
	|	ПодтвержденияДоставкиСообщений КАК ПодтвержденияДоставкиСообщений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_НаправлениеНаРазгрузку КАК ДокументНаправлениеНаРазгрузку
	|		ПО ПодтвержденияДоставкиСообщений.Источник = ДокументНаправлениеНаРазгрузку.Ссылка";
	Возврат Запрос.Выполнить();

КонецФункции

Процедура ОбработатьПроблемныеСообщения(Подписка, ПроблемныеСостояния)

	ДатаАктуальности = ТекущаяДатаСеанса();
	РезультатЗапроса = РезультатЗапросаПоПроблемнымСостояниям(ДатаАктуальности, ПроблемныеСостояния);
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;

	ИнтервалАктуальностиОповещения	= 30;
	ДатаОтправки		= гкс_ОбщегоНазначенияКлиентСервер.ПустаяДата();
	ДатаАктуальности	= ДатаАктуальности + гкс_ОбщегоНазначенияКлиентСервер.ПересчитатьВСекунды(
		ИнтервалАктуальностиОповещения, "МИНУТА");

	НачатьТранзакцию();
	Попытка
		НаборОчередиОповещений = РегистрыСведений.гкс_ОчередьСобытийДляОповещений.СоздатьНаборЗаписей();
		НаборПодтвержденийДоставки = РегистрыСведений.гкс_ПодтвержденияДоставкиСообщений.СоздатьНаборЗаписей();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл

			ЗаписьНабора = НаборОчередиОповещений.Добавить();
			ЗаписьНабора.Период = ТекущаяДатаСеанса();
			ЗаписьНабора.Подписка = Подписка;
			ЗаписьНабора.ИсточникОповещения = Выборка.Источник;
			ЗаписьНабора.ДатаОтправки = ДатаОтправки;
			ЗаписьНабора.ДатаАктуальностиОтправки = ДатаАктуальности;

			ЗаполнитьЗначенияСвойств(НаборПодтвержденийДоставки.Добавить(), Выборка);

		КонецЦикла;

		НаборОчередиОповещений.Записать(РежимЗамещения.Слияние);
		НаборПодтвержденийДоставки.Записать(РежимЗамещения.Слияние);

		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();

		ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,,,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));

	КонецПопытки;

КонецПроцедуры

Функция ПодпискаНаРассылкуИспользуется(Подписка)

	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Подписка, "ПодпискаДействует") = Истина;

КонецФункции

#КонецОбласти
