#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
		
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбновитьДанныеСопоставленияЛИМС();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыАнализы

&НаКлиенте
Процедура АнализыПоказательАнализаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Анализы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	АнализыПоказательАнализаПриИзмененииНаСервере();
	УстановитьВидимостьДекорацииОтсутствияСопоставленияЛИМС();
	
КонецПроцедуры

&НаКлиенте
Процедура АнализыПриАктивизацииСтроки(Элемент)
	
	УстановитьВидимостьДекорацииОтсутствияСопоставленияЛИМС();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	гкс_ОбщегоНазначенияПЛККлиент.ПровестиИЗакрыть(ЭтотОбъект, Ложь);	
КонецПроцедуры

&НаКлиенте
Процедура Провести(Команда)
	гкс_ОбщегоНазначенияПЛККлиент.Провести(ЭтотОбъект, Ложь);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура АнализыПоказательАнализаПриИзмененииНаСервере()
	
	ТекущиеДанные = Объект.Анализы.НайтиПоИдентификатору(Элементы.Анализы.ТекущаяСтрока);
	
	ДанныеПоказателя = ПараметрыПоказателя(ТекущиеДанные.ПоказательАнализа);
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, ДанныеПоказателя);
	
	ОбновитьДанныеСопоставленияЛИМС(ТекущиеДанные.ПоказательАнализа);
	
КонецПроцедуры

&НаСервере
Функция ПараметрыПоказателя(Показатель)

	Реквизиты = Новый Структура;
	Реквизиты.Вставить("ЕдиницаИзмерения", "ЕдиницаИзмерения");
	Реквизиты.Вставить("ОтклонятьКачество", "гкс_ПриОтклоненииОтНормыОтклонятьКачество");
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Показатель, Реквизиты);
	
КонецФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура ОбновитьДанныеСопоставленияЛИМС(Показатель = Неопределено)
	
	МенеджерРегистра = РегистрыСведений.гкс_КодыПоказателейКачестваЛИМС;
	
	ПараметрыСопоставления = МенеджерРегистра.ИнициализироватьПараметрыСопоставленияПоказателей();
	ПараметрыСопоставления.ТочкаМаршрута = Объект.ТочкаМаршрута;
	ПараметрыСопоставления.Номенклатура = Объект.Номенклатура;
	ПараметрыСопоставления.ВидПеревозки = Объект.гкс_ВидПеревозки;
	ПараметрыСопоставления.ТипПробы = Перечисления.гкс_НазначенияИспользованияКачества
		.ТипПробыПоНазначениюИспользованияКачества(Объект.гкс_НазначениеИспользованияКачества);
		
	Если Показатель = Неопределено Тогда
		Анализы = Объект.Анализы.Выгрузить(, "ПоказательАнализа");
		ПараметрыСопоставления.Показатели = Анализы.ВыгрузитьКолонку("ПоказательАнализа")
	Иначе
		ПараметрыСопоставления.Показатели = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Показатель);
	КонецЕсли;
		
	СопоставлениеПоказателей = МенеджерРегистра.СопоставлениеПоказателейПоПараметрам(ПараметрыСопоставления);
	Для Каждого ДанныеСопоставления Из СопоставлениеПоказателей Цикл
		
		Отбор = Новый Структура("ПоказательАнализа", ДанныеСопоставления.ПоказательАнализа);
		СтрокиОтбора = Объект.Анализы.НайтиСтроки(Отбор);
		Для Каждого СтрокаОтбора Из СтрокиОтбора Цикл
			СтрокаОтбора.НетСопоставленияЛИМС = ДанныеСопоставления.НетСопоставленияЛИМС;
		КонецЦикла;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДекорацииОтсутствияСопоставленияЛИМС()
	
	ТекущиеДанные = Элементы.Анализы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Элементы.ДекорацияОтсутствиеСопоставленияЛИМС.Видимость = Ложь;
	Иначе
		Элементы.ДекорацияОтсутствиеСопоставленияЛИМС.Видимость = ТекущиеДанные.НетСопоставленияЛИМС;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
