
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Не Параметры.Свойство("Фрахт", Фрахт) Тогда
		ТекстСообщения = НСтр("ru = 'Форма не предназначена для непосредственного использования'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		Возврат;
	КонецЕсли;
	
	ДанныеФрахта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Фрахт, "Судно,ПланОбработкиСудна");
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		СписокКоносаментов, "ОтборСудно", ДанныеФрахта.Судно);
	ПланОбработкиСудна.Загрузить(ДанныеФрахта.ПланОбработкиСудна.Выгрузить());
	ПланОбработкиСудна.Сортировать("Трюм");
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокКоносаментов

&НаКлиенте
Процедура СписокКоносаментовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Для Каждого ИдентификаторСтроки Из Элементы.ПланОбработкиСудна.ВыделенныеСтроки Цикл
		ТекущиеДанные = ПланОбработкиСудна.НайтиПоИдентификатору(ИдентификаторСтроки);
		ТекущиеДанные.ТранспортныйДокумент = Элементы.СписокКоносаментов.ТекущаяСтрока;	
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокКоносаментовПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылки", Строки.ПолучитьКлючи());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТранспортныйДокументТранспортныеСредства.Ссылка КАК Ссылка,
	|	СУММА(ТранспортныйДокументТранспортныеСредства.ВесНетто) КАК ВесПоДокументу
	|ИЗ
	|	Документ.гкс_ТранспортныйДокумент.ТранспортныеСредства КАК ТранспортныйДокументТранспортныеСредства
	|ГДЕ
	|	ТранспортныйДокументТранспортныеСредства.Ссылка В(&Ссылки)
	|СГРУППИРОВАТЬ ПО
	|	ТранспортныйДокументТранспортныеСредства.Ссылка";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаСписка = Строки[Выборка.Ссылка];
		СтрокаСписка.Данные["ВесПоДокументу"] = Выборка.ВесПоДокументу;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьПрибытиеСуднаНаПЛК(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		ДокументПрибытия = СоздатьПрибытиеСуднаНаПЛКНаСервере();
		Если Не ДокументПрибытия = Неопределено Тогда
			Закрыть(ДокументПрибытия);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СоздатьПрибытиеСуднаНаПЛКНаСервере()
	
	Результат = Неопределено;
	ДокументПрибытия = Документы.гкс_ПрибытиеСуднаНаПЛК.СоздатьДокумент();
	ДокументПрибытия.Заполнить(Фрахт);
	ДокументПрибытия.Отправитель = Отправитель;
	Для Каждого СтрокаПлана Из ПланОбработкиСудна Цикл
		СтрокаДокумента = ДокументПрибытия.ТранспортныеДокументы.Найти(СтрокаПлана.Трюм, "Трюм");
		Если Не СтрокаДокумента = Неопределено Тогда
			СтрокаДокумента.ТранспортныйДокумент = СтрокаПлана.ТранспортныйДокумент;
		КонецЕсли;
	КонецЦикла;
	
	Попытка
		ДокументПрибытия.Записать(РежимЗаписиДокумента.Проведение);
		Результат = ДокументПрибытия.Ссылка;
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		СообщениеДляЖурнала = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		СообщениеДляПользователя = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Морская логистика.Проверка заполнения'"),
			УровеньЖурналаРегистрации.Ошибка,,, СообщениеДляЖурнала);
		ОбщегоНазначения.СообщитьПользователю(СообщениеДляПользователя);

	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

