#Область ПрограммныйИнтерфейс

// Открывает форму документа
//
// Параметры:
//  ЭтотОбъект - ДокументОбъект - документ объект.
//  ДокументОткрытия - ДокументСсылка - Ссылка на открываемый документ.
//  ИмяФормыДокумента - Строка - имя формы документа.
//  ТолькоПросмотр - Булево - режим просмотра.
// 
Процедура ОткрытьДокумент(ЭтотОбъект, ДокументОткрытия, ИмяФормыДокумента, ТолькоПросмотр = Истина) Экспорт
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Ключ", ДокументОткрытия);
	ПараметрыОткрытия.Вставить("ТолькоПросмотр", ТолькоПросмотр);
	ОткрытьФорму(ИмяФормыДокумента, ПараметрыОткрытия, ЭтотОбъект, ЭтотОбъект, , , , 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
	
// Проверяет все ли условия выполняются
//
// Параметры:
//  Условие1 - Булево - условие 1.
//  Условие2 - Булево - условие 2.
//  Условие3 - Булево - условие 3.
//  Условие4 - Булево - условие 4.
// 
// Возвращаемое значение:
//  Булево - подтверждение что все условия выполняются.
//
Функция ВыполняютсяВсеУсловия(Условие1, Условие2, Условие3 = Истина, Условие4 = Истина) Экспорт
	Возврат Условие1 И Условие2 И Условие3 И Условие4;
КонецФункции

// Проверяет выполняется хоть одно из условия
//
// Параметры:
//  Условие1 - Булево - условие 1.
//  Условие2 - Булево - условие 2.
//  Условие3 - Булево - условие 3.
//  Условие4 - Булево - условие 4.
//  Условие5 - Булево - условие 5.
// 
// Возвращаемое значение:
//  Булево - подтверждение что хоть одно условие выполняется.
//
Функция ВыполняютсяОдноИзУсловий(Условие1, Условие2, Условие3 = Ложь, Условие4 = Ложь, Условие5 = Ложь) Экспорт
	Возврат Условие1 Или Условие2 Или Условие3 Или Условие4 Или Условие5;
КонецФункции

#КонецОбласти
