#Если ТолстыйКлиентОбычноеПриложение ИЛИ Сервер ИЛИ ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДозаполнитьРеквизитыПередЗаписью();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДозаполнитьРеквизитыПередЗаписью()
	
	Если НЕ ЗначениеЗаполнено(гкс_ЧасовойПоясТочкиМаршрута) И Не ЭтоГруппа Тогда
		ЧасовойПояс = ПолучитьЧасовойПоясИнформационнойБазы();
		Если НЕ ЗначениеЗаполнено(ЧасовойПояс) Тогда
			ЧасовойПояс = ЧасовойПояс();
		КонецЕсли;
		гкс_ЧасовойПоясТочкиМаршрута = ЧасовойПояс;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе	
ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте'");
#КонецЕсли