#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	гкс_ФормыОбъектовИАС.ПриСозданииНаСервереФормыЭлементаСообщения(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	УстановитьВидимостьИДоступностьЭлементов();
	ПодсчитатьКоличествоЭлементовВСообщении();

КонецПроцедуры

#КонецОбласти   

#Область ОбработчикиСобытийТаблицыВыгруженныеОбъекты

&НаКлиенте
Процедура ВыгруженныеОбъектыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;		
	КонецЕсли;
	
	ПоказатьЗначение(Неопределено, Элемент.ТекущиеДанные.Объект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодсчитатьКоличествоЭлементовВСообщении()
	
	Если НЕ ЗначениеЗаполнено(Объект.Сообщение) Тогда
		Возврат;
	КонецЕсли;
		
	ВыгруженоОбъектов = РеквизитФормыВЗначение("Объект").КоличествоОбъектовВСообщении();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьИДоступностьЭлементов()
	  
	ЭтотОбъект.ТолькоПросмотр = НЕ РазрешеноРучноеРедактированиеСообщений();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РазрешеноРучноеРедактированиеСообщений()
	
	Возврат гкс_ОчередьСообщенийRMQ.РазрешеноРучноеРедактированиеСообщений();
	
КонецФункции


#КонецОбласти