#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Изменить запись в электронной очереди.
// 
// Параметры:
//  ЗаписьВОчередь - ДокументСсылка.гкс_ЗаписьВОчередьПриемкиПЛК - 
//  ПараметрыИзменения - Структура - 
//
Процедура ИзменитьЗаписьВЭлектроннойОчереди(ЗаписьВОчередь, ПараметрыИзменения) Экспорт
	
	Попытка
		ЗаблокироватьДанныеДляРедактирования(ЗаписьВОчередь);
	Исключение
		ВызватьИсключение СтрШаблон(НСтр("ru='Ошибка блокировки записи в очередь %1'"), Строка(ЗаписьВОчередь));
	КонецПопытки;
		
	ЗаписьВОчередьДокумент = ЗаписьВОчередь.ПолучитьОбъект();
	ЗаписьВОчередьДокумент.Заполнить(ПараметрыИзменения);
	
	Попытка
		ЗаписьВОчередьДокумент.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ВызватьИсключение ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;

КонецПроцедуры

#КонецОбласти

#КонецЕсли