#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	
	РеквизитыФрахта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Фрахт, "Дата,Номер");
	Наименование = СтрШаблон(
		"Лот №%1 (Фрахт %2 от %3)", НомерЛота, РеквизитыФрахта.Номер, Формат(РеквизитыФрахта.Дата, "ДЛФ=D;"));

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ЭтоНовыйОбъект() Экспорт
	
	Результат = Неопределено;
	ДополнительныеСвойства.Свойство("ЭтоНовый", Результат);
	Возврат Результат = Истина;
	
КонецФункции

#КонецОбласти

#КонецЕсли