// Область ПрограммныйИнтерфейс и Экспорт для подавления замечаний SQ

#Область ПрограммныйИнтерфейс

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт
	Источник = ПараметрыВыполненияКоманды.Источник;
	КомандаПечатьАктЗабраковкиПартии(Источник);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура КомандаПечатьАктЗабраковкиПартии(Источник)

	Элементы = Источник.Элементы;
	ТекущиеДанные = Элементы.СписокРегистрации.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(ТекущиеДанные.ДокументРегистрацииАнализов) Тогда
		
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(ТекущиеДанные.ДокументРегистрацииАнализов);
		МенеджерПечати = гкс_ПриемкаТранспортаКлиентСервер.ИмяМенеджераПечатиЛабораторногоАнализа();
		
		ОписаниеКоманды = Новый Структура();
		ОписаниеКоманды.Вставить("ОбъектыПечати",	МассивОбъектов);
		ОписаниеКоманды.Вставить("Форма",			Источник);
		ОписаниеКоманды.Вставить("Идентификатор",	"ПФ_MXL_АктЗабраковкиПартии_ru");
		ОписаниеКоманды.Вставить("Представление",	НСтр("ru = 'Акт забраковки'"));
		ОписаниеКоманды.Вставить("МенеджерПечати",	МенеджерПечати);
		ОписаниеКоманды.Вставить("ПроверкаПроведенияПередПечатью", Истина);
		ОписаниеКоманды.Вставить("Обработчик",
			"гкс_УправлениеПечатьюКлиент.ВыполнитьКомандуПечати_ПФ_MXL_АктЗабраковкиПартии_ru");
		
		гкс_УправлениеПечатьюКлиент.ВыполнитьКомандуПечати_ПФ_MXL_АктЗабраковкиПартии_ru(ОписаниеКоманды);
		
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			гкс_ПриемкаТранспортаКлиентСервер.ТекстОшибкиНеЗаполненЛабораторныйАнализ());
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти