#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Обновляет данные справочника из Warehouse
//
Процедура ОбновитьДанныеССервера() Экспорт
	
	РесурсВебСервиса = Справочники.гкс_РесурсыВебСервисов.QualityIndicators;
		
	ПараметрыПреобразованияJSON = Новый Структура;
	ПараметрыПреобразованияJSON.Вставить("ПрочитатьВСоответствие", Ложь);
	ПараметрыПреобразованияJSON.Вставить("ИменаСвойствСоЗначениямиДата", "updatedOn");
	
	ДанныеОтветаВСтруктуре = гкс_ИнтеграцияWarehouse.ВыполнитьЗапросКWarehouse(
		РесурсВебСервиса, Неопределено, ПараметрыПреобразованияJSON);
		
	Ссылка = Справочники.гкс_ПоказателиКачестваWarehouse.ПустаяСсылка();	
		
	гкс_ОбменДаннымиWarehouse.ОбработатьПолученныеДанные(ДанныеОтветаВСтруктуре, Ссылка);
			
КонецПроцедуры

#Область КонвертацияПриОбмене

// Возвращает имя ключевого реквизита объекта.
//
// Возвращаемое значение:
//   Строка
//
Функция ИмяКлючевогоСвойства() Экспорт
	
	Возврат "ИдентификаторWarehouse";
	
КонецФункции

// Возвращает имя ключевого поля в Warehouse.
//
// Возвращаемое значение:
//   Строка
//
Функция ИмяКлючевогоСвойстваВWarehouse() Экспорт
	
	Возврат "id";
	
КонецФункции

// Устанавливает соотвествие имен реквизитов объекта 1с и полей ответа от Warehouse 
//
// Возвращаемое значение:
//  ТаблицаЗначений - таблица описания конвертации реквизитов:
// 		* СвойствоКонфигурации - Строка
// 		* СвойствоИсточника - Строка
// 		* ИспользуетсяАлгоритмКонвертации - Число 
// 		* ПравилоКонвертацииСвойства - Строка
// 		* ЭтоТабличнаяЧасть - Булево
//
Функция ИнициализацияПравилКонвертацийСвойств() Экспорт
	
	ПравилаКонвертации = гкс_ОбменДаннымиWarehouse.ИнициализацияПравилКонвертацийСвойств();

	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, ИмяКлючевогоСвойства(),	"id");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "КодWarehouse",			"code");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "Наименование",			"name");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "НаименованиеКороткое",	"shortName");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "НаименованиеEN",			"name_en");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "НаименованиеКороткоеEN",	"shortName_en");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "Стандарт", "standard");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "Точность", "precision");
	
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "ИспользуетсяДиспетчером", "isUsed");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "ИспользуетсяСпециалистомПоКачеству", "isUsedByQS");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "НомерВСортировке", "sortOrder");	
                                                                               
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, 
		"НижнийПределЗависимогоПоказателя", "minValueOfDependentQualityIndicator");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, 
		"ВерхнийПределЗависимогоПоказателя", "maxValueOfDependentQualityIndicator"); 
	
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "ПометкаУдаления", "isDeleted");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "ДатаИзменения", "updatedOn");
	
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, 
		"ЗависимыйПоказатель", "dependentQualityIndicatorId", 1, "ПКС_ЗависимыйПоказатель");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, 
		"ЕдиницаИзмерения", "unitId", 1, "ПКС_ЕдиницаИзмерения");
		
	Возврат ПравилаКонвертации;
		
КонецФункции

#КонецОбласти

#КонецОбласти	
	
#КонецЕсли