#Если ТолстыйКлиентОбычноеПриложение ИЛИ Сервер ИЛИ ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда		
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область СообщенияWarehouse

// Правило конвертации в реквизит
// 
// Параметры:
//  ПравилоКонвертации - СтрокаТаблицыЗначений - Правило конвертации
//  ПолученныеДанные - Структура - данные полученные из Warehouse
//  ДанныеЗаполнения - Структура -  Данные заполнения
//
Процедура ПКС_ЗависимыйПоказатель(ПравилоКонвертации, ПолученныеДанные, ДанныеЗаполнения) Экспорт
	
	Перем ПолученноеЗначение;
	
	Если ПолученныеДанные.Свойство(ПравилоКонвертации.СвойствоИсточника, ПолученноеЗначение) Тогда
		
		ЗначениеЗаполнения = гкс_ОбменДаннымиWarehouse.СсылкаНаОбъектПоИдентификатору(ПолученноеЗначение, 
		  "Справочник.гкс_ПоказателиКачестваWarehouse");
		
		Если ЗначениеЗаполнено(ЗначениеЗаполнения) Тогда
			ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, ЗначениеЗаполнения);
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

// Правило конвертации в реквизит
// 
// Параметры:
//  ПравилоКонвертации - СтрокаТаблицыЗначений - Правило конвертации
//  ПолученныеДанные - Структура - данные полученные из Warehouse
//  ДанныеЗаполнения - Структура -  Данные заполнения
//
Процедура ПКС_ЕдиницаИзмерения(ПравилоКонвертации, ПолученныеДанные, ДанныеЗаполнения) Экспорт
	
	Перем ПолученноеЗначение;
	
	Если ПолученныеДанные.Свойство(ПравилоКонвертации.СвойствоИсточника, ПолученноеЗначение) Тогда
		
		ЗначениеЗаполнения = гкс_ОбменДаннымиWarehouse.СсылкаНаОбъектПоИдентификатору(ПолученноеЗначение, 
		  "Справочник.гкс_ЕдиницыИзмеренияWarehouse");
		
		Если ЗначениеЗаполнено(ЗначениеЗаполнения) Тогда
			ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, ЗначениеЗаполнения);
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры
	
#КонецОбласти

#КонецОбласти

#КонецЕсли
