
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если ЗначениеЗаполнено(Параметры.Основание) Тогда 
		УстановитьПараметрыВыбораДляТранспортныхДокументов(Параметры.Основание);
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда 
		УстановитьПараметрыВыбораДляФрахта();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ЗаполнитьДокументыРегистрацииНаФорме();
	УстановитьПараметрыВыбораДляТранспортныхДокументов(Объект.Фрахт);
	УстановитьПараметрыВыбораДляФрахта();
	РассчитатьИтогиНаФорме();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ЗаполнитьДокументыРегистрацииНаФорме();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФрахтПриИзменении(Элемент)
	
	гкс_МорскаяЛогистикаКлиент.ЗаполнитьПрибытиеСуднаПоДаннымФрахта(ЭтотОбъект);
	УстановитьПараметрыВыбораДляТранспортныхДокументов(Объект.Фрахт);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТранспортныеДокументы

&НаКлиенте
Процедура ТранспортныеДокументыТранспортныйДокументПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТранспортныеДокументы.ТекущиеДанные;
	ТекущиеДанные.КоличествоПоДокументу = гкс_МорскаяЛогистикаКлиент.ВесПоТранспортномуДокументу(
		ТекущиеДанные.ТранспортныйДокумент);
	ТекущиеДанные.ДокументРегистрации = Неопределено;
	РассчитатьИтогиНаФорме();
КонецПроцедуры

&НаКлиенте
Процедура ТранспортныеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТранспортныеДокументы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле = Элементы.ТранспортныеДокументыДокументРегистрации Тогда 
		ПоказатьЗначение(Неопределено, ТекущиеДанные.ДокументРегистрации);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьРегистрацию(Команда)
	
	НачатьСозданиеДокументаРегистрации();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТранспортныеДокументы(Команда)
	гкс_МорскаяЛогистикаКлиент.ЗаполнитьПрибытиеСуднаПоДаннымФрахта(ЭтотОбъект, Ложь);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НачатьСозданиеДокументаРегистрации()
	
	Если Модифицированность Тогда
		ТекстПредупреждения = НСтр("ru = 'Для продолжения необходимо записать документ!'");
		ПоказатьПредупреждение(Неопределено, ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ТранспортныеДокументы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено
		Или ЗначениеЗаполнено(ТекущиеДанные.ДокументРегистрации) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеЗаполнения = ДанныеЗаполненияРегистрацииНаПЛК(Объект.Ссылка, ТекущиеДанные.ТранспортныйДокумент);
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	гкс_ПриемкаТранспортаСлужебныйКлиент.ОткрытьФормуНовогоДокументаРегистрацияНаПЛК(
		ЭтотОбъект, ДанныеЗаполнения);
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ОбновитьДанныеНаФорме()
	Прочитать();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументыРегистрацииНаФорме()
	
	ТранспортныеДокументы = ОбщегоНазначения.ВыгрузитьКолонку(
		Объект.ТранспортныеДокументы, "ТранспортныйДокумент", Истина);
	
	МодульМенеджера = ОбщегоНазначения.ОбщийМодуль("РегистрыСведений.гкс_СвязьРегистрацииИТранспортногоДокумента");
	КоллекцияДокументов = МодульМенеджера.ДокументыРегистрацииПоТранспортнымДокументам(ТранспортныеДокументы);
	Для Каждого СтрокаДокумента Из Объект.ТранспортныеДокументы Цикл
		
		СтрокаКоллекции = КоллекцияДокументов.Найти(СтрокаДокумента.ТранспортныйДокумент, "ТранспортныйДокумент");
		Если СтрокаКоллекции = Неопределено Тогда
			СтрокаДокумента.ДокументРегистрации = Неопределено;
		Иначе
			СтрокаДокумента.ДокументРегистрации = СтрокаКоллекции.ДокументРегистрации;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеЗаполненияРегистрацииНаПЛК(ПрибытиеНаПЛК, ТранспортныйДокумент)
	
	Возврат гкс_МорскаяЛогистика.ДанныеЗаполненияРегистрацииНаПЛК(ПрибытиеНаПЛК, ТранспортныйДокумент);
	
КонецФункции

&НаСервере
Процедура УстановитьПараметрыВыбораДляТранспортныхДокументов(Фрахт)
	
	КоллекцияТранспортныхДокументов = гкс_МорскаяЛогистикаВызовСервера.КоллекцияТранспортныхДокументовПоСудну(
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Фрахт, "Судно"));
	
	НовыеЗначения = Новый ФиксированныйМассив(КоллекцияТранспортныхДокументов);
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", НовыеЗначения);
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	
	Элементы.ТранспортныеДокументыТранспортныйДокумент.ПараметрыВыбора = НовыеПараметры;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбораДляФрахта()
	
	КоллекцияДокументов = гкс_МорскаяЛогистикаВызовСервера.КоллекцияНеобработанныхФрахтов();
	
	НовыеЗначения = Новый ФиксированныйМассив(КоллекцияДокументов);
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", НовыеЗначения);
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	
	Элементы.Фрахт.ПараметрыВыбора = НовыеПараметры;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьИтогиНаФорме()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТранспортныеДокументы", Объект.ТранспортныеДокументы.Выгрузить());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТранспортныеДокументы.ТранспортныйДокумент КАК ТранспортныйДокумент,
	|	ТранспортныеДокументы.КоличествоВТрюме КАК КоличествоВТрюме
	|ПОМЕСТИТЬ ТранспортныеДокументы
	|ИЗ
	|	&ТранспортныеДокументы КАК ТранспортныеДокументы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ТранспортныйДокументТранспортныеСредства.ВесНетто) КАК ИтогоПоКоносаментам,
	|	0 КАК ИтогоПоФрахту
	|ПОМЕСТИТЬ ИтогоПромежуточный
	|ИЗ
	|	Документ.гкс_ТранспортныйДокумент.ТранспортныеСредства КАК ТранспортныйДокументТранспортныеСредства
	|ГДЕ
	|	ТранспортныйДокументТранспортныеСредства.Ссылка В
	|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ТранспортныеДокументы.ТранспортныйДокумент
	|		ИЗ
	|			ТранспортныеДокументы)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	0,
	|	СУММА(ТранспортныеДокументы.КоличествоВТрюме)
	|ИЗ
	|	ТранспортныеДокументы КАК ТранспортныеДокументы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ИтогоПромежуточный.ИтогоПоКоносаментам) КАК ИтогоПоКоносаментам,
	|	СУММА(ИтогоПромежуточный.ИтогоПоФрахту) КАК ИтогоПоФрахту
	|ИЗ
	|	ИтогоПромежуточный КАК ИтогоПромежуточный";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ИтогоПоКоносаментам = 0;
		ИтогоПоФрахту = 0;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти