#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область Проведение

// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив из Строка - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	
	МеханизмыДокумента.Добавить("ПриемкаПЛК");
	МеханизмыДокумента.Добавить("ЛабораторияИКачество");
	МеханизмыДокумента.Добавить("ЗаданияНаКомпозитныеПробы");
		
	Если ПолучитьФункциональнуюОпцию("гкс_ИспользоватьИнтеграциюСWarehouse") Тогда
		МеханизмыДокумента.Добавить("РегистрацияВнешнихПроб");
	КонецЕсли;
	
КонецПроцедуры

// Возвращает таблицы для движений, необходимые для проведения документа по регистрам учетных механизмов.
//
// Параметры:
//  Документ - ДокументСсылка - ссылка на документ, по которому необходимо получить данные
//  Регистры - Структура - список имен регистров, для которых необходимо получить таблицы
//  ДопПараметры - Структура - дополнительные параметры для получения данных, определяющие контекст проведения.
//
// Возвращаемое значение:
//  Структура - коллекция элементов:
//     ТаблицаЗначений - таблица данных для отражения в регистр.
//
Функция ДанныеДокументаДляПроведения(Документ, Регистры, ДопПараметры = Неопределено) Экспорт
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = гкс_ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ТекстыЗапроса = Новый СписокЗначений;
	
	Если Не ДопПараметры.ПолучитьТекстыЗапроса Тогда
		
		ДополнительныеСвойства = ДопПараметры.ДополнительныеСвойства;
		
		////////////////////////////////////////////////////////////////////////////
		// Создадим запрос инициализации движений		
		ЗаполнитьПараметрыИнициализации(Запрос, Документ, ДопПараметры, ДополнительныеСвойства);
		////////////////////////////////////////////////////////////////////////////
		// Сформируем текст запроса	
		Если ОтражатьСостояниеРегистрации(Запрос.Параметры) Тогда
			
			РассчитатьСостояниеЛабАнализа(Запрос);
			ТекстЗапросаТаблицаСостояниеРегистрации(Запрос, ТекстыЗапроса, Регистры, ДопПараметры);
			
			Если ЕстьОтклоненияПоказателей(Запрос.Параметры) Тогда	
				ТекстЗапросаКомментарииКСтатусуКачествоНеПринято(Запрос, ТекстыЗапроса);	
			КонецЕсли;
							
		КонецЕсли;
		
		ТекстЗапросаТаблицаФактическиеПоказателиКачества(Запрос, ТекстыЗапроса, Регистры);
		
		Если ПолучитьФункциональнуюОпцию("гкс_ИспользоватьРезультатыВнешнихПроб") Тогда
			
			ТекстЗапросаТаблицаВнешниеПробыРегистрации(Запрос, ТекстыЗапроса, Регистры);

			МенеджерНазначенияИспользованияКачества = Перечисления.гкс_НазначенияИспользованияКачества;	
			Если МенеджерНазначенияИспользованияКачества.
					ЭтоПриемка(Запрос.Параметры.НазначениеИспользованияКачества) Тогда		
				ТекстЗапросаТаблицаДвиженияЗаданияНаКомпозитныеПробыНазначить(Запрос, ТекстыЗапроса, Регистры);
				
			ИначеЕсли МенеджерНазначенияИспользованияКачества.
					ЭтоПерепроверкаВнешнихПроб(Запрос.Параметры.НазначениеИспользованияКачества) Тогда	
				ТекстЗапросаТаблицаДвиженияЗаданияНаКомпозитныеПробыВыполнен(Запрос, ТекстыЗапроса, Регистры);
			КонецЕсли;
		
		КонецЕсли;		
	КонецЕсли;
	
	ЗаполнитьДополнительныеПараметры(ДопПараметры, Запрос);
	
	////////////////////////////////////////////////////////////////////////////
	// Получим таблицы для движений
	
	Возврат гкс_ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения(Запрос, ТекстыЗапроса, ДопПараметры);
	
КонецФункции

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

#Область УправлениеДоступом

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ТочкаМаршрута)";
	
КонецПроцедуры

#КонецОбласти

// СтандартныеПодсистемы.ВариантыОтчетов

// Определяет список команд отчетов.
//
// Параметры:
//  КомандыОтчетов - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//  Параметры - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	ВариантыОтчетовПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

// СтандартныеПодсистемы.Печать

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
	
	Настройки.ПриДобавленииКомандПечати = Истина;
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//  КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	МенеджерПечати = "Обработка.гкс_ПечатьДокументаЛабораторныйАнализ";
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор  = "ПФ_MXL_АктОтбораПроб_ru";
	КомандаПечати.Представление  = НСтр("ru = 'Акт отбора проб'");
	КомандаПечати.МенеджерПечати = МенеджерПечати;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Обработчик = "гкс_УправлениеПечатьюКлиент.ВыполнитьКомандуПечати_ПФ_MXL_АктОтбораПроб_ru";
	
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Обработка.гкс_ПечатьДокументаЛабораторныйАнализ";
	КомандаПечати.Обработчик = "гкс_УправлениеПечатьюКлиент.ВыполнитьКомандуПечати_ПФЗПП47";
	КомандаПечати.Идентификатор  = "ПФ_MXL_ЗПП47_ru";
	КомандаПечати.Представление  = НСтр("ru = 'Карточка анализа(ЗПП-47)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Обработка.гкс_ПечатьДокументаЛабораторныйАнализ";
	КомандаПечати.Обработчик = "гкс_УправлениеПечатьюКлиент.ВыполнитьКомандуПечати_ПФЗПП47_АЛЦ";
	КомандаПечати.Идентификатор  = "ПФ_MXL_ЗПП47_АЛЦ_ru";
	КомандаПечати.Представление  = НСтр("ru = 'Карточка анализа(ЗПП-47) АЛЦ'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор  = "ПФ_MXL_АктЗабраковкиПартии_ru";
	КомандаПечати.Представление  = НСтр("ru = 'Акт забраковки партии'");
	КомандаПечати.МенеджерПечати = МенеджерПечати;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Обработчик = "гкс_УправлениеПечатьюКлиент.ВыполнитьКомандуПечати_ПФ_MXL_АктЗабраковкиПартии_ru";
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор  = "ПФ_MXL_АктЗабраковкиТовара_ru";
	КомандаПечати.Представление  = НСтр("ru = 'Акт забраковки товара'");
	КомандаПечати.МенеджерПечати = МенеджерПечати;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Обработчик = "гкс_УправлениеПечатьюКлиент.СформироватьКомандуПечатиАктЗабраковкиТовара_ру";
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = МенеджерПечати;
	КомандаПечати.Идентификатор  = "ПФ_MXL_ЗПП42_ru";
	КомандаПечати.Представление  = НСтр("ru = 'Отраслевая форма(ЗПП-42)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
		
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_АктВозврата_by";
	КомандаПечати.Представление = НСтр("ru = 'Акт возврата'");
    КомандаПечати.МенеджерПечати = "Обработка.гкс_ПечатьАктВозврата_Беларусь";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.Обработчик  = "гкс_УправлениеПечатьюКлиент_by.ВыполнитьКомандуПечати_АктВозврата";
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_АктОтбораПроб";
	КомандаПечати.Представление = НСтр("ru = 'Акт отбора проб новый'");
    КомандаПечати.МенеджерПечати = МенеджерПечати;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;   
	КомандаПечати.Обработчик = "гкс_УправлениеПечатьюКлиент.ВыполнитьКомандуПечати_ПФ_MXL_АктОтбораПроб";

    КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор  = "ПФ_MXL_ЯрлыкПробы";
	КомандаПечати.Представление  = НСтр("ru = 'Ярлык пробы'");
	КомандаПечати.МенеджерПечати = МенеджерПечати;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Обработчик = "гкс_УправлениеПечатьюКлиент.КомандаПечати_ПФ_ЯрлыкПробы";
    
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

#КонецОбласти

Функция ЗаблокироватьКонкурентноеСозданиеЛабораторногоАнализа(ДокументОснованиеОграничитель) Экспорт
	
	Результат = Ложь;
	
	Если НЕ ТранзакцияАктивна() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	БлокировкаДанных = Новый БлокировкаДанных();
	
	ЭлементБлокировки = БлокировкаДанных.Добавить("Документ.гкс_ЛабораторныйАнализ");
	ЭлементБлокировки.УстановитьЗначение("гкс_ДокументРегистрации", ДокументОснованиеОграничитель);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	Попытка
		БлокировкаДанных.Заблокировать();
		Результат = Истина;
	Исключение
		Результат = Ложь;	
	КонецПопытки;		
	
	Возврат Результат;
	
КонецФункции

// Расчитывает средневзвешенные показатели по входным лаботаторным анализам
//
// Параметры:
//   ЛабораторныйАнализ - ДокументСсылка.гкс_ЛабораторныйАнализ - композитный лаб.анализ
//
// Возвращаемое значение:
//  Соответствие - средневзвешенные значения показателей
//
Функция СредневзвешенныеПоказателиКомпозитногоАнализа(ЛабораторныйАнализ) Экспорт
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЛабораторныйАнализ.гкс_ДокументРегистрации КАК ДокументНомерПробы
	|ПОМЕСТИТЬ ВТ_ФормированиеПробы
	|ИЗ
	|	Документ.гкс_ЛабораторныйАнализ КАК ЛабораторныйАнализ
	|ГДЕ
	|	ЛабораторныйАнализ.Ссылка = &Ссылка
	|	И
	|		ЛабораторныйАнализ.гкс_НазначениеИспользованияКачества = ЗНАЧЕНИЕ(Перечисление.гкс_НазначенияИспользованияКачества.ПриемкаКомпозит)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ФормированиеНомераПробыСписокРегистраций.ДокументРегистрации КАК ДокументРегистрации
	|ПОМЕСТИТЬ ВТ_ДокументыРегистрации
	|ИЗ
	|	ВТ_ФормированиеПробы КАК ВТ_ФормированиеПробы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ФормированиеНомераПробы.СписокРегистраций КАК
	|			ФормированиеНомераПробыСписокРегистраций
	|		ПО ФормированиеНомераПробыСписокРегистраций.Ссылка = ВТ_ФормированиеПробы.ДокументНомерПробы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛабораторныйАнализ.Ссылка КАК Ссылка,
	|	ВТ_ДокументыРегистрации.ДокументРегистрации КАК ДокументРегистрации
	|ПОМЕСТИТЬ ВТ_ВходныеЛабАнализы
	|ИЗ
	|	ВТ_ДокументыРегистрации КАК ВТ_ДокументыРегистрации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ЛабораторныйАнализ КАК ЛабораторныйАнализ
	|		ПО ВТ_ДокументыРегистрации.ДокументРегистрации = ЛабораторныйАнализ.гкс_ДокументРегистрации
	|ГДЕ
	|	ЛабораторныйАнализ.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КачественныеПоказатели.Показатель КАК Показатель,
	|	КачественныеПоказатели.Значение КАК Значение,
	|	КачественныеПоказатели.СоответствуетНормативу КАК СоответствуетНормативу,
	|	КачественныеПоказатели.НомерПробы КАК НомерПробы,
	|	ВТ_ВходныеЛабАнализы.Ссылка КАК Ссылка,
	|	ВТ_ВходныеЛабАнализы.ДокументРегистрации КАК ДокументРегистрации,
	|	ТИПЗНАЧЕНИЯ(КачественныеПоказатели.Значение) = ТИП(ЧИСЛО) КАК ЗначениеЧисло
	|ИЗ
	|	ВТ_ВходныеЛабАнализы КАК ВТ_ВходныеЛабАнализы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ЛабораторныйАнализ.КачественныеПоказатели КАК КачественныеПоказатели
	|		ПО ВТ_ВходныеЛабАнализы.Ссылка = КачественныеПоказатели.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ЛабораторныйАнализ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаДанных = РезультатЗапроса.Выгрузить();
	
	ТаблицаРегистраций = РезультатЗапроса.Выгрузить();
	ТаблицаРегистраций.Свернуть("ДокументРегистрации");
	ТаблицаРегистраций.Колонки.Добавить("Вес");
	
	Для Каждого СтрокаДанных Из ТаблицаРегистраций Цикл
        // определяем вес по накладной
		ДанныеПоВесу = гкс_ПриемкаНаПЛКСервер.ПоказанияВесовПоРегистрации(СтрокаДанных.ДокументРегистрации);
		СтрокаДанных.Вес = ДанныеПоВесу.НеттоФакт;
	КонецЦикла;
	
	ОбщийВес = ТаблицаРегистраций.Итог("Вес");
	
	// расчет коэффициентов
	ТаблицаДанных.Колонки.Добавить("ЗначениеКоэф");
	
	Для Каждого СтрокаДанных Из ТаблицаДанных Цикл
		
		Если СтрокаДанных.ЗначениеЧисло Тогда		
			НайденнаяСтрока = ТаблицаРегистраций.Найти(СтрокаДанных.ДокументРегистрации, "ДокументРегистрации");	
			СтрокаДанных.ЗначениеКоэф = СтрокаДанных.Значение * НайденнаяСтрока.Вес;
		Иначе
			СтрокаДанных.ЗначениеКоэф = 0;
		КонецЕсли;	
		
	КонецЦикла;
	
	ТаблицаДанных.Свернуть("Показатель", "ЗначениеКоэф");

	Если ОбщийВес = 0 Тогда
		ТранспортноеСредствоИмяРеквизита = "ТранспортноеСредство";
		ТранспортноеСредство = Неопределено;

		Если ТаблицаРегистраций.Количество() > 0 Тогда
			ТранспортноеСредство = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
				ТаблицаРегистраций[0].ДокументРегистрации, ТранспортноеСредствоИмяРеквизита);
		КонецЕсли;
		
		ОбщаяЧастьСообщения = НСтр(
			"ru = 'Отсутствует вес тары и вес нетто. Средневзвешенные показатели не могут быть рассчитаны.'");

		Если ЗначениеЗаполнено(ТранспортноеСредство) Тогда
			
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
            	НСтр("ru = 'Для ТС: %1. %2'"), ТранспортноеСредство, ОбщаяЧастьСообщения);

		Иначе
			ТекстОшибки = ОбщаяЧастьСообщения;
		КонецЕсли;

		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый Соответствие;	
	Для  Каждого СтрокаДанных Из ТаблицаДанных Цикл
		Результат.Вставить(СтрокаДанных.Показатель, Окр(СтрокаДанных.ЗначениеКоэф/ОбщийВес, 1));		
	КонецЦикла;	

	Возврат Результат;
	
КонецФункции

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Функция ОтражатьСостояниеРегистрации(Параметры)
	
	СписокНазначениеИспользования = Новый СписокЗначений;
	СписокНазначениеИспользования.Добавить(Перечисления.гкс_НазначенияИспользованияКачества.Приемка);
    СписокНазначениеИспользования.Добавить(Перечисления.гкс_НазначенияИспользованияКачества.ПромежуточныйКомпозит);
	СписокНазначениеИспользования.Добавить(Перечисления.гкс_НазначенияИспользованияКачества.ПерепроверкаВнешнихПроб);
	
	Возврат Параметры.Статус = Перечисления.гкс_СтатусыЛабораторногоАнализа.Выполнен
		И СписокНазначениеИспользования.НайтиПоЗначению(Параметры.НазначениеИспользованияКачества) <> Неопределено;
		
КонецФункции	

Функция СоздатьДокументНаОсновании(ПараметрыСоздания) Экспорт
	
	Результат = Неопределено;	
	НовыйДокумент = СоздатьДокумент();
	НовыйДокумент.Дата = ТекущаяДатаСеанса();
	
	Если ПараметрыСоздания.Свойство("ДанныеЗаполнения") Тогда
		НовыйДокумент.Заполнить(ПараметрыСоздания.ДанныеЗаполнения);	
	КонецЕсли;
			
	Если ПараметрыСоздания.Свойство("ДополнительныеСвойства") Тогда
		Для Каждого Свойство Из ПараметрыСоздания.ДополнительныеСвойства Цикл
			НовыйДокумент.ДополнительныеСвойства.Вставить(Свойство.Ключ, Свойство.Значение);
		КонецЦикла;	
	КонецЕсли;
	
	Если НовыйДокумент.КачественныеПоказатели.Количество() = 0 Тогда
		НовыйДокумент.ЗаполнитьПоказателиДляИсследования();
	КонецЕсли;
	
	Попытка
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
		Результат = НовыйДокумент.Ссылка;
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'ЛабораторныйАнализ.Проведение'"), 
								УровеньЖурналаРегистрации.Ошибка,
								Метаданные.Документы.гкс_ЛабораторныйАнализ, ,
								ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;		
	
	Возврат Результат;
	
КонецФункции 

// Процедура измененяет статус "Выполнен" лабораторного анализа на "Отбор проб"
//
// Параметры:
//  МассивЛабАнализов	 - Массив из ДокументСсылка.гкс_ЛабораторныйАнализ - Коллекция ссылок на документ лабораторный анализ:
//	АдресРезультата		 - Строка - Адрес хранилища результата метода
//
Процедура ВыполнитьИзменениеСтатусаЛабораторногоАнализаНаОтборПроб(МассивЛабАнализов, АдресРезультата) Экспорт
	
	НачатьТранзакцию();

	Попытка

		Для Каждого ЛабАнализ Из МассивЛабАнализов Цикл

			ЛабАнализСтатус = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЛабАнализ, "Статус");

			Если Не ЛабАнализСтатус = Перечисления.гкс_СтатусыЛабораторногоАнализа.Выполнен Тогда
				Продолжить;
			КонецЕсли;

			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Документ.гкс_ЛабораторныйАнализ");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", ЛабАнализ);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			Блокировка.Заблокировать();
			
			ИзмененитьСтатусЛабораторногоАнализаНаОтборПроб(ЛабАнализ);
		
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();

	Исключение

		ОтменитьТранзакцию();
		//@skip-warning
		ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ИмяСобытияЖурналРегистрации = НСтр("ru = 'Документ Лабораторный анализ заблокирован'");
		ЗаписьЖурналаРегистрации(ИмяСобытияЖурналРегистрации, УровеньЖурналаРегистрации.Ошибка, , ,
			ПодробноеПредставлениеОшибки);

		ВызватьИсключение ПодробноеПредставлениеОшибки;

	КонецПопытки;
	
КонецПроцедуры

Процедура ИзмененитьСтатусЛабораторногоАнализаНаОтборПроб(ЛабАнализ)
	
	ДокументОбъект = ЛабАнализ.ПолучитьОбъект();
	
	Попытка
		ДокументОбъект.Статус = Перечисления.гкс_СтатусыЛабораторногоАнализа.ОтборПробы;
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		//@skip-warning
		ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ИмяСобытияЖурналРегистрации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Ошибка проведения документа Основание для движение запасов: %1.'"),
			ЛабАнализ);
		ЗаписьЖурналаРегистрации(ИмяСобытияЖурналРегистрации, УровеньЖурналаРегистрации.Ошибка, , , 
			ПодробноеПредставлениеОшибки);
		
		ВызватьИсключение ПодробноеПредставлениеОшибки;
		
	КонецПопытки;
	
КонецПроцедуры

#Область Проведение

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка, ДопПараметры, ДополнительныеСвойства)
	
	МенеджерВременныхТаблиц = Неопределено;
	
	Если ДопПараметры <> Неопределено
		И ДопПараметры.Свойство("МенеджерВременныхТаблиц", МенеджерВременныхТаблиц) Тогда
		
		МенеджерВременныхТаблиц = ?(МенеджерВременныхТаблиц = Неопределено,
									Новый МенеджерВременныхТаблиц,
									МенеджерВременныхТаблиц);	
	Иначе
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	КонецЕсли;
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
		
	СформироватьЗапросИнициализации(Запрос);
	
	ДанныеШапки = Запрос.Выполнить().Выгрузить()[0];
	ШапкаДокумента = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ДанныеШапки);
	ЗаполнитьПараметрыЗапросаПоКлючу(ШапкаДокумента, Запрос);
	
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	
	Запрос.УстановитьПараметр("ПроизводственныеСутки", 
		гкс_ПриемкаТранспорта.ПериодПроизводственнойСмены(ШапкаДокумента.МестнаяДата).НачалоПериода);
	
	Запрос.УстановитьПараметр("РегистрацииЛабАнализа", 
		гкс_ВходнойКонтрольКачества.ДокументыРегистрацииЛабАнализа(ДокументСсылка));
		
	Запрос.УстановитьПараметр("ИспользоватьЗаблокированныеТС", 
		ПолучитьФункциональнуюОпцию("гкс_ИспользоватьЗаблокированныеТС"));
		
	Запрос.УстановитьПараметр("НазначенияИспользованияПроверкиКачества", 
		гкс_ВходнойКонтрольКачества.НазначенияИспользованияПроверкиКачества());	
		
КонецПроцедуры 

Процедура ЗаполнитьПараметрыЗапросаПоКлючу(ПараметрыСтруктура, Запрос)
	
	Для Каждого КлючИЗначение Из ПараметрыСтруктура Цикл
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
КонецПроцедуры	

Процедура РассчитатьСостояниеЛабАнализа(Запрос)
	
	Если Запрос.Параметры.ИспользоватьЗаблокированныеТС Тогда
		
		ДанныеУКПредыдущейГруппы = гкс_ВходнойКонтрольКачества
			.КачествоУсиленногоКонтроляПредыдущейГруппы(Запрос.Параметры.ДокументРегистрации);
			
		Запрос.Параметры.Вставить("ПоказателиПредыдущейГруппы", ДанныеУКПредыдущейГруппы.КачествоПоказателей);		
		
		Запрос.Текст = ТекстЗапросаРасчетаСостоянияЛабАнализаЗаблокированныеТС();
	Иначе                                                                   
		Запрос.Текст = ТекстЗапросаРасчетаСостоянияЛабАнализа();
	КонецЕсли;	
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
	
		Запрос.УстановитьПараметр("Состояние", Выборка.Состояние);
		Запрос.УстановитьПараметр("НазначатьНаСклады", Выборка.НазначатьНаСклады);	
		Запрос.УстановитьПараметр("ПоказателиНеСоответствуютНормативу", Выборка.НеСоответствуетНормативам);
		
	Иначе	
		Запрос.УстановитьПараметр("Состояние", Неопределено);
		Запрос.УстановитьПараметр("ПоказателиНеСоответствуютНормативу", Ложь);
	КонецЕсли;		
				
КонецПроцедуры

Функция ДополнительныеИсточникиДанныхДляДвижений(ИмяРегистра) Экспорт
	
	ИсточникиДанных = Новый Соответствие;
	Возврат ИсточникиДанных;
	
КонецФункции

Функция ЕстьОтклоненияПоказателей(ПараметрыКачества) 
	Возврат 
		ПараметрыКачества.ЭтоПриемка
		И ПараметрыКачества.ПоказателиНеСоответствуютНормативу;
КонецФункции

#Область ТекстыЗапросовПроведение

Процедура СформироватьЗапросИнициализации(Запрос)
	
	Запрос.Текст = ТекстЗапросаВтДанныеЛабАнализа(Запрос);
	Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов() +
	"ВЫБРАТЬ
	|	Таблица.Период КАК Период,
	|	Таблица.ДокументРегистратор КАК ДокументРегистратор,
	|	Таблица.ТочкаМаршрута КАК ТочкаМаршрута,
	|	Таблица.ДокументРегистрации КАК ДокументРегистрации,
	|	Таблица.Статус КАК Статус,
	|	Таблица.ТранспортноеСредство КАК ТранспортноеСредство,
	|	Таблица.ТипРегистрации КАК ТипРегистрации,
	|	Таблица.ВидПеревозки КАК ВидПеревозки,
	|	Таблица.Организация КАК Организация,
	|	Таблица.Номенклатура КАК Номенклатура,
	|	Таблица.МестнаяДата КАК МестнаяДата,
	|	Таблица.Дата КАК Дата,
	|	Таблица.НазначениеИспользованияКачества КАК НазначениеИспользованияКачества,
	|	Таблица.ЭтоПриемка КАК ЭтоПриемка,
	|	Таблица.ЭтоПромежуточныйКомпозитНаТС КАК ЭтоПромежуточныйКомпозитНаТС
	|ИЗ
	|	ВТ_ДанныеЛабАнализа КАК Таблица";
	
КонецПроцедуры   

Функция ТекстЗапросаРасчетаСостоянияЛабАнализаЗаблокированныеТС()
	
	Возврат 
	
	 "ВЫБРАТЬ
	 |	ПоказателиПредыдущейГруппы.Показатель КАК Показатель,
	 |	ПоказателиПредыдущейГруппы.ОтклонятьКачество КАК ОтклонятьКачество,
	 |	ПоказателиПредыдущейГруппы.СоответствуетНормативу КАК СоответствуетНормативу,
	 |	ПоказателиПредыдущейГруппы.Значение КАК Значение
	 |ПОМЕСТИТЬ ВТ_ПоказателиПредыдущейГруппы
	 |ИЗ
	 |	&ПоказателиПредыдущейГруппы КАК ПоказателиПредыдущейГруппы
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ПоказателиЛабАнализа.Ссылка КАК Ссылка,
	 |	ПоказателиЛабАнализа.Показатель КАК Показатель,
	 |	ПоказателиЛабАнализа.СоответствуетНормативу КАК СоответствуетНормативу,
	 |	ПоказателиЛабАнализа.ОтклонятьКачество КАК ОтклонятьКачество,
	 |	ПоказателиЛабАнализа.Значение КАК Значение,
	 |	ВЫБОР
	 |		КОГДА &ЭтоПриемка
	 |			ТОГДА ИСТИНА
	 |		ИНАЧЕ ЛОЖЬ
	 |	КОНЕЦ КАК УчитыватьОтклонение,
	 |	ПоказателиЛабАнализа.УсиленныйКонтроль КАК УсиленныйКонтроль
	 |ПОМЕСТИТЬ ВТ_ВсеПоказатели
	 |ИЗ
	 |	Документ.гкс_ЛабораторныйАнализ.КачественныеПоказатели КАК ПоказателиЛабАнализа
	 |ГДЕ
	 |	ПоказателиЛабАнализа.Ссылка = &Ссылка
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	&Ссылка,
	 |	ФактическиеПоказателиКачества.Показатель,
	 |	ФактическиеПоказателиКачества.СоответствуетНормативу,
	 |	ФактическиеПоказателиКачества.ОтклонятьКачество,
	 |	ФактическиеПоказателиКачества.Значение, 
	 |  ЛОЖЬ,
	 |	ФактическиеПоказателиКачества.УсиленныйКонтроль
	 |ИЗ
	 |	РегистрСведений.гкс_ФактическиеПоказателиКачества КАК ФактическиеПоказателиКачества
	 |ГДЕ
	 |	&ЭтоПромежуточныйКомпозитНаТС
	 |	И ФактическиеПоказателиКачества.РегистрацияНаПЛК = &ДокументРегистрации
	 |	И ФактическиеПоказателиКачества.НазначениеИспользованияКачества В(&НазначенияИспользованияПроверкиКачества)
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	&Ссылка,
	 |	ВТ_ПоказателиПредыдущейГруппы.Показатель,
	 |	ВТ_ПоказателиПредыдущейГруппы.СоответствуетНормативу,
	 |	ВТ_ПоказателиПредыдущейГруппы.ОтклонятьКачество,
	 |	ВТ_ПоказателиПредыдущейГруппы.Значение,
	 |	ЛОЖЬ,
	 |	ИСТИНА
	 |ИЗ
	 |	ВТ_ПоказателиПредыдущейГруппы КАК ВТ_ПоказателиПредыдущейГруппы
	 |ГДЕ
	 |	&ЭтоПриемка
	 |	И &ИспользоватьЗаблокированныеТС
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ВТ_ВсеПоказатели.Ссылка КАК Ссылка,
	 |	МИНИМУМ(ВТ_ВсеПоказатели.СоответствуетНормативу) КАК СоответствуетНормативу,
	 |	МАКСИМУМ(ВТ_ВсеПоказатели.ОтклонятьКачество) КАК ОтклонятьКачество
	 |ПОМЕСТИТЬ ВТ_КачествоПоРегистрации
	 |ИЗ
	 |	ВТ_ВсеПоказатели КАК ВТ_ВсеПоказатели
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	ВТ_ВсеПоказатели.Ссылка
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ВЫБОР
	 |		КОГДА ВТ_КачествоПоРегистрации.ОтклонятьКачество
	 |			ТОГДА ЗНАЧЕНИЕ(Перечисление.гкс_СостоянияРегистрации.КачествоНеПринято)
	 |		КОГДА НЕ ВТ_КачествоПоРегистрации.СоответствуетНормативу
	 |			ТОГДА ЗНАЧЕНИЕ(Перечисление.гкс_СостоянияРегистрации.РезультатыПробПолучены)
	 |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.гкс_СостоянияРегистрации.КачествоПринято)
	 |	КОНЕЦ КАК Состояние,
	 |	ВЫБОР
	 |		КОГДА ВТ_КачествоПоРегистрации.СоответствуетНормативу
	 |			ТОГДА ИСТИНА
	 |		ИНАЧЕ ЛОЖЬ
	 |	КОНЕЦ КАК НазначатьНаСклады,
	 |	ВЫБОР
	 |		КОГДА НЕ ВТ_КачествоПоРегистрации.СоответствуетНормативу
	 |			ТОГДА ИСТИНА
	 |		ИНАЧЕ ЛОЖЬ
	 |	КОНЕЦ КАК НеСоответствуетНормативам,
	 |	ВЫБОР
	 |		КОГДА НЕ ВТ_КачествоПоРегистрации.СоответствуетНормативу
	 |			ТОГДА ""Не соотвествует нормативу""
	 |		ИНАЧЕ """"
	 |	КОНЕЦ КАК ПричинаСостоянияОтказа
	 |ИЗ
	 |	ВТ_КачествоПоРегистрации КАК ВТ_КачествоПоРегистрации
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	ЗНАЧЕНИЕ(Перечисление.гкс_СостоянияРегистрации.РезультатыпробПолучены),
	 |	ЛОЖЬ,
	 |	ЛОЖЬ,
	 |	""Нет показателей качества""
	 |ИЗ
	 |	ВТ_ВсеПоказатели КАК ВТ_ВсеПоказатели
	 |
	 |ИМЕЮЩИЕ
	 |	КОЛИЧЕСТВО(*) = 0";
	
КонецФункции

Функция ТекстЗапросаРасчетаСостоянияЛабАнализа() 
	
Возврат "ВЫБРАТЬ
        |	ПоказателиЛабАнализа.Ссылка КАК Ссылка,
        |	ПоказателиЛабАнализа.Показатель КАК Показатель,
        |	ПоказателиЛабАнализа.Значение КАК Значение,
        |	ПоказателиЛабАнализа.СоответствуетНормативу КАК СоответствуетНормативу,
        |	ПоказателиЛабАнализа.ОтклонятьКачество КАК ОтклонятьКачество,
        |	ИСТИНА КАК УчитыватьОтклонение,
        |	ПоказателиЛабАнализа.УсиленныйКонтроль КАК УсиленныйКонтроль
        |ПОМЕСТИТЬ ВТ_ВсеПоказатели
        |ИЗ
        |	Документ.гкс_ЛабораторныйАнализ.КачественныеПоказатели КАК ПоказателиЛабАнализа
        |ГДЕ
        |	ПоказателиЛабАнализа.Ссылка = &Ссылка
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |	1 КАК Приоритет,
        |	НЕОПРЕДЕЛЕНО КАК ПричинаСостоянияОтказа,
        |	ЗНАЧЕНИЕ(Перечисление.гкс_СостоянияРегистрации.РезультатыПробПолучены) КАК Состояние,
        |	ЛОЖЬ КАК НазначатьНаСклады,
        |	ЛОЖЬ КАК НеСоответствуетНормативам
        |ПОМЕСТИТЬ ВТ_СоятоянияАнализа
        |ИЗ
        |	ВТ_ВсеПоказатели КАК ВТ_ВсеПоказатели
        |
        |ИМЕЮЩИЕ
        |	КОЛИЧЕСТВО(*) = 0
        |
        |ОБЪЕДИНИТЬ ВСЕ
        |
        |ВЫБРАТЬ
        |	2,
        |	""Не соответствует нормативу"",
        |	ЗНАЧЕНИЕ(Перечисление.гкс_СостоянияРегистрации.КачествоНеПринято),
        |	ЛОЖЬ,
        |	ИСТИНА
        |ИЗ
        |	ВТ_ВсеПоказатели КАК ВТ_ВсеПоказатели
        |ГДЕ
        |	НЕ ВТ_ВсеПоказатели.СоответствуетНормативу
        |	И ВТ_ВсеПоказатели.ОтклонятьКачество
        |
        |ОБЪЕДИНИТЬ ВСЕ
        |
        |ВЫБРАТЬ
        |	3,
        |	""Не соответствует нормативу"",
        |	ЗНАЧЕНИЕ(Перечисление.гкс_СостоянияРегистрации.РезультатыПробПолучены),
        |	ЛОЖЬ,
        |	ИСТИНА
        |ИЗ
        |	ВТ_ВсеПоказатели КАК ВТ_ВсеПоказатели
        |ГДЕ
        |	НЕ ВТ_ВсеПоказатели.СоответствуетНормативу
        |	И НЕ ВТ_ВсеПоказатели.ОтклонятьКачество
        |
        |ОБЪЕДИНИТЬ ВСЕ
        |
        |ВЫБРАТЬ
        |	4,
        |	НЕОПРЕДЕЛЕНО,
        |	ЗНАЧЕНИЕ(Перечисление.гкс_СостоянияРегистрации.КачествоПринято),
        |	ИСТИНА,
        |	ЛОЖЬ
        |ИЗ
        |	ВТ_ВсеПоказатели КАК ВТ_ВсеПоказатели
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ ПЕРВЫЕ 1
        |	ВТ_СоятоянияАнализа.Приоритет КАК Приоритет,
        |	ВТ_СоятоянияАнализа.Состояние КАК Состояние,
        |	ВТ_СоятоянияАнализа.ПричинаСостоянияОтказа КАК ПричинаСостоянияОтказа,
        |	ВТ_СоятоянияАнализа.НазначатьНаСклады КАК НазначатьНаСклады,
        |	ВТ_СоятоянияАнализа.НеСоответствуетНормативам КАК НеСоответствуетНормативам
        |ИЗ
        |	ВТ_СоятоянияАнализа КАК ВТ_СоятоянияАнализа
        |
        |УПОРЯДОЧИТЬ ПО
        |	Приоритет";

КонецФункции

Процедура ТекстЗапросаТаблицаСостояниеРегистрации(Запрос, ТекстыЗапроса, Регистры, ДопПараметры)
	
	ИмяРегистра = "гкс_СостоянияРегистрации";
	
	Если Не гкс_ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;

	Если НеТребуетсяОтражатьСостоянияРегистрации(ДопПараметры.ДополнительныеСвойства) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ВТ_ДанныеЛабАнализа.Период КАК Период,
	               |	ВТ_ДанныеЛабАнализа.ДокументРегистратор КАК ДокументРегистратор,
	               |	ВТ_ДанныеЛабАнализа.ТочкаМаршрута КАК ТочкаМаршрута,
	               |	ВТ_ДанныеЛабАнализа.ТипРегистрации КАК ТипРегистрации,
	               |	ВТ_ДанныеЛабАнализа.ДокументРегистрации КАК ДокументРегистрации,
	               |	ВТ_ДанныеЛабАнализа.ТранспортноеСредство КАК ТранспортноеСредство,
	               |	ВТ_ДанныеЛабАнализа.ВидПеревозки КАК ВидПеревозки,
	               |	&Состояние КАК Состояние,
	               |	&Пользователь КАК Пользователь,
	               |	ВТ_ДанныеЛабАнализа.МестнаяДата КАК МестнаяДата
	               |ИЗ
	               |	ВТ_ДанныеЛабАнализа КАК ВТ_ДанныеЛабАнализа";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	 
КонецПроцедуры

Функция ТекстЗапросаВтДанныеЛабАнализа(Запрос, ТекстыЗапроса = Неопределено)
	
	ИмяРегистра = "ВТ_ДанныеЛабАнализа";
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ЛабАнализ.гкс_ДатаПолученияАнализа = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |			ТОГДА ЛабАнализ.Дата
	               |		ИНАЧЕ ЛабАнализ.гкс_ДатаПолученияАнализа
	               |	КОНЕЦ КАК Период,
	               |	ЛабАнализ.Ссылка КАК ДокументРегистратор,
	               |	ЛабАнализ.ТочкаМаршрута КАК ТочкаМаршрута,
	               |	ЛабАнализ.гкс_ДокументРегистрации КАК ДокументРегистрации,
	               |	ЛабАнализ.Статус КАК Статус,
	               |	ЛабАнализ.Организация КАК Организация,
	               |	ЛабАнализ.гкс_ВидПеревозки КАК ВидПеревозки,
	               |	ЛабАнализ.гкс_МестнаяДата КАК МестнаяДата,
	               |	ЛабАнализ.Дата КАК Дата,
	               |	ЛабАнализ.гкс_НазначениеИспользованияКачества КАК НазначениеИспользованияКачества,
		           |	ЕСТЬNULL(Регистрация.ТипРегистрации, ЗНАЧЕНИЕ(Перечисление.гкс_ТипРегистрации.ПустаяСсылка)) КАК ТипРегистрации,
	               |	ЕСТЬNULL(Регистрация.ТранспортноеСредство, ЗНАЧЕНИЕ(Справочник.ТранспортныеСредства.ПустаяСсылка)) КАК ТранспортноеСредство,
	               |	ЕСТЬNULL(Регистрация.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	               |	ЛабАнализ.гкс_НазначениеИспользованияКачества = ЗНАЧЕНИЕ(Перечисление.гкс_НазначенияИспользованияКачества.Приемка) КАК ЭтоПриемка,
	               |	ЛабАнализ.гкс_НазначениеИспользованияКачества = ЗНАЧЕНИЕ(Перечисление.гкс_НазначенияИспользованияКачества.ПромежуточныйКомпозит)
	               |		И ТИПЗНАЧЕНИЯ(ЛабАнализ.гкс_ДокументРегистрации) = ТИП(Документ.гкс_РегистрацияНаПЛК) КАК ЭтоПромежуточныйКомпозитНаТС
	               |ПОМЕСТИТЬ ВТ_ДанныеЛабАнализа
	               |ИЗ
	               |	Документ.гкс_ЛабораторныйАнализ КАК ЛабАнализ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_РегистрацияНаПЛК КАК Регистрация
	               |		ПО ЛабАнализ.гкс_ДокументРегистрации = Регистрация.Ссылка
	               |ГДЕ
	               |	ЛабАнализ.Ссылка = &Ссылка";
	
	Если ЗначениеЗаполнено(ТекстыЗапроса) Тогда
		ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ТекстЗапросаТаблицаФактическиеПоказателиКачества(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "гкс_ФактическиеПоказателиКачества";
	
	Если Не гкс_ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	РегистрацииНаПЛК.Ссылка КАК ДокументРегистрации,
	               |	ЕСТЬNULL(СоставГруппТранспорта.ГруппаТС, ЗНАЧЕНИЕ(Справочник.гкс_ГруппыТС.ПустаяСсылка)) КАК ГруппаТС
	               |ПОМЕСТИТЬ ВТ_Регистрации
	               |ИЗ
	               |	Документ.гкс_РегистрацияНаПЛК КАК РегистрацииНаПЛК
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СоставГруппТранспорта КАК СоставГруппТранспорта
	               |		ПО РегистрацииНаПЛК.Ссылка = СоставГруппТранспорта.РегистрацияТранспорта
	               |ГДЕ
	               |	РегистрацииНаПЛК.Ссылка В(&РегистрацииЛабАнализа)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЛабораторныйАнализ.Номенклатура КАК Номенклатура,
	               |	ЛабораторныйАнализКачественныеПоказатели.Показатель КАК Показатель,
	               |	ЛабораторныйАнализ.гкс_НазначениеИспользованияКачества КАК НазначениеИспользованияКачества,
	               |	ЛабораторныйАнализКачественныеПоказатели.Значение КАК Значение,
	               |	ЛабораторныйАнализКачественныеПоказатели.СоответствуетНормативу КАК СоответствуетНормативу,
	               |	ЛабораторныйАнализКачественныеПоказатели.ОтклонятьКачество КАК ОтклонятьКачество,
	               |	ЛабораторныйАнализКачественныеПоказатели.УсиленныйКонтроль КАК УсиленныйКонтроль,
	               |	ВЫБОР
	               |		КОГДА ЛабораторныйАнализКачественныеПоказатели.ОтклонятьКачество
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.гкс_СостоянияКачества.КачествоНеПринято)
	               |		КОГДА НЕ ЛабораторныйАнализКачественныеПоказатели.СоответствуетНормативу
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.гкс_СостоянияКачества.РезультатыПробПолучены)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.гкс_СостоянияКачества.КачествоПринято)
	               |	КОНЕЦ КАК СостояниеКачества,
	               |	ЛабораторныйАнализКачественныеПоказатели.ЭтоЗначениеВнешнейПробы КАК ЭтоЗначениеВнешнейПробы,
	               |	ЛабораторныйАнализ.Дата КАК ДатаАнализа
	               |ПОМЕСТИТЬ ВТ_ДанныеАнализа
	               |ИЗ
	               |	Документ.гкс_ЛабораторныйАнализ.КачественныеПоказатели КАК ЛабораторныйАнализКачественныеПоказатели
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ЛабораторныйАнализ КАК ЛабораторныйАнализ
	               |		ПО ЛабораторныйАнализКачественныеПоказатели.Ссылка = ЛабораторныйАнализ.Ссылка
	               |ГДЕ
	               |	ЛабораторныйАнализКачественныеПоказатели.Ссылка = &Ссылка
	               |	И ЛабораторныйАнализ.Статус = ЗНАЧЕНИЕ(Перечисление.гкс_СтатусыЛабораторногоАнализа.Выполнен)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДанныеАнализа.Номенклатура КАК Номенклатура,
	               |	ВТ_ДанныеАнализа.Показатель КАК Показатель,
	               |	ВТ_ДанныеАнализа.НазначениеИспользованияКачества КАК НазначениеИспользованияКачества,
	               |	ВТ_ДанныеАнализа.Значение КАК Значение,
	               |	ВТ_ДанныеАнализа.СоответствуетНормативу КАК СоответствуетНормативу,
	               |	ВТ_ДанныеАнализа.ОтклонятьКачество КАК ОтклонятьКачество,
	               |	ВТ_ДанныеАнализа.УсиленныйКонтроль КАК УсиленныйКонтроль,
	               |	ВТ_ДанныеАнализа.СостояниеКачества КАК СостояниеКачества,
	               |	ВТ_ДанныеАнализа.ЭтоЗначениеВнешнейПробы КАК ЭтоЗначениеВнешнейПробы,
	               |	ВТ_ДанныеАнализа.ДатаАнализа КАК ДатаАнализа,
	               |	ВТ_Регистрации.ДокументРегистрации КАК ДокументРегистрации,
	               |	ВТ_Регистрации.ДокументРегистрации КАК РегистрацияНаПЛК,
	               |	ВТ_Регистрации.ГруппаТС КАК ГруппаТС
	               |ИЗ
	               |	ВТ_ДанныеАнализа КАК ВТ_ДанныеАнализа,
	               |	ВТ_Регистрации КАК ВТ_Регистрации";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
КонецПроцедуры

Процедура ТекстЗапросаТаблицаВнешниеПробыРегистрации(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "гкс_ВнешниеПробыРегистрации";
	
	Если Не гкс_ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЛабораторныйАнализКачественныеПоказатели.ВнешняяПроба КАК ВнешняяПроба,
		|	ЛабораторныйАнализКачественныеПоказатели.Показатель КАК Показатель,
		|	ЛабораторныйАнализКачественныеПоказатели.Ссылка КАК ЛабораторныйАнализ,
		|	ЛабАнализ.гкс_ДокументРегистрации КАК ДокументРегистрации,
		|	ЛабАнализ.гкс_ВидПеревозки КАК ВидПеревозки,
		|	ЛабАнализ.ЗаявкаНаПеревозку КАК ЗаявкаНаПеревозку
		|ПОМЕСТИТЬ ВТ_КачественныеПоказателиАнализа
		|ИЗ
		|	Документ.гкс_ЛабораторныйАнализ.КачественныеПоказатели КАК ЛабораторныйАнализКачественныеПоказатели
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ЛабораторныйАнализ КАК ЛабАнализ
		|		ПО ЛабораторныйАнализКачественныеПоказатели.Ссылка = ЛабАнализ.Ссылка
		|			И (ЛабАнализ.Проведен)
		|ГДЕ
		|	ЛабораторныйАнализКачественныеПоказатели.Ссылка = &Ссылка
		|	И ЛабораторныйАнализКачественныеПоказатели.ВнешняяПроба <> ЗНАЧЕНИЕ(Документ.гкс_ВнешняяПроба.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_КачественныеПоказателиАнализа.ВнешняяПроба КАК ВнешняяПроба,
		|	ВТ_КачественныеПоказателиАнализа.Показатель КАК Показатель,
		|	ВТ_КачественныеПоказателиАнализа.ДокументРегистрации КАК ДокументРегистрации,
		|	ВТ_КачественныеПоказателиАнализа.ЗаявкаНаПеревозку КАК ЗаявкаНаПеревозку,
		|	ВТ_КачественныеПоказателиАнализа.ЛабораторныйАнализ КАК ЛабораторныйАнализ,
		|	ВнешниеПробыПоЗаявкамНаПеревозку.НазначениеИспользованияКачества КАК НазначениеИспользованияКачества,
		|	ВнешниеПробыПоЗаявкамНаПеревозку.ЗначениеПоказателя КАК ЗначениеПоказателя,
		|	ВТ_КачественныеПоказателиАнализа.ВидПеревозки КАК ВидПеревозки
		|ПОМЕСТИТЬ ВТ_ПоказателиПробы
		|ИЗ
		|	ВТ_КачественныеПоказателиАнализа КАК ВТ_КачественныеПоказателиАнализа
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.гкс_КонтролируемыйПоказательВнешнихПроб КАК КонтролируемыйПоказательВнешнихПроб
		|		ПО ВТ_КачественныеПоказателиАнализа.Показатель = КонтролируемыйПоказательВнешнихПроб.Значение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гкс_ВнешниеПробыПоЗаявкамНаПеревозку КАК ВнешниеПробыПоЗаявкамНаПеревозку
		|		ПО ВТ_КачественныеПоказателиАнализа.ВнешняяПроба = ВнешниеПробыПоЗаявкамНаПеревозку.ВнешняяПроба
		|			И ВТ_КачественныеПоказателиАнализа.Показатель = ВнешниеПробыПоЗаявкамНаПеревозку.Показатель
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПоказателиПробы.ДокументРегистрации КАК ДокументРегистрации,
		|	ВТ_ПоказателиПробы.ВнешняяПроба КАК ВнешняяПроба,
		|	ВТ_ПоказателиПробы.ЗаявкаНаПеревозку КАК ЗаявкаНаПеревозку,
		|	ВТ_ПоказателиПробы.Показатель КАК Показатель,
		|	ВТ_ПоказателиПробы.ЛабораторныйАнализ КАК ЛабораторныйАнализ,
		|	ВТ_ПоказателиПробы.ЗначениеПоказателя КАК ЗначениеПоказателя
		|ИЗ
		|	ВТ_ПоказателиПробы КАК ВТ_ПоказателиПробы
		|ГДЕ
		|	ВТ_ПоказателиПробы.ВидПеревозки = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыТранспортныхСредствДоставки.Автомобиль)
		|	И ВТ_ПоказателиПробы.НазначениеИспользованияКачества = ЗНАЧЕНИЕ(Перечисление.гкс_НазначенияИспользованияКачества.ЛаборантВнешниеПробы)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ПоказателиПробы.ДокументРегистрации,
		|	ВТ_ПоказателиПробы.ВнешняяПроба,
		|	ВТ_ПоказателиПробы.ЗаявкаНаПеревозку,
		|	ВТ_ПоказателиПробы.Показатель,
		|	ВТ_ПоказателиПробы.ЛабораторныйАнализ,
		|	ВТ_ПоказателиПробы.ЗначениеПоказателя
		|ИЗ
		|	ВТ_ПоказателиПробы КАК ВТ_ПоказателиПробы
		|ГДЕ
		|	ВТ_ПоказателиПробы.ВидПеревозки = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыТранспортныхСредствДоставки.ЖДТранспорт)
		|	И ВТ_ПоказателиПробы.НазначениеИспользованияКачества = ЗНАЧЕНИЕ(Перечисление.гкс_НазначенияИспользованияКачества.КомпозитВнешниеПробыНаТысячуТон)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
КонецПроцедуры

Процедура ТекстЗапросаВТПоказателиНеСоответствующиеНормативу(Запрос, ТекстыЗапроса)
	
	ИмяРегистра = "ВТ_ПоказателиНеСоответствующиеНормативу";
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ВТ_ВсеПоказатели.Значение КАК Значение,
	               |	ВТ_ВсеПоказатели.Показатель КАК Показатель,
	               |	ВТ_ВсеПоказатели.ОтклонятьКачество КАК ОтклонятьКачество
	               |ПОМЕСТИТЬ ВТ_ПоказателиНеСоответствующиеНормативу
	               |ИЗ
	               |	ВТ_ВсеПоказатели КАК ВТ_ВсеПоказатели
	               |ГДЕ
	               |	НЕ ВТ_ВсеПоказатели.СоответствуетНормативу
	               |	И ВТ_ВсеПоказатели.УчитыватьОтклонение
	               |	И НЕ ВТ_ВсеПоказатели.УсиленныйКонтроль";

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
КонецПроцедуры

Процедура ТекстЗапросаВТПоказателиСертификации(Запрос, ТекстыЗапроса)
	
	ИмяРегистра = "ВТ_ПоказателиСертификации";
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РезультатыНормативнойСертификации.ПоказательАнализа КАК ПоказательАнализа,
	|	МАКСИМУМ(РезультатыНормативнойСертификации.ЗначениеПоказателя) КАК ЗначениеПоказателя,
	|	МАКСИМУМ(РезультатыНормативнойСертификации.МаксимальноеЗначение) КАК МаксимальноеЗначение
	|ПОМЕСТИТЬ ВТ_ПоказателиСертификации
	|ИЗ
	|	РегистрСведений.гкс_РезультатыНормативнойСертификацииНоменклатуры.СрезПоследних(&Дата,
	|		ТочкаМаршрута = &ТочкаМаршрута
	|	И Номенклатура = &Номенклатура) КАК РезультатыНормативнойСертификации
	|СГРУППИРОВАТЬ ПО
	|	РезультатыНормативнойСертификации.ПоказательАнализа";

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);

КонецПроцедуры

Процедура ТекстЗапросаКомментарииКСтатусуКачествоНеПринято(Запрос, ТекстыЗапроса)
	
	ИмяРегистра = "гкс_КомментарииКСтатусуКачествоНеПринято";
	ТекстЗапроса = "";
	
	Если Запрос.Параметры.Свойство("ПоказателиНеСоответствуютНормативу") 
		И Запрос.Параметры["ПоказателиНеСоответствуютНормативу"] Тогда
		
		Если Не гкс_ПроведениеДокументов.ЕстьТаблицаЗапроса("ВТ_ПоказателиНеСоответствующиеНормативу", ТекстыЗапроса) Тогда
			ТекстЗапросаВТПоказателиНеСоответствующиеНормативу(Запрос, ТекстыЗапроса);
		КонецЕсли;
				
		Если НЕ гкс_ПроведениеДокументов.ЕстьТаблицаЗапроса("ВТ_ПоказателиСертификации", ТекстыЗапроса) Тогда
			ТекстЗапросаВТПоказателиСертификации(Запрос, ТекстыЗапроса);
		КонецЕсли; 

		ТекстЗапроса = "ВЫБРАТЬ
		               |	&ДокументРегистрации КАК ДокументРегистрации,
		               |	""По нормативу"" КАК ВариантОтклонения,
		               |	ВТ_ПоказателиНеСоответствующиеНормативу.Значение КАК Значение,
		               |	ВТ_ПоказателиНеСоответствующиеНормативу.Показатель КАК Показатель,
		               |	ЕСТЬNULL(ВТ_ПоказателиСертификации.ЗначениеПоказателя, 0) КАК МинЗначение,
		               |	ЕСТЬNULL(ВТ_ПоказателиСертификации.МаксимальноеЗначение, 0) КАК МаксЗначение,
					   |	ВТ_ПоказателиНеСоответствующиеНормативу.ОтклонятьКачество КАК ОтклонятьКачество,
		               |	НЕ ВТ_ПоказателиСертификации.ПоказательАнализа ЕСТЬ NULL КАК ЕстьСертификация
		               |ИЗ
		               |	ВТ_ПоказателиНеСоответствующиеНормативу КАК ВТ_ПоказателиНеСоответствующиеНормативу
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоказателиСертификации КАК ВТ_ПоказателиСертификации
		               |		ПО ВТ_ПоказателиНеСоответствующиеНормативу.Показатель = ВТ_ПоказателиСертификации.ПоказательАнализа
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВТ_ПоказателиНеСоответствующиеНормативу.Значение,
		               |	ВТ_ПоказателиНеСоответствующиеНормативу.Показатель,
					   |	ВТ_ПоказателиНеСоответствующиеНормативу.ОтклонятьКачество,
		               |	НЕ ВТ_ПоказателиСертификации.ПоказательАнализа ЕСТЬ NULL,
		               |	ЕСТЬNULL(ВТ_ПоказателиСертификации.ЗначениеПоказателя, 0),
		               |	ЕСТЬNULL(ВТ_ПоказателиСертификации.МаксимальноеЗначение, 0)
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ОтклонятьКачество УБЫВ";
		
		ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	КонецЕсли;

КонецПроцедуры

Процедура ТекстЗапросаТаблицаДвиженияЗаданияНаКомпозитныеПробыНазначить(Запрос, ТекстыЗапроса, Регистры)

	ИмяРегистра = "гкс_ЗаданияНаКомпозитныеПробы";
	
	Если Не гкс_ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
		
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	&ПроизводственныеСутки КАК Период,
		|	ВЫРАЗИТЬ(ЛабораторныйАнализ.гкс_ДокументРегистрации КАК Документ.гкс_РегистрацияНаПЛК) КАК ДокументРегистрации,
		|	ЛабораторныйАнализПоказателиДляПерепроверки.Показатель КАК Показатель,
		|	ЛабораторныйАнализПоказателиДляПерепроверки.НазначениеИспользованияКачества КАК НазначениеИспользованияКачества,
		|	ЛабораторныйАнализ.Проведен КАК Проведен
		|ПОМЕСТИТЬ ВТ_ЛабАнализ
		|ИЗ
		|	Документ.гкс_ЛабораторныйАнализ.ПоказателиДляПерепроверки КАК ЛабораторныйАнализПоказателиДляПерепроверки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ЛабораторныйАнализ КАК ЛабораторныйАнализ
		|		ПО ЛабораторныйАнализПоказателиДляПерепроверки.Ссылка = ЛабораторныйАнализ.Ссылка
		|			И (ЛабораторныйАнализПоказателиДляПерепроверки.Ссылка = &Ссылка)
		|			И (ЛабораторныйАнализ.гкс_НазначениеИспользованияКачества = ЗНАЧЕНИЕ(Перечисление.гкс_НазначенияИспользованияКачества.Приемка))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЛабАнализ.Период КАК Период,
		|	ВТ_ЛабАнализ.ДокументРегистрации КАК ДокументРегистрации,
		|	ВТ_ЛабАнализ.Показатель КАК Показатель,
		|	ВТ_ЛабАнализ.НазначениеИспользованияКачества КАК НазначениеИспользованияКачества,
		|	ВТ_ЛабАнализ.Проведен КАК Проведен,
		|	СвязьРегистрацииИТранспортногоДокумента.ТранспортныйДокумент КАК ТранспортныйДокумент,
		|	ТранспортныеДокументы.Отправитель КАК Контрагент,
		|	ТочкиМаршрута.КодСтанцииЖД КАК СтанцияОтправления,
		|	РегистрацияНаПЛК.Номенклатура КАК Номенклатура,
		|	РегистрацияНаПЛК.ТранспортноеСредство КАК ТранспортноеСредство,
		|	1 КАК Количество
		|ИЗ
		|	ВТ_ЛабАнализ КАК ВТ_ЛабАнализ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СвязьРегистрацииИТранспортногоДокумента КАК СвязьРегистрацииИТранспортногоДокумента
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ТранспортныйДокумент КАК ТранспортныеДокументы
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.гкс_ТочкиМаршрута КАК ТочкиМаршрута
		|				ПО ТранспортныеДокументы.ПунктПогрузки = ТочкиМаршрута.Ссылка
		|			ПО СвязьРегистрацииИТранспортногоДокумента.ТранспортныйДокумент = ТранспортныеДокументы.Ссылка
		|		ПО ВТ_ЛабАнализ.ДокументРегистрации = СвязьРегистрацииИТранспортногоДокумента.ДокументРегистрации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_РегистрацияНаПЛК КАК РегистрацияНаПЛК
		|		ПО ВТ_ЛабАнализ.ДокументРегистрации = РегистрацияНаПЛК.Ссылка"; 
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);

КонецПроцедуры

Процедура ТекстЗапросаТаблицаДвиженияЗаданияНаКомпозитныеПробыВыполнен(Запрос, ТекстыЗапроса, Регистры)

	ИмяРегистра = "гкс_ЗаданияНаКомпозитныеПробы";
	
	Если Не гкс_ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
		
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	РегистрацииНаПЛК.Ссылка КАК ДокументРегистрации
		|ПОМЕСТИТЬ ВТ_РегистрацииЛабАнализа
		|ИЗ
		|	Документ.гкс_РегистрацияНаПЛК КАК РегистрацииНаПЛК
		|ГДЕ
		|	РегистрацииНаПЛК.Ссылка В(&РегистрацииЛабАнализа)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&ПроизводственныеСутки КАК Период,
		|	ЛабораторныйАнализКачественныеПоказатели.Показатель КАК Показатель,
		|	ЗНАЧЕНИЕ(Перечисление.гкс_НазначенияИспользованияКачества.ПерепроверкаВнешнихПроб) КАК НазначениеИспользованияКачества,
		|	ЛабораторныйАнализ.гкс_ДокументРегистрации КАК КомпозитнаяПроба,
		|	ЛабораторныйАнализ.Проведен КАК Проведен,
		|	ВТ_РегистрацииЛабАнализа.ДокументРегистрации КАК ДокументРегистрации
		|ПОМЕСТИТЬ ВТ_ЛабАнализ
		|ИЗ
		|	Документ.гкс_ЛабораторныйАнализ.КачественныеПоказатели КАК ЛабораторныйАнализКачественныеПоказатели
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ЛабораторныйАнализ КАК ЛабораторныйАнализ
		|		ПО ЛабораторныйАнализКачественныеПоказатели.Ссылка = ЛабораторныйАнализ.Ссылка
		|			И (ЛабораторныйАнализКачественныеПоказатели.Ссылка = &Ссылка)
		|			И (ЛабораторныйАнализ.гкс_НазначениеИспользованияКачества = ЗНАЧЕНИЕ(Перечисление.гкс_НазначенияИспользованияКачества.ПерепроверкаВнешнихПроб)),
		|	ВТ_РегистрацииЛабАнализа КАК ВТ_РегистрацииЛабАнализа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЛабАнализ.Период КАК Период,
		|	ВТ_ЛабАнализ.ДокументРегистрации КАК ДокументРегистрации,
		|	ВТ_ЛабАнализ.Показатель КАК Показатель,
		|	ВТ_ЛабАнализ.НазначениеИспользованияКачества КАК НазначениеИспользованияКачества,
		|	ВТ_ЛабАнализ.Проведен КАК Проведен,
		|	СвязьРегистрацииИТранспортногоДокумента.ТранспортныйДокумент КАК ТранспортныйДокумент,
		|	ТранспортныеДокументы.Отправитель КАК Контрагент,
		|	ТочкиМаршрута.КодСтанцииЖД КАК СтанцияОтправления,
		|	РегистрацияНаПЛК.Номенклатура КАК Номенклатура,
		|	РегистрацияНаПЛК.ТранспортноеСредство КАК ТранспортноеСредство,
		|	ВТ_ЛабАнализ.КомпозитнаяПроба КАК КомпозитнаяПроба,
		|	-1 КАК Количество
		|ИЗ
		|	ВТ_ЛабАнализ КАК ВТ_ЛабАнализ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СвязьРегистрацииИТранспортногоДокумента КАК СвязьРегистрацииИТранспортногоДокумента
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ТранспортныйДокумент КАК ТранспортныеДокументы
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.гкс_ТочкиМаршрута КАК ТочкиМаршрута
		|				ПО ТранспортныеДокументы.ПунктПогрузки = ТочкиМаршрута.Ссылка
		|			ПО СвязьРегистрацииИТранспортногоДокумента.ТранспортныйДокумент = ТранспортныеДокументы.Ссылка
		|		ПО ВТ_ЛабАнализ.ДокументРегистрации = СвязьРегистрацииИТранспортногоДокумента.ДокументРегистрации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_РегистрацияНаПЛК КАК РегистрацияНаПЛК
		|		ПО ВТ_ЛабАнализ.ДокументРегистрации = РегистрацияНаПЛК.Ссылка"; 
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);

КонецПроцедуры

#КонецОбласти

Функция НеТребуетсяОтражатьСостоянияРегистрации(ДополнительныеСвойства)
	
	Возврат ДополнительныеСвойства <> Неопределено 
		И ДополнительныеСвойства.Свойство("НеОтражатьСостоянияРегистрации")
		И ДополнительныеСвойства.НеОтражатьСостоянияРегистрации;
КонецФункции

#КонецОбласти

#Область Печать

// Функция получает данные для формирования печатной формы карточки анализа зерна ЗПП-47
// Возвращает данные, необходимые для печатной формы.
// 
// Параметры:
// 	ПараметрыПечати - Структура - дополнительные настройки печати
//	ДокументОснование - ДокументСсылка.гкс_ЛабораторныйАнализ - Документ, который нужно распечатать.
//
// Возвращаемое значение:
//	Структура:
//	 * РезультатПоШапке - РезультатЗапроса
//	 * РезультатКачественныеПоказатели - РезультатЗапроса
//	 * РезультатПоРегистрациям - РезультатЗапроса
//	 * РезультатПоНормативнойСертификации - РезультатЗапроса
//	 * ОписаниеОшибки - Строка

Функция ПолучитьДанныеДляПечатнойФормыЗПП47(ПараметрыПечати, ДокументОснование) Экспорт
	
	СтруктураВозврата = Новый Структура();
	СтруктураВозврата.Вставить("РезультатПоШапке");
	СтруктураВозврата.Вставить("РезультатКачественныеПоказатели");
	СтруктураВозврата.Вставить("РезультатПоРегистрациям");
	СтруктураВозврата.Вставить("РезультатПоНормативнойСертификации");
	СтруктураВозврата.Вставить("ОписаниеОшибки");
	
	СтруктураВозврата.ОписаниеОшибки = Неопределено;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДокументРегистрации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "гкс_ДокументРегистрации");
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаВыборкиПоШапкеДокументаДляЗПП47() + гкс_ОбщегоНазначенияПЛК.РазделительЗапросовВПакете()
		+ ТекстЗапросаВыборкиКачественныхПоказателей() + гкс_ОбщегоНазначенияПЛК.РазделительЗапросовВПакете()
		+ ТекстЗапросаВыборкиРегистрацияПоФормированиюПробы() + гкс_ОбщегоНазначенияПЛК.РазделительЗапросовВПакете()
		+ ТекстЗапросаРезультатаНормативнойСертификации();

	Запрос.УстановитьПараметр("ДокументОснование", 			ДокументОснование);
	Запрос.УстановитьПараметр("ФормированиеНомераПробы", 	ДокументРегистрации);

	Результаты = Запрос.ВыполнитьПакет();
	
	УстановитьПривилегированныйРежим(Ложь);
		
	СтруктураВозврата.РезультатПоШапке 						= Результаты[0];
	СтруктураВозврата.РезультатКачественныеПоказатели 		= Результаты[1];
	СтруктураВозврата.РезультатПоРегистрациям 				= Результаты[2];
	СтруктураВозврата.РезультатПоНормативнойСертификации 	= Результаты[5];
	
	Возврат СтруктураВозврата;
	
КонецФункции
		
Функция ПолучитьДанныеДляПечатныхФормЛабораторногоАнализа(ДокументОснование) Экспорт
	
	СтруктураВозврата = Новый Структура(
		"РезультатПоШапке, ОписаниеОшибки");
	СтруктураВозврата.ОписаниеОшибки = Неопределено;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаВыборкиПоШапкеДокумента();
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	Результаты = Запрос.ВыполнитьПакет();
		
	СтруктураВозврата.РезультатПоШапке = Результаты[0];
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Функция получает данные для формирования отраслевой формы удостоверения ЗПП-42
// Возвращает данные, необходимые для печатной формы.
// 
// Параметры:
// 	ПараметрыПечати - Структура - дополнительные настройки печати
//	ДокументОснование - ДокументСсылка.гкс_ЛабораторныйАнализ - Документ, который нужно распечатать.
//
// Возвращаемое значение:
//	Структура:
//	 * РезультатПоШапке - РезультатЗапроса
//	 * РезультатКачественныеПоказатели - РезультатЗапроса
//	 * ОписаниеОшибки - Строка
 
Функция ПолучитьДанныеДляПечатнойФормыЗПП42(ДокументОснование) Экспорт
	
	СтруктураВозврата = Новый Структура;

	СтруктураВозврата.Вставить("РезультатПоШапке");
	СтруктураВозврата.Вставить("РезультатКачественныеПоказатели");
	СтруктураВозврата.Вставить("РезультатОсобыеОтметки");
	СтруктураВозврата.Вставить("ОписаниеОшибки");
	
	СтруктураВозврата.ОписаниеОшибки = Неопределено;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаВыборкиПоДокументамДляЗПП42();
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("ТранспортныйДокументПустая", Документы.гкс_ТранспортныйДокумент.ПустаяСсылка());
	Запрос.УстановитьПараметр("ТочкаМаршрутаПустая", Справочники.гкс_ТочкиМаршрута.ПустаяСсылка());
	Запрос.УстановитьПараметр("КонтрагентПустая", Справочники.Контрагенты.ПустаяСсылка());
	Запрос.УстановитьПараметр("ТранспортПустая", Справочники.ТранспортныеСредства.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПоказательПустаяСсылка", 
								Справочники.гкс_ПоказателиАнализовНоменклатуры.ПустаяСсылка()); 
			
	Результаты = Запрос.ВыполнитьПакет();
	
	УстановитьПривилегированныйРежим(Ложь);
		
	СтруктураВозврата.РезультатПоШапке 					= Результаты[1];
	СтруктураВозврата.РезультатКачественныеПоказатели 	= Результаты[2];
	СтруктураВозврата.РезультатОсобыеОтметки 			= Результаты[3];
	
	Возврат СтруктураВозврата;
	
КонецФункции	

#КонецОбласти

#Область Прочее

Процедура ЗаполнитьДополнительныеПараметры(ДопПараметры, Запрос)
	
	Если ДопПараметры.ДополнительныеСвойства = Неопределено Тогда
		ДопПараметры.ДополнительныеСвойства = Новый Структура;
	КонецЕсли;
	
	Если Запрос.Параметры.Свойство("НазначатьНаСклады") Тогда 
		ДопПараметры.ДополнительныеСвойства.Вставить("НазначатьНаСклады", Запрос.Параметры["НазначатьНаСклады"]);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ТекстыЗапросов

// Запросы для печати    

Функция ТекстЗапросаВыборкиПоШапкеДокумента()
	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЛабораторныйАнализ.Организация КАК Организация,
	|	ЛабораторныйАнализ.НомерПробы КАК НомерПробы,
	|	ЛабораторныйАнализ.Номер КАК Номер,
	|	ЛабораторныйАнализ.Дата КАК Дата,
	|	ЛабораторныйАнализ.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(РегистрацияНаПЛК.ОтправительПолучатель, """") КАК ОтправительПолучатель,
	|	ЕСТЬNULL(РегистрацияНаПЛК.ТранспортноеСредство, """") КАК ТранспортноеСредство,
	|	ЕСТЬNULL(РегистрацияНаПЛК.ТранспортноеСредство.НомерТранспортногоСредства, """") КАК НомерТранспортногоСредства,
	|	ЕСТЬNULL(НастройкиПечатиФормированияПроб.ОбъемПробы, """") КАК ОбъемПробы,
	|	ЕСТЬNULL(Организации.ОГРН, """") КАК ОГРН,
	|	ЕСТЬNULL(Организации.ИНН, """") КАК ИНН,
	|	ЕСТЬNULL(Организации.Наименование, """") КАК ПредставлениеОрганизации,
	|	ЕСТЬNULL(Организации.Адрес, """") КАК ОрганизацияАдрес,
	|	ЕСТЬNULL(Организации.Телефоны, """") КАК ОрганизацияТелефоны,
	|	ЕСТЬNULL(Организации.ЭлектроннаяПочта, """") КАК ОрганизацияЭлектроннаяПочта,
	|	ЕСТЬNULL(НастройкиПечатиФормированияПроб.ГОСТ, """") КАК ГОСТ,
	|	ЕСТЬNULL(РегистрацияНаПЛК.Собственник, """") КАК Собственник,
	|	ЕСТЬNULL(СостоянияРегистрации.МестнаяДата, """") КАК МестнаяДата,
	|	ВЫБОР
	|		КОГДА
	|			ЛабораторныйАнализ.гкс_НазначениеИспользованияКачества = ЗНАЧЕНИЕ(Перечисление.гкс_НазначенияИспользованияКачества.Приемка)
	|			ТОГДА ЕСТЬNULL(РегистрацияНаПЛК.Водитель, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Водитель
	|ИЗ
	|	Документ.гкс_ЛабораторныйАнализ КАК ЛабораторныйАнализ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_НастройкиПечатиФормированияПроб КАК НастройкиПечатиФормированияПроб
	|		ПО ЛабораторныйАнализ.Номенклатура = НастройкиПечатиФормированияПроб.Номенклатура
	|		И ЛабораторныйАнализ.ТочкаМаршрута = НастройкиПечатиФормированияПроб.ТочкаМаршрута
	|		И ЛабораторныйАнализ.гкс_ВидПеревозки = НастройкиПечатиФормированияПроб.ВидПеревозки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ЛабораторныйАнализ.Организация = Организации.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_РегистрацияНаПЛК КАК РегистрацияНаПЛК
	|		ПО ЛабораторныйАнализ.гкс_ДокументРегистрации = РегистрацияНаПЛК.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СостоянияРегистрации КАК СостоянияРегистрации
	|		ПО ЛабораторныйАнализ.гкс_ДокументРегистрации = СостоянияРегистрации.ДокументРегистрации
	|		И СостоянияРегистрации.Состояние = ЗНАЧЕНИЕ(Перечисление.гкс_СостоянияРегистрации.ВзятыПробы)
	|ГДЕ
	|	ЛабораторныйАнализ.Ссылка = &ДокументОснование";
	
КонецФункции

Функция ТекстЗапросаВыборкиКачественныхПоказателей()
	Возврат
	"ВЫБРАТЬ
	|	ЦБТ_ЛабораторныйАнализКачественныеПоказатели.Показатель КАК Показатель,
	|	ЦБТ_ЛабораторныйАнализКачественныеПоказатели.Значение КАК Значение,
	|	ЦБТ_ЛабораторныйАнализКачественныеПоказатели.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЦБТ_ЛабораторныйАнализКачественныеПоказатели.НомерПробы КАК НомерПробы,
	|	ЦБТ_ЛабораторныйАнализКачественныеПоказатели.СоответствуетНормативу КАК СоответствуетНормативу,
	|	ЦБТ_ЛабораторныйАнализКачественныеПоказатели.ОтклонениеОтБазиса КАК ОтклонениеОтБазиса,
	|	ЦБТ_ЛабораторныйАнализКачественныеПоказатели.гкс_Примечание КАК гкс_Примечание
	|ИЗ
	|	Документ.гкс_ЛабораторныйАнализ.КачественныеПоказатели КАК ЦБТ_ЛабораторныйАнализКачественныеПоказатели
	|ГДЕ
	|	ЦБТ_ЛабораторныйАнализКачественныеПоказатели.Ссылка = &ДокументОснование";
КонецФункции

Функция ТекстЗапросаВыборкиПоШапкеДокументаДляЗПП47()
	Возврат
	"ВЫБРАТЬ
	|	ШапкиДокументовЛабАнализ.гкс_НазначениеИспользованияКачества КАК ТипАнализа,
	|	ШапкиДокументовЛабАнализ.Дата КАК Дата,
	|	ШапкиДокументовЛабАнализ.Номер КАК Номер,
	|	ШапкиДокументовЛабАнализ.Организация КАК Организация,
	|	ЕСТЬNULL(Организации.НаименованиеПолное, """") КАК ПредставлениеОрганизации,
	|	ЕСТЬNULL(Организации.КодПоОКПО, """") КАК КодПоОКПО,
	|	ШапкиДокументовЛабАнализ.Ответственный КАК Ответственный,
	|	ШапкиДокументовЛабАнализ.НомерПробы КАК НомерПробы,
	|	ШапкиДокументовЛабАнализ.ТочкаМаршрута КАК МестоОтбораПробы,
	|	ЕСТЬNULL(гкс_НастройкиПечатиФормированияПроб.ОбъемПробы, 0) * 1000 КАК МассаПробы,
	|	ШапкиДокументовЛабАнализ.Номенклатура КАК Номенклатура,
	|	ШапкиДокументовЛабАнализ.гкс_ВидПеревозки КАК гкс_ВидПеревозки,
	|	ШапкиДокументовЛабАнализ.ВидЛабораторногоАнализа КАК ВидЛабораторногоАнализа,
	|	гкс_НастройкиПечатиФормированияПроб.ГОСТ КАК ГОСТОтбораПроб,
	|	гкс_ФормированиеНомераПробы.ТипПробы КАК ТипПробы,
	|	ЕСТЬNULL(ШапкиДокументовРегистрации.АдресЗоныКарантинногоКонтроляСтрокой, """") КАК Происхождение,
	|	ШапкиДокументовЛабАнализ.гкс_СостояниеТранспортногоСредства КАК СостояниеТранспорта,
	|	ШапкиДокументовЛабАнализ.ГодУрожая КАК ГодУрожая
	|ИЗ
	|	Документ.гкс_ЛабораторныйАнализ КАК ШапкиДокументовЛабАнализ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_ФормированиеНомераПробы КАК гкс_ФормированиеНомераПробы
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_ФормированиеНомераПробы.СписокРегистраций КАК РегистрацииФормированийНомеровПроб
	|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_РегистрацияНаПЛК КАК ШапкиДокументовРегистрации
	|				ПО ШапкиДокументовРегистрации.Ссылка = РегистрацииФормированийНомеровПроб.ДокументРегистрации
	|			ПО гкс_ФормированиеНомераПробы.Ссылка = РегистрацииФормированийНомеровПроб.Ссылка
	|			И РегистрацииФормированийНомеровПроб.НомерСтроки = 1
	|		ПО ШапкиДокументовЛабАнализ.гкс_ДокументРегистрации = гкс_ФормированиеНомераПробы.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ШапкиДокументовЛабАнализ.Организация = Организации.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_НастройкиПечатиФормированияПроб КАК гкс_НастройкиПечатиФормированияПроб
	|		ПО ШапкиДокументовЛабАнализ.ТочкаМаршрута = гкс_НастройкиПечатиФормированияПроб.ТочкаМаршрута
	|		И ШапкиДокументовЛабАнализ.Номенклатура = гкс_НастройкиПечатиФормированияПроб.Номенклатура
	|		И ШапкиДокументовЛабАнализ.гкс_ВидПеревозки = гкс_НастройкиПечатиФормированияПроб.ВидПеревозки
	|		И гкс_ФормированиеНомераПробы.ТипПробы = гкс_НастройкиПечатиФормированияПроб.ТипПробы
	|ГДЕ
	|	ШапкиДокументовЛабАнализ.Ссылка = &ДокументОснование";
КонецФункции	

Функция ТекстЗапросаВыборкиРегистрацияПоФормированиюПробы()
	Возврат
	"ВЫБРАТЬ
	|	ФормированиеНомераПробыСписокРегистраций.ДокументРегистрации КАК ДокументРегистрации,
	|	ФормированиеНомераПробыСписокРегистраций.НомерСтроки КАК НомерСтроки,
	|	РегистрацияНаПЛК.ВесНетто / 1000 КАК ВесНетто,
	|	ЕстьNULL(Организации.НаименованиеПолное, """") КАК ПредставлениеПолучателя,
	|	РегистрацияНаПЛК.Контрагент КАК Контрагент,
	|	РегистрацияНаПЛК.ДатаДокументаПоставщика КАК ДатаДокументаПоставщика,
	|	РегистрацияНаПЛК.НомерДокументаПоставщика КАК НомерДокументаПоставщика,
	|	ЕСТЬNULL(ВсеТранспортныеСредства.НомерТранспортногоСредства, """") КАК НомерТранспортногоСредства,
	|	ЕСТЬNULL(СвязьРегистрацииИТранспортногоДокумента.ТранспортныйДокумент,
	|		ЗНАЧЕНИЕ(Документ.гкс_ТранспортныйДокумент.ПустаяСсылка)) КАК ТранспортныйДокумент,
	|	ЕСТЬNULL(ГКСТранспортныйДокумент.ПунктПогрузки, ЗНАЧЕНИЕ(Справочник.гкс_ТочкиМаршрута.ПустаяСсылка)) КАК
	|		ПунктПогрузки
	|ИЗ
	|	Документ.гкс_ФормированиеНомераПробы.СписокРегистраций КАК ФормированиеНомераПробыСписокРегистраций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_РегистрацияНаПЛК КАК РегистрацияНаПЛК
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТранспортныеСредства КАК ВсеТранспортныеСредства
	|			ПО РегистрацияНаПЛК.ТранспортноеСредство = ВсеТранспортныеСредства.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|			ПО РегистрацияНаПЛК.Организация = Организации.Ссылка
	|		ПО ФормированиеНомераПробыСписокРегистраций.ДокументРегистрации = РегистрацияНаПЛК.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СвязьРегистрацииИТранспортногоДокумента КАК
	|			СвязьРегистрацииИТранспортногоДокумента
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_ТранспортныйДокумент КАК ГКСТранспортныйДокумент
	|			ПО СвязьРегистрацииИТранспортногоДокумента.ТранспортныйДокумент = ГКСТранспортныйДокумент.Ссылка
	|		ПО ФормированиеНомераПробыСписокРегистраций.ДокументРегистрации = СвязьРегистрацииИТранспортногоДокумента.ДокументРегистрации
	|ГДЕ
	|	ФормированиеНомераПробыСписокРегистраций.Ссылка = &ФормированиеНомераПробы
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
КонецФункции

Функция ТекстЗапросаРезультатаНормативнойСертификации()
	Возврат
	"ВЫБРАТЬ
	|	НормативнаяСертификацияНоменклатуры.Ссылка КАК НормативнаяСертификация,
	|	НормативнаяСертификацияНоменклатуры.ГОСТ КАК ГОСТ
	|ПОМЕСТИТЬ ВТ_НормативнаяСертификацияНоменклатуры
	|ИЗ
	|	Документ.гкс_ЛабораторныйАнализ КАК ЛабораторныйАнализ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_НормативнаяСертификацияНоменклатуры КАК НормативнаяСертификацияНоменклатуры
	|		ПО ЛабораторныйАнализ.ТочкаМаршрута = НормативнаяСертификацияНоменклатуры.ТочкаМаршрута
	|			И ЛабораторныйАнализ.Номенклатура = НормативнаяСертификацияНоменклатуры.Номенклатура
	|			И ЛабораторныйАнализ.гкс_НазначениеИспользованияКачества = НормативнаяСертификацияНоменклатуры.гкс_НазначениеИспользованияКачества
	|			И ЛабораторныйАнализ.гкс_ВидПеревозки = НормативнаяСертификацияНоменклатуры.гкс_ВидПеревозки
	|ГДЕ
	|	ЛабораторныйАнализ.Ссылка = &ДокументОснование
	|	И НормативнаяСертификацияНоменклатуры.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВТ_НормативнаяСертификацияНоменклатуры.НормативнаяСертификация) КАК НормативнаяСертификация
	|ПОМЕСТИТЬ ВТ_МмаксимуНормативнаяСертификацияНоменклатуры
	|ИЗ
	|	ВТ_НормативнаяСертификацияНоменклатуры КАК ВТ_НормативнаяСертификацияНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НормативнаяСертификацияНоменклатуры.НормативнаяСертификация КАК НормативнаяСертификация,
	|	ВТ_НормативнаяСертификацияНоменклатуры.ГОСТ КАК ГОСТ
	|ИЗ
	|	ВТ_НормативнаяСертификацияНоменклатуры КАК ВТ_НормативнаяСертификацияНоменклатуры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МмаксимуНормативнаяСертификацияНоменклатуры КАК ВТ_МмаксимуНормативнаяСертификацияНоменклатуры
	|		ПО (ВТ_МмаксимуНормативнаяСертификацияНоменклатуры.НормативнаяСертификация = ВТ_НормативнаяСертификацияНоменклатуры.НормативнаяСертификация)";
КонецФункции

Функция ТекстЗапросаВыборкиПоДокументамДляЗПП42()
	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	&ДокументОснование КАК ДокументОснование,
	|	ЕСТЬNULL(СпрОрганизации.НаименованиеСокращенное, """") КАК ПредставлениеОрганизации,
	|	ДокЛабораторныйАнализ.Дата КАК Дата,
	|	ДокЛабораторныйАнализ.Номер КАК Номер,
	|	ДокЛабораторныйАнализ.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ДокРегистрацияНаПЛК.ОтправительПолучатель, &КонтрагентПустая) КАК Отправитель,
	|	ЕСТЬNULL(ДокРегистрацияНаПЛК.ТранспортноеСредство, &ТранспортПустая) КАК Вагон,
	|	ЕСТЬNULL(ДокРегистрацияНаПЛК.ВесБрутто, 0) КАК Вес,
	|	ЕСТЬNULL(ДокТранспортныйДокумент.Номер, """") КАК НакладнаяНомер,
	|	ЕСТЬNULL(ДокТранспортныйДокумент.ПунктПогрузки, &ТочкаМаршрутаПустая) КАК ПунктПогрузки,
	|	ЕСТЬNULL(ДокТранспортныйДокумент.ПунктРазгрузки, &ТочкаМаршрутаПустая) КАК ПунктРазгрузки,
	|	ЕСТЬNULL(ДокТранспортныйДокумент.Получатель, &КонтрагентПустая) КАК Получатель
	|ПОМЕСТИТЬ ВТ_ДанныеЛабАнализ
	|ИЗ
	|	Документ.гкс_ЛабораторныйАнализ КАК ДокЛабораторныйАнализ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_РегистрацияНаПЛК КАК ДокРегистрацияНаПЛК
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СвязьРегистрацииИТранспортногоДокумента КАК
	|				РССвязьРегистрацииИТранспортногоДокумента
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ТранспортныйДокумент КАК ДокТранспортныйДокумент
	|				ПО (РССвязьРегистрацииИТранспортногоДокумента.ТранспортныйДокумент = ДокТранспортныйДокумент.Ссылка)
	|			ПО (ДокРегистрацияНаПЛК.Ссылка = РССвязьРегистрацииИТранспортногоДокумента.ДокументРегистрации)
	|		ПО (ДокЛабораторныйАнализ.гкс_ДокументРегистрации = ДокРегистрацияНаПЛК.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК СпрОрганизации
	|		ПО (ДокЛабораторныйАнализ.Организация = СпрОрганизации.Ссылка)
	|ГДЕ
	|	ДокЛабораторныйАнализ.Ссылка = &ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокЛабораторныйАнализ.ДокументОснование КАК ДокументОснование,
	|	ДокЛабораторныйАнализ.ПредставлениеОрганизации КАК ПредставлениеОрганизации,
	|	ДокЛабораторныйАнализ.Дата КАК Дата,
	|	ДокЛабораторныйАнализ.Номер КАК Номер,
	|	ДокЛабораторныйАнализ.Номенклатура КАК Номенклатура,
	|	ДокЛабораторныйАнализ.Отправитель КАК Отправитель,
	|	ДокЛабораторныйАнализ.Вагон КАК Вагон,
	|	ДокЛабораторныйАнализ.Вес КАК Вес,
	|	ДокЛабораторныйАнализ.НакладнаяНомер КАК НакладнаяНомер,
	|	ДокЛабораторныйАнализ.ПунктПогрузки КАК ПунктПогрузки,
	|	ДокЛабораторныйАнализ.ПунктРазгрузки КАК ПунктРазгрузки,
	|	ДокЛабораторныйАнализ.Получатель КАК Получатель
	|ИЗ
	|	ВТ_ДанныеЛабАнализ КАК ДокЛабораторныйАнализ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ДокументОснование КАК ЛабАнализ,
	|	ДокЛабАнализКачественныеПоказатели.Показатель КАК Показатель,
	|	ДокЛабАнализКачественныеПоказатели.Значение КАК Значение,
	|	ДокЛабАнализКачественныеПоказатели.СоответствуетНормативу КАК СоответствуетНормативу
	|ИЗ
	|	Документ.гкс_ЛабораторныйАнализ.КачественныеПоказатели КАК ДокЛабАнализКачественныеПоказатели
	|ГДЕ
	|	ДокЛабАнализКачественныеПоказатели.Ссылка = &ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЛабораторныйАнализ.Ссылка КАК ЛабАнализ,
	|	ЕСТЬNULL(НастройкаПечатиОсобыхОтметокЗПП47АЛЦ.Показатель, &ПоказательПустаяСсылка) КАК Показатель,
	|	ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(НастройкаПечатиОсобыхОтметокЗПП47АЛЦ.ЕдиницаИзмерения, """")) КАК ЕдиницаИзмерения
	|ИЗ
	|	Документ.гкс_ЛабораторныйАнализ КАК ЛабораторныйАнализ
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_НастройкаПечатиОсобыхОтметокЗПП47АЛЦ КАК НастройкаПечатиОсобыхОтметокЗПП47АЛЦ
	|			ПО ЛабораторныйАнализ.Организация = НастройкаПечатиОсобыхОтметокЗПП47АЛЦ.Организация
	|			И ЛабораторныйАнализ.ТочкаМаршрута = НастройкаПечатиОсобыхОтметокЗПП47АЛЦ.ТочкаМаршрута
	|			И ЛабораторныйАнализ.Номенклатура = НастройкаПечатиОсобыхОтметокЗПП47АЛЦ.Номенклатура
	|ГДЕ
	|	ЛабораторныйАнализ.Ссылка = &ДокументОснование
	|СГРУППИРОВАТЬ ПО
	|	ЛабораторныйАнализ.Ссылка,
	|	НастройкаПечатиОсобыхОтметокЗПП47АЛЦ.Показатель,
	|	ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(НастройкаПечатиОсобыхОтметокЗПП47АЛЦ.ЕдиницаИзмерения, """"))";
	
КонецФункции
// Конец Запросы для печати

#КонецОбласти 

#КонецОбласти

#КонецЕсли
