// @strict-types

#Область ПрограммныйИнтерфейс

Функция ПроизвольныйПредопределенныйОбъект(ИмяПредопределенного) Экспорт
    
    УстановитьПривилегированныйРежим(Истина);
    
    Если НЕ ЗначениеЗаполнено(ИмяПредопределенного) Тогда
        Возврат Неопределено;    
    КонецЕсли; 
    
    Возврат ПланыВидовХарактеристик
                    .гкс_ПроизвольныеПредопределенныеОбъекты
                    .ПроизвольныйПредопределенныйОбъект(ИмяПредопределенного);
        
КонецФункции

// Возвращает значение константы по имени.
// 
// Параметры:
//  Имя - Строка -Имя константы.
// 
// Возвращаемое значение:
//  Произвольный - Значение константы.
//
Функция ЗначениеКонстанты(Имя) Экспорт
	
	Возврат гкс_ОбщегоНазначения.ЗначениеКонстанты(Имя);
	
КонецФункции

#КонецОбласти
