#Область ПрограммныйИнтерфейс

// Определяет объекты конфигурации, в модулях менеджеров которых размещена процедура ПриОпределенииНастроекПечати,
// формирующая список команд печати, предоставляемых этим объектом.
//
// Параметры:
//  СписокОбъектов - Массив - менеджеры объектов с процедурой ПриОпределенииНастроекПечати.
//
Процедура ОпределитьОбъектыСКомандамиПечати(СписокОбъектов) Экспорт

	СписокОбъектов.Добавить(Документы.гкс_ФормированиеНомераПробы);	
	СписокОбъектов.Добавить(Документы.гкс_ЛабораторныйАнализ);
	СписокОбъектов.Добавить(Документы.гкс_РеестрНакладныхЗПП3);
	СписокОбъектов.Добавить(Документы.гкс_ПриказНаОтпускПродукцииЭлеватораЗПП16);
	СписокОбъектов.Добавить(Обработки.гкс_АРМКомпозитныеПробы);
	СписокОбъектов.Добавить(Обработки.гкс_ПриемкаТранспорта);
	
КонецПроцедуры	
	
#КонецОбласти