#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаПечать(Команда)
	
	РеквизитыПодписанта = ПолучитьРеквизитыПодписанта(Подписант);
	
	ДанныеПечати = Новый Структура;
	ДанныеПечати.Вставить("Подписант",           РеквизитыПодписанта.Наименование);
	ДанныеПечати.Вставить("ДолжностьПодписанта", РеквизитыПодписанта.Должность);
	
	Закрыть(Новый Структура("ДанныеПечати", ДанныеПечати));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьРеквизитыПодписанта(Подписант)
	
	Возврат гкс_ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Подписант, "Наименование, Должность");
	
КонецФункции

#КонецОбласти
