
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("ЭтоВызовИзФормыПричиныОтклоненияНормПогрузки") 
		И Параметры.ЭтоВызовИзФормыПричиныОтклоненияНормПогрузки Тогда
		
		Элементы.Готово.Заголовок = "Записать";
	КонецЕсли;
	
	ДокументРегистрации = Параметры.ДокументРегистрации;
	
	ИнициализироватьРеквизитыФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	МинимальноДопустимаяДлинаКомментария = 5;
	Если СтрДлина(Комментарий) < МинимальноДопустимаяДлинаКомментария Тогда
		
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Комментарий не может быть меньше %1 символов'"), 
						МинимальноДопустимаяДлинаКомментария);
						
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, ,"Комментарий");
		Возврат;
	КонецЕсли;
	
	ЗаписатьДанныеПоРегистрации(ДокументРегистрации, Комментарий);
	Закрыть(Новый Структура("ПричинаОтклонения", Комментарий));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьРеквизитыФормы()
	ДанныеРегистрации =
		РегистрыСведений.гкс_ВремяНахожденияТСНаПЛК.ДанныеПоВремениНахожденияНаПЛК(ДокументРегистрации);
	ВремяПребыванияТС = ДанныеРегистрации.ВремяНаПЛК;
КонецПроцедуры	

&НаСервереБезКонтекста
Процедура ЗаписатьДанныеПоРегистрации(ДокументРегистрации, Комментарий)
	РегистрыСведений.гкс_ВремяНахожденияТСНаПЛК.ОбновитьКомментарийОтклонения(ДокументРегистрации, Комментарий);		
КонецПроцедуры

#КонецОбласти
