
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УправлениеЭлементамиФормы();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользоватьПериодПриИзменении(Элемент)

	УправлениеЭлементамиФормы();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПолучитьВходящиеДанные(Команда)

	Если Не ЗначениеЗаполнено(Объект.ОтборПоОрганизации) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо выбрать организацию.'"));
		Возврат;
	КонецЕсли;

	ДлительнаяОперация = ПолучитьВходящиеДанныеНаСервере();

    ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Вставить("ВыводитьСообщения", Истина);

	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗагрузкиДанных", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОповещения, ПараметрыОжидания);

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВходящиеДанные(Команда)

	ДлительнаяОперация = ОбработатьВходящиеДанныеНаСервере();

    ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Вставить("ВыводитьСообщения", Истина);

	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеОбработкиДанных", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОповещения, ПараметрыОжидания);

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОчисткуУстаревшихДанных(Команда)
	ВыполнитьОчисткуУстаревшихДанныхНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомандаЛогСобытийВебСервисов(Команда)

	ОткрытьФорму("РегистрСведений.гкс_ЛогСобытийВебСервисов.ФормаСписка");

КонецПроцедуры

&НаКлиенте
Процедура КомандаПодключениеКВебСервисам(Команда)

	ОткрытьФорму("Справочник.гкс_ПодключениеКВебСервисам.ФормаСписка");

КонецПроцедуры

&НаКлиенте
Процедура КомандаРесурсыВебСервисов(Команда)

	ОткрытьФорму("Справочник.гкс_РесурсыВебСервисов.ФормаСписка");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеЗагрузкиДанных(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Результат.Статус = "Ошибка" Тогда

		ТекстСообщения = СтрШаблон(НСтр("ru = 'Произошла ошибка при загрузке данных из Warehouse %1 %2'"),
			Символы.ПС, Результат.КраткоеПредставлениеОшибки);

		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);

	Иначе

		ТекстСообщения = НСтр("ru = 'Загрузка данных из Warehouse завершена'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеОбработкиДанных(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Результат.Статус = "Ошибка" Тогда

		ТекстСообщения = СтрШаблон(НСтр("ru = 'Произошла ошибка при обработке %1 %2'"),
			Символы.ПС, Результат.КраткоеПредставлениеОшибки);

		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);

	Иначе

		ТекстСообщения = НСтр("ru = 'Обработка входящих данных завершена'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);

	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьВходящиеДанныеНаСервере()

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();

	ПараметрПериод = Новый Структура;

	Если ИспользоватьПериод Тогда
		ПараметрПериод.Вставить("ДатаНачала", 	Периоды.ДатаНачала);
		ПараметрПериод.Вставить("ДатаКонец", 	Периоды.ДатаОкончания);
	КонецЕсли;

	Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения,
								"гкс_ИнтеграцияWarehouse.ПолучитьДанныеWarehouse",
								ПараметрПериод);

КонецФункции

&НаСервере
Функция ОбработатьВходящиеДанныеНаСервере()

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрОбработки = Справочники.гкс_НастройкиИнтеграцииWarehouse.НастройкиИнтеграции();

	Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения,
								"гкс_ИнтеграцияWarehouse.ОбработатьВходящиеДанныеWarehouse",
								ПараметрОбработки);
КонецФункции

&НаСервере
Процедура ВыполнитьОчисткуУстаревшихДанныхНаСервере()

	гкс_ИнтеграцияWarehouseСлужебный.ВыполнитьОчисткуУстаревшихДанныхWarehouse();

КонецПроцедуры

&НаКлиенте
Процедура УправлениеЭлементамиФормы()

	Элементы.Периоды.Доступность = ИспользоватьПериод;

КонецПроцедуры

#КонецОбласти
