
#Область ПрограммныйИнтерфейс

// Определяет вид веса по типам взвешивания и регистрации
//
// Параметры:
//  ТипВзвешивания - ПеречислениеСсылка.гкс_ТипыВзвешивания - Въезд или Выезд
//                
//  ТипРегистрации - ПеречислениеСсылка.гкс_ТипРегистрации - Приемка или Отгрузка
//
// Возвращаемое значение:
//   Строка  - "Брутто", "Тара"
//
Функция ВидВеса(ТипВзвешивания, ТипРегистрации) Экспорт
	
	ВидыВесовПоВидамОперации = СоотвествиеВидовВеса();
	ЗначениеСоотвествия = ВидыВесовПоВидамОперации.Получить(СтрШаблон("%1%2", ТипВзвешивания, ТипРегистрации));
	
    Возврат ЗначениеСоотвествия;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоотвествиеВидовВеса()
	
	ТипыРегистрации = Перечисления.гкс_ТипРегистрации;
	ТипыВзвешивания = Перечисления.гкс_ТипыВзвешивания;
	
	Результат = Новый Соответствие;
	Результат.Вставить(СтрШаблон("%1%2", ТипыВзвешивания.Въезд, ТипыРегистрации.Приемка), "Брутто");
	Результат.Вставить(СтрШаблон("%1%2", ТипыВзвешивания.Въезд, ТипыРегистрации.Отгрузка), "Тара");
	Результат.Вставить(СтрШаблон("%1%2", ТипыВзвешивания.Выезд, ТипыРегистрации.Приемка), "Тара");
	Результат.Вставить(СтрШаблон("%1%2", ТипыВзвешивания.Выезд, ТипыРегистрации.Отгрузка), "Брутто");
	
	Возврат Результат;

КонецФункции	

#КонецОбласти




