#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СчитывательПользователя(Знач Пользователь = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.Текст = ТекстЗапросаСчитывательПользователя();
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;		
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Считыватель; 
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ТекстыЗапроса

Функция ТекстЗапросаСчитывательПользователя()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВсеПользователиСчитывателей.Ссылка КАК Считыватель
	|ИЗ
	|	Справочник.гкс_СчитывателиUHFRFID.Пользователи КАК ВсеПользователиСчитывателей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.гкс_СчитывателиUHFRFID КАК ВсеСчитыватели
	|		ПО ВсеПользователиСчитывателей.Ссылка = ВсеСчитыватели.Ссылка
	|ГДЕ
	|	ВсеПользователиСчитывателей.Пользователь = &Пользователь
	|	И НЕ ВсеСчитыватели.ПометкаУдаления";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли