#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДополнитьФорму();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ДополнитьФорму()
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	МенеджерСостояний = Перечисления.гкс_СостоянияОчередиОтложенногоФормирования;

	гкс_ФормыОбъектовИАС.ДобавитьУОСостояния(ЭтотОбъект, 
	                                         МенеджерСостояний.ЕстьПроблемы, 
											 WebЦвета.Розовый);
	гкс_ФормыОбъектовИАС.ДобавитьУОСостояния(ЭтотОбъект,  
	                                         МенеджерСостояний.ОжидаетФормирования, 
											 WebЦвета.СветлоЖелтый);
	гкс_ФормыОбъектовИАС.ДобавитьУОСостояния(ЭтотОбъект, 
	                                         МенеджерСостояний.Сформировано, 
	                                         WebЦвета.ГолубойСоСтальнымОттенком);
											 
	гкс_ФормыОбъектовИАС.ДобавитьУОСостояния(ЭтотОбъект, 
	                                         МенеджерСостояний.Пропущено, 
	                                         WebЦвета.СеребристоСерый);
	
КонецПроцедуры

#КонецОбласти
