#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	НастройкиЦвета = ОбработкаОбъект.ЗагрузитьНастройкиЦвета();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
	Если Не НастройкиЦвета = Неопределено Тогда
		ЗначениеВРеквизитФормы(НастройкиЦвета, "НастройкиЦветаЭлементовПланировщика");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	
	СохранитьНастройкиНаСервере();
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СохранитьНастройкиНаСервере()
	
	НастройкиЦвета = РеквизитФормыВЗначение("НастройкиЦветаЭлементовПланировщика");
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.СохранитьНастройкиЦвета(НастройкиЦвета);
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
КонецПроцедуры

#КонецОбласти
