#Область ПрограммныйИнтерфейс

Функция ТочкаПЛКПоНомеруПроезда(НомерПроезда) Экспорт
	
	Если НЕ ЗначениеЗаполнено(НомерПроезда) Тогда
		Возврат ПустаяСсылка();
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	гкс_СтруктураПЛК.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.гкс_СтруктураПЛК КАК гкс_СтруктураПЛК
	|ГДЕ
	|	гкс_СтруктураПЛК.НомерПроезда = &НомерПроезда";
	
	Запрос.УстановитьПараметр("НомерПроезда", НомерПроезда);
	
	РезультатЗапроса = Запрос.Выполнить();

	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		Результат = ВыборкаДетальныеЗаписи.Ссылка;
	Иначе	
		Результат = ПустаяСсылка();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
