
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Период", ВыбираемыйПериод);
	
	Если Не ЗначениеЗаполнено(ВыбираемыйПериод) Тогда
		ВыбираемыйПериод.ДатаНачала = НачалоДня(ТекущаяДатаСеанса());
		ВыбираемыйПериод.ДатаОкончания = КонецДня(ТекущаяДатаСеанса());
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаВыбрать(Команда)
	
    Закрыть(ВыбираемыйПериод);

КонецПроцедуры

#КонецОбласти

