#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
		
	ПараметрыФормы = Новый Структура;
	//@skip-warning
	Если ТипЗнч(ПараметрыВыполненияКоманды.Источник) = Тип("УправляемаяФорма") Тогда
		
		ИмяФормы = ПараметрыВыполненияКоманды.Источник.ИмяФормы;
		
		ИмяФормывМассиве = СтрРазделить(ИмяФормы, ".");
		
		ПолноеИмяСправочника = ИмяФормывМассиве[0] + "." + ИмяФормывМассиве[1];
		
		ПараметрыФормы.Вставить("ПолноеИмяСправочника", ПолноеИмяСправочника);
		ПараметрыФормы.Вставить("ОтборСообщения", ПараметрКоманды);
		
	КонецЕсли;
	
	ОткрытьФорму("Обработка.гкс_УправлениеОбъектамиИнтеграции.Форма.ПовторноеПроигрываниеСообшений", ПараметрыФормы, 
	ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, 
	ПараметрыВыполненияКоманды.НавигационнаяСсылка);
		
КонецПроцедуры

#КонецОбласти
