#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьКомандыСоздатьМодель();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ИзменениеНастроекФорматаОбменаED");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура МодельДанныхПриИзменении(Элемент)
	УстановитьВидимостьКомандыСоздатьМодель();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьМодель(Команда)
	
	ОбратныйВызов = Новый ОписаниеОповещения("СформироватьМодельЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.гкс_ФормировательМоделиXDTO.Форма.Форма",
	             Неопределено,
	             ЭтотОбъект,
	             ЭтотОбъект.УникальныйИдентификатор,
	             Неопределено,
	             Неопределено,
	             ОбратныйВызов);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьКомандыСоздатьМодель()
	Элементы.СформироватьМодель.Видимость = НЕ ЗначениеЗаполнено(Запись.МодельДанных)
КонецПроцедуры

#Область ОбратныеВызовы

&НаКлиенте
Процедура СформироватьМодельЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТипМодельДанных = Новый ОписаниеТипов("СправочникСсылка.гкс_МоделиДанныхXDTO");
	Запись.МодельДанных = ТипМодельДанных.ПривестиЗначение(Результат);
	
	УстановитьВидимостьКомандыСоздатьМодель();

КонецПроцедуры 

#КонецОбласти

#КонецОбласти