
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияНастроек();
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	ЗаписатьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ЗаписатьНаСервере();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтрокуСоединения(Команда)
	
	СтрокаСоединенияУчастникаОбмена = СтрокаСоединенияУчастникаОбмена + СтрокаСоединенияИнформационнойБазы();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьЗначенияНастроек()
	
	НастройкиПодсистемы = гкс_ОчередьСообщенийRMQВызовСервера.ПолучитьНастройкиИнтеграционногоАдаптераВСтруктуре();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиПодсистемы);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	Набор = РегистрыСведений.гкс_НастройкиИнтеграционногоАдаптера.СоздатьНаборЗаписей();
	
	ЗаписьНабора = Набор.Добавить();
	ЗаполнитьЗначенияСвойств(ЗаписьНабора, ЭтотОбъект);
	
	Набор.Записать();
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
	
	ЗаполнитьЗначенияНастроек();	
	
КонецПроцедуры

#КонецОбласти
