
#Область ПрограммныйИнтерфейс

// Имя менеджера формирования по умолчанию.
// 
// Возвращаемое значение:
//  Строка - Имя модуля менеджера формирования по умолчанию
//
Функция ИмяМенеджераФормированияПоУмолчанию() Экспорт
	
	Возврат "Обработки.гкс_ФормировательСообщенийRMQСтандартнаяСериализация";
	
КонецФункции

// Имя менеджера обработки по умолчанию.
// 
// Возвращаемое значение:
//  Строка - Имя модуля менеджера обработки по умолчанию
//
Функция ИмяМенеджераОбработкиПоУмолчанию() Экспорт
	
	Возврат "Обработки.гкс_ЗагрузчикСообщенийRMQСтандартнаяСериализация";
	
КонецФункции

#КонецОбласти