
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализироватьРеквизитыФормы();
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийКомандФормы

&НаКлиенте
Процедура СформироватьСообщения(Команда)
	
	ПоказатьОповещениеПользователя(СтрШаблон(НСтр("ru='Всего объектов: %1'"), СписокОбъектов.Количество()));
	
	СформироватьСообщенияНаСервере();   
	Оповестить("ПовторноСформированныСообщенияПоОбъектамСобытий");
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьРеквизитыФормы()

	ЗаполнитьСписокОбъектов();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокОбъектов()
	
	Если НЕ Параметры.Свойство("ОбъектыСобытий") Тогда
		Возврат;
	КонецЕсли;
	
	СписокОбъектов.Очистить();
	Для Каждого ОбъектСобытия Из Параметры["ОбъектыСобытий"] Цикл 
		
		СтрокаСпискаОбъектов = СписокОбъектов.Добавить();
		СтрокаСпискаОбъектов.СсылкаНаОбъект = ОбъектСобытия;
		
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура СформироватьСообщенияНаСервере()
	РеквизитФормыВЗначение("Объект")
	    .СформироватьСообщенияПоОбъектамИОтправитьВОчередь(СписокОбъектов.Выгрузить().ВыгрузитьКолонку("СсылкаНаОбъект"));	
КонецПроцедуры

#КонецОбласти
