
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВесыАтоматическогоВзвешивания(НомерПроезда) Экспорт
	
	Результат = Справочники.гкс_ОборудованиеПЛК.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	гкс_ОборудованиеПЛК.Ссылка КАК ВесыСсылка
	|ИЗ
	|	Справочник.гкс_ОборудованиеПЛК КАК гкс_ОборудованиеПЛК
	|ГДЕ
	|	гкс_ОборудованиеПЛК.гкс_НомерПроезда = &гкс_НомерПроезда
	|	И гкс_ОборудованиеПЛК.ТипОборудования = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыПодключаемогоОборудования.ЭлектронныеВесы)
	|	И НЕ гкс_ОборудованиеПЛК.ПометкаУдаления
	|	И гкс_ОборудованиеПЛК.ИспользоватьАвтоматическоеВзвешивание";
	
	Запрос.УстановитьПараметр("гкс_НомерПроезда", НомерПроезда);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		Результат = ВыборкаДетальныеЗаписи.ВесыСсылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции	

#КонецОбласти

#КонецЕсли
