
#Область ОбработчикиСобытийФормы

// СтандартныеПодсистемы.ШаблоныСообщений

&НаКлиенте
Процедура ШаблонСообщенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораШаблона", ЭтотОбъект);
	
	Если Объект.Предопределенный Тогда 
		//ПредметШаблона = СтрШаблон("Справочник.гкс_ПодпискиНаРассылкиИОповещения.%1", Объект.ИмяПредопределенныхДанных);
		ПредметШаблона = Объект.ИмяПредопределенныхДанных;	
		ВладелецШаблона = Объект.Ссылка;
	Иначе     
		ПредметШаблона = Неопределено;
		ВладелецШаблона = Неопределено;
	КонецЕсли;
	
	ШаблоныСообщенийКлиент.ВыбратьШаблон(Оповещение, "Письмо", ПредметШаблона, ВладелецШаблона);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ШаблоныСообщений

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ШаблоныСообщений

&НаКлиенте
Процедура ПослеВыбораШаблона(Шаблон, ДополнительныеПараметры) Экспорт
	
	Если Шаблон <> Неопределено Тогда
		Объект.ШаблонЭлектронногоПисьма = Шаблон;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ШаблоныСообщений

#КонецОбласти