#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоПолноправныйПользователь = Пользователи.ЭтоПолноправныйПользователь();
	
	ЭтотОбъект.ТолькоПросмотр = Не ЭтоПолноправныйПользователь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаПоказатьНастройки(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("КлючОбъекта", 			Запись.КлючОбъекта);
	ПараметрыОткрытия.Вставить("КлючНастроек", 			Запись.КлючНастроек);
	ПараметрыОткрытия.Вставить("ЭтоПросмотрНастройки",	Истина);
	
	ОткрытьФорму("РегистрСведений.гкс_ХранилищеНастроек.Форма.НастройкаЭлементовФормы", ПараметрыОткрытия, 
		ЭтотОбъект, УникальныйИдентификатор, , , , 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти