#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроблемныеСтроки = Новый Массив;
	Счетчик = 1;
	Для Каждого ЗаписьРегистра Из ЭтотОбъект Цикл
		Если НЕ ЗначениеЗаполнено(ЗаписьРегистра.ОснованиеДвиженияЗапасов) Тогда
			ПроблемныеСтроки.Добавить(Счетчик);
		КонецЕсли;
		Счетчик = Счетчик + 1;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ПроблемныеСтроки) Тогда
		ТекстСтрок = ?(ПроблемныеСтроки.Количество() > 1, "строках", "строке");
		ТекстСообщения = НСтр("ru = 'Документ %1 не проводится: 
		|	в %2 %3 не заполнено значение ""Основание движения запасов"".'");
		ВызватьИсключение СтрШаблон(ТекстСообщения, 
			Отбор.Регистратор.Значение, ТекстСтрок, СтрСоединить(ПроблемныеСтроки, ", "));
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#КонецЕсли
