// @strict-types

#Область ПрограммныйИнтерфейс

#Область Проведение

// Формирует параметры для проведения документа по регистрам учетного механизма через общий механизм проведения.
//
// Параметры:
//  Документ - ДокументОбъект - записываемый документ
//  Свойства - ФиксированнаяСтруктура - свойства документа (См. гкс_ПроведениеДокументов.СвойстваДокумента).
//
// Возвращаемое значение:
//  Структура - параметры учетного механизма (См. гкс_ПроведениеДокументов.ПараметрыУчетногоМеханизма()).
//
Функция ПараметрыДляПроведенияДокумента(Документ, Свойства) Экспорт
	
	Параметры = гкс_ПроведениеДокументов.ПараметрыУчетногоМеханизма();
	
	// Проведение
	Если Свойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыСведений.гкс_ОчередьОтгрузкиПЛК);
		Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыСведений.гкс_ГрафикОтгрузкиПЛК);
		
	КонецЕсли;
	
	Параметры.НезависимыеРегистры.Добавить(Метаданные.РегистрыСведений.гкс_СтатусыЗаписейВОчередиПриемкиПЛК);
	Параметры.ЕстьПроизводныеДвижения = Истина;
	
	Возврат Параметры;
	
КонецФункции

// Процедура формирования движений по подчиненным регистрам.
//
// Параметры:
//   ТаблицыДляДвижений - Структура - таблицы данных документа
//   Движения - КоллекцияДвижений - коллекция наборов записей движений документа
//   Отказ - Булево - признак отказа от проведения документа.
//
Процедура ОтразитьДвижения(ТаблицыДляДвижений, Движения, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	гкс_ПроведениеДокументов.ОтразитьДвижения(ТаблицыДляДвижений, Движения, "гкс_ОчередьОтгрузкиПЛК");
	гкс_ПроведениеДокументов.ОтразитьДвижения(ТаблицыДляДвижений, Движения, "гкс_ГрафикОтгрузкиПЛК");
	
КонецПроцедуры

Процедура ПередЗаписьюДвиженийДокумента(Документ, МенеджерВременныхТаблиц, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеЗаписиДвиженийДокумента(Документ, МенеджерВременныхТаблиц, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ТипЗнчДокумента = ТипЗнч(Документ);	
 								 
	ЭтоОтменаПроведенияДокумента = Документ.ДополнительныеСвойства.ПроведениеДокументов.
		СвойстваДокумента.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения;								 
	
	Если ЭтоОтменаПроведенияДокумента 
		 И ТипЗнчДокумента = Тип("ДокументОбъект.гкс_ЗаписьВОчередьОтгрузкиПЛК") Тогда
		 
		 ОписаниеЗаписи = Новый Структура("ЗаписьВОчередь", Документ.Ссылка);
		 РегистрыСведений.гкс_СтатусыЗаписейВОчередиПриемкиПЛК.УдалитьЗапись(ОписаниеЗаписи);	 
	
	КонецЕсли;
	 
КонецПроцедуры

// Процедура формирования движений по независимым регистрам основных средств.
//
// Параметры:
//	ТаблицыДляДвижений - Структура - таблицы данных документа
//	Документ - ДокументСсылка - ссылка на документ
//	Отказ - Булево - признак отказа от проведения документа.
//
Процедура ЗаписатьДанные(ТаблицыДляДвижений, Документ, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ТаблицыДляДвижений.Свойство("Таблицагкс_СтатусыЗаписейВОчередиПриемкиПЛК") Тогда
		
		Набор = РегистрыСведений.гкс_СтатусыЗаписейВОчередиПриемкиПЛК.СоздатьНаборЗаписей();
		Набор.Отбор.ЗаписьВОчередь.Установить(Документ.Ссылка);
		Набор.Загрузить(ТаблицыДляДвижений["Таблицагкс_СтатусыЗаписейВОчередиПриемкиПЛК"]);
		Набор.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#КонецОбласти
