#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// Параметры:
//   Настройки - см. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.Настройки.
//   НастройкиОтчета - см. ВариантыОтчетов.ОписаниеОтчета.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт

	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ЗПП_28");
	НастройкиВарианта.Наименование = НСтр("ru = 'Журнал взвешивания автомобилей (ЗПП-28)'");
	НастройкиВарианта.Описание = НСтр("ru = 'Отраслевая форма № ЗПП-28.
		|Журнал регистрации взвешивания грузов на автомобильных весах.'");
	
	НастройкиВарианта.ВидимостьПоУмолчанию = Истина;
	
	//НастройкиВарианта.Размещение.Вставить(Метаданные.Подсистемы.гкс_ПриемкаТранспорта.Подсистемы.Аналитика, "СмТакже");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ЗПП_29");
	НастройкиВарианта.Наименование = НСтр("ru = 'Журнал взвешивания ЖД (ЗПП-29)'");
	НастройкиВарианта.Описание = 
		НСтр("ru = 'Отраслевая форма № ЗПП-29. 
		|Журнал регистрации взвешивания на вагонных весах поступающих и отправляемых грузов.'");
	
	НастройкиВарианта.ВидимостьПоУмолчанию = Истина;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти

#КонецЕсли