#Область ОбработчикиСобытийКомандФормы

&НаКлиенте
Процедура ТекущееПриложение(Команда)
	
	Участник = Элементы.Список.ТекущаяСтрока;
	
	Если НЕ Участник = Неопределено Тогда
		
		ТекущееПриложениеНаСервере(Участник);
		Элементы.Список.Обновить();
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ТекущееПриложениеНаСервере(Участник)
	
	ОбъектУчастник = Участник.ПолучитьОбъект();
	
	Попытка 
		
		ОбъектУчастник.ЭтаБаза = НЕ ОбъектУчастник.ЭтаБаза;
		Если ОбъектУчастник.ПроверитьЗаполнение() Тогда
			
			ОбъектУчастник.Записать();
			
		КонецЕсли;
		
	Исключение
		
		ПредставлениеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ВызватьИсключение ПредставлениеОшибки;
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

