#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область Проведение

// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	
	МеханизмыДокумента.Добавить("РегистрацияВнешнихПроб");
	
КонецПроцедуры

// Возвращает таблицы для движений, необходимые для проведения документа по регистрам учетных механизмов.
//
// Параметры:
//  Документ - ДокументСсылка - ссылка на документ, по которому необходимо получить данные
//  Регистры - Структура - список имен регистров, для которых необходимо получить таблицы
//  ДопПараметры - Структура - дополнительные параметры для получения данных, определяющие контекст проведения.
//
// Возвращаемое значение:
//  Структура - коллекция элементов:
//     * Таблица<ИмяРегистра> - ТаблицаЗначений - таблица данных для отражения в регистр.
//
Функция ДанныеДокументаДляПроведения(Документ, Регистры, ДопПараметры = Неопределено) Экспорт
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = гкс_ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ТекстыЗапроса = Новый СписокЗначений;
	
	Если Не ДопПараметры.ПолучитьТекстыЗапроса Тогда
		// Создадим запрос инициализации движений		
		ЗаполнитьПараметрыИнициализации(Запрос, Документ, ДопПараметры);
		// Сформируем текст запроса
		
		ТекстЗапросаТаблицаВнешниеПробы(ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаВнешниеПробыПоЗаявкамНаПеревозку(ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаКонтрольЗаполненияВнешнихПроб(ТекстыЗапроса, Регистры);
		
	КонецЕсли;
	
	// Получим таблицы для движений
	Возврат гкс_ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения(Запрос, ТекстыЗапроса, ДопПараметры);
	
КонецФункции

#КонецОбласти

// Выполняет пакет запросов к сервису Warehouse для обновления данных внешних проб.
//
// Параметры:
//   ДокументыВнешнейПробы - Массив из ДокументСсылка.гкс_ВнешняяПроба - массив ссылок для обновления
//
Процедура ОбновитьДаннымиИзWarehouse(ДокументыВнешнейПробы) Экспорт
	
	Для Каждого ДокументВнешнейПробы Из ДокументыВнешнейПробы Цикл
		
		ПараметрыЗапроса = Новый Структура;
		ПараметрыЗапроса.Вставить("Ссылка", ДокументВнешнейПробы);
		
		ВыполнитьЗапросКWarehouse("ExternalSamples_GetById", ПараметрыЗапроса);
		
	КонецЦикла;	
	
КонецПроцедуры

// Выполняет запрос к сервису Warehouse для загрузки данных за период.
//
// Параметры:
//	ИмяМетода - Строка -  Имя метода Warehouse для получения данных по пробам 
// 	ПериодЗагрузки - Структура
//		*ДатаНачала		- Дата - дата начало периода внесения изменений
//      *ДатаОкончания  - Дата - дата окончания периода внесения изменений
//
Процедура ЗагрузитьВнешниеПробыЗаПериод(ИмяМетода, ПериодЗагрузки = Неопределено) Экспорт
	
	Если ПериодЗагрузки = Неопределено Тогда
		
		ДатаЗагрузки = ТекущаяУниверсальнаяДата();

		ПериодЗагрузки = Новый Структура;
		ПериодЗагрузки.Вставить("ДатаНачала",  НачалоДня(ДатаЗагрузки));
		ПериодЗагрузки.Вставить("ДатаОкончания",  КонецДня(ДатаЗагрузки));
	КонецЕсли;
	
	ДатаОбработки = ПериодЗагрузки.ДатаНачала;
	Пока ДатаОбработки <= ПериодЗагрузки.ДатаОкончания Цикл
		
		ПараметрыВЗапрос = Новый Структура;
		ПараметрыВЗапрос.Вставить("dateFrom", ЗаписатьДатуJSON(НачалоДня(ДатаОбработки), 
			ФорматДатыJSON.ISO, ВариантЗаписиДатыJSON.ЛокальнаяДата));
		
		ПараметрыВЗапрос.Вставить("dateTo", ЗаписатьДатуJSON(КонецДня(ДатаОбработки),
			ФорматДатыJSON.ISO, ВариантЗаписиДатыJSON.ЛокальнаяДата));
		
		ПараметрыЗапроса = Новый Структура("params", ПараметрыВЗапрос);	
		
		ВыполнитьЗапросКWarehouse(ИмяМетода, ПараметрыЗапроса);
		
		ДатаОбработки = ДатаОбработки + гкс_ОбщегоНазначенияКлиентСервер.ЧислоСекундВСутках();
	КонецЦикла;	
					
КонецПроцедуры

// Выполняет запрос к сервису Warehouse для указанного типа операции и обрабатывает полученный ответ.
//
// Параметры:
//   ТипЗапроса - Строка- тип выполняемого запроса
//   ПараметрыЗапроса - Структура - параметры для формирования запроса
//
Процедура ВыполнитьЗапросКWarehouse(ТипЗапроса, ПараметрыЗапроса) Экспорт
	
	РесурсыСервисов = Справочники.гкс_РесурсыВебСервисов;
	РесурсВебСервиса = РесурсыСервисов.ОписаниеПоИмениПредопределенного(ТипЗапроса);
	
	Если Не ЗначениеЗаполнено(РесурсВебСервиса) Тогда
		Возврат;
	КонецЕсли;	
	
	Если РесурсВебСервиса = РесурсыСервисов.ExternalSamples_GetById Тогда	
		ПараметрыЗапроса.Вставить(ИмяКлючевогоСвойстваВWarehouse(), 
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыЗапроса.Ссылка, ИмяКлючевогоСвойства()));		
	КонецЕсли;
	
	ИменаСвойствСоЗначениямиДата = гкс_ОбменДаннымиWarehouse.ИменаСвойствСоЗначениямиДата();
	ИменаСвойствДляОбработкиВосстановления = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(
		ИменаСвойствСоЗначениямиДата, ",");
	
	ПараметрыПреобразованияJSON = Новый Структура;
	ПараметрыПреобразованияJSON.Вставить("ПрочитатьВСоответствие", Ложь);
	ПараметрыПреобразованияJSON.Вставить("ИмяФункцииВосстановления", "ДесериализацияСвойствВнешнихПроб");
	ПараметрыПреобразованияJSON.Вставить("МодульФункцииВосстановления", 
										ОбщегоНазначения.ОбщийМодуль("гкс_ОбменДаннымиWarehouse"));
	ПараметрыПреобразованияJSON.Вставить("ИменаСвойствДляОбработкиВосстановления",
										ИменаСвойствДляОбработкиВосстановления);
	
	ДанныеОтвета = гкс_ИнтеграцияWarehouse.ВыполнитьЗапросКWarehouse(
		РесурсВебСервиса, ПараметрыЗапроса, ПараметрыПреобразованияJSON);
		
	Если ТипЗнч(ДанныеОтвета) = Тип("Массив") Тогда
		Для Каждого ДанныеОтветаВСтруктуре Из ДанныеОтвета Цикл
			ДокументСсылка = ПустаяСсылка();	
			гкс_ОбменДаннымиWarehouse.ОбработатьПолученныеДанные(ДанныеОтветаВСтруктуре, ДокументСсылка);	
		КонецЦикла;	
	Иначе
		ДанныеОтветаВСтруктуре = ДанныеОтвета;
		ДокументСсылка = ПустаяСсылка();	
		гкс_ОбменДаннымиWarehouse.ОбработатьПолученныеДанные(ДанныеОтветаВСтруктуре, ДокументСсылка);	
	КонецЕсли;
	
КонецПроцедуры	

// Обновляет или создает документ "Внешняя проба" на основании данных из системы Warehouse. 
// Записывает документ при изменении контрольной суммы.
//
// Параметры:
//   ДанныеИсточника - Массив из Структура - Массив структур с данными пробы из Warehouse. 
//   Первая структура содержит основные данные, остальные — показатели качества.
//	
Процедура ОбновитьПоДаннымWarehouse(ДанныеИсточника) Экспорт
	
	МенеджерСоотвествияОбъектов = РегистрыСведений.гкс_СоответствиеОбъектовWarehouse;
	
	ПерваяСтрокаДанных = ДанныеИсточника[0];
	ДокументВнешнейПробы = ПолучитьСсылкуПоИдентификатору(ПерваяСтрокаДанных.ИДПробы);
	
	Если Не ЗначениеЗаполнено(ДокументВнешнейПробы) Тогда
		ВнешняяПроба = Документы.гкс_ВнешняяПроба.СоздатьДокумент();
	Иначе
		ВнешняяПроба = ДокументВнешнейПробы.ПолучитьОбъект(); 
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ВнешняяПроба, ПерваяСтрокаДанных);
	ВнешняяПроба.Дата = ПерваяСтрокаДанных.ДатаПробы;
	ВнешняяПроба.НоменклатураWarehouse = ПерваяСтрокаДанных.Продукция;
	ВнешняяПроба.Номенклатура = МенеджерСоотвествияОбъектов.
								СсылкаОбъектаПоСсылкеWarehouse(ПерваяСтрокаДанных.Продукция);
	
	ВнешняяПроба.КачественныеПоказатели.Очистить();
	
	Для Каждого ДанныеСтроки Из ДанныеИсточника Цикл
		НоваяСтрока = ВнешняяПроба.КачественныеПоказатели.Добавить();
		НоваяСтрока.ВидПробы = ДанныеСтроки.ВидПробы;
		НоваяСтрока.ПоказательВнешний = ДанныеСтроки.Показатель;
		НоваяСтрока.Показатель = МенеджерСоотвествияОбъектов.
								СсылкаОбъектаПоСсылкеWarehouse(ДанныеСтроки.Показатель);
								
		НоваяСтрока.Значение = ДанныеСтроки.ЗначениеПоказателя;
	КонецЦикла;
	
	КонтрольнаяСуммаДокументаНовая = ВнешняяПроба.КонтрольнаяСуммаДокумента();
	
	// записываем только если есть изменения ключевых данных
	Если ВнешняяПроба.КонтрольнаяСумма = КонтрольнаяСуммаДокументаНовая Тогда
		Возврат;
	КонецЕсли;	
	
	Попытка
		ВнешняяПроба.Записать(РежимЗаписиДокумента.Проведение);
	Исключение			
		ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Интеграция Warehouse.Формирование документов ""Внешняя проба""'"),
			УровеньЖурналаРегистрации.Ошибка, , ,
			ПодробноеПредставлениеОшибки);			
	КонецПопытки;	
	
КонецПроцедуры

// Возвращает ссылку на документ по идентификатору
//
// Параметры:
//  Идентификатор - Строка - идентификатор Warehouse.
// 
// Возвращаемое значение:
//  ДокументСсылка.гкс_ВнешняяПроба - ссылка на документ.
//
Функция ПолучитьСсылкуПоИдентификатору(Идентификатор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВнешняяПроба.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.гкс_ВнешняяПроба КАК ВнешняяПроба
	|ГДЕ
	|	ВнешняяПроба.ИДПробы = &Идентификатор";
	
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);	
	РезультатЗапроса = Запрос.Выполнить();	
		
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат = Выборка.Ссылка;
	Иначе	
		Результат = ПустаяСсылка();
	КонецЕсли;
	
	Возврат Результат;
		
КонецФункции

// Вычисляет контрольную сумму по алгоритму MD5.
//
// Параметры:
//  КонтролируемыеДанные - Структура
// 
// Возвращаемое значение:
//  Строка - контрольная сумма строкой без пробелов (например 32 символа).
//
Функция КонтрольнаяСумма(КонтролируемыеДанные) Экспорт
	
	Возврат ОбщегоНазначения.КонтрольнаяСуммаСтрокой(КонтролируемыеДанные);
	
КонецФункции

#Область КонвертацияПриОбмене

// Возвращает имя ключевого реквизита объекта.
//
// Возвращаемое значение:
//   Строка
//
Функция ИмяКлючевогоСвойства() Экспорт
	
	Возврат "ИДПробы";
	
КонецФункции

// Возвращает имя ключевого поля в Warehouse.
//
// Возвращаемое значение:
//   Строка
//
Функция ИмяКлючевогоСвойстваВWarehouse() Экспорт
	
	Возврат "id";
	
КонецФункции

// Возвращает правила конвертации свойств документа для интеграции с системой Warehouse
//
// Возвращаемое значение:
//   ТаблицаЗначений:
//
Функция ИнициализацияПравилКонвертацийСвойств() Экспорт
	
	ПравилаКонвертации = гкс_ОбменДаннымиWarehouse.ИнициализацияПравилКонвертацийСвойств();

	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "ИДПробы", 			"id");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "ИДКомпозитнойПробы", "groupId");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "Дата", 				"date");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "ДатаПогрузки", 		"loadDate");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "ДатаИзменения", 		"updatedOn");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "ПометкаУдаления", 	"isDeleted");
	
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "ОрганизацияWarehouse", 		
															"client", 1, "ПКС_ОрганизацияWarehouse");
	
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "НоменклатураWarehouse", 
															"goodId", 1, "ПКС_НоменклатураWarehouse");
	
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "НомерТС", "transport");
	
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "ТранспортноеСредство", 
															"transport", 1, "ПКС_ТранспортноеСредство");
	
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "СтанцияОтправленияWarehouse", 
															"stationId", 1, "ПКС_СтанцияОтправленияWarehouse");
	
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "СтанцияНазначенияWarehouse", 
															"stationDestId", 1, "ПКС_СтанцияНазначенияWarehouse");
	
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "НомерЗаявки", "orderNumber", 1, "ПКС_НомерЗаявки");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "НомерДокумента", 	"refId");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "Комментарий", 		"commentary");
	
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "СюрвейерWarehouse", 			
															"contractor", 1, "ПКС_СюрвейерWarehouse");
	
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "ЭлеваторWarehouse", 			
															"elevator", 1, "ПКС_ЭлеваторWarehouse");
	
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "МестоИнспекции", 	"inspectionPlace");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "ПриоритетныйВидПробы", "priorityExSampleTypeName");

	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "ВесБрутто", 	"weightGross");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "ВесТары", 	"weightTare");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "ВесНетто", 	"weightNet");

	// правила для табличной части "КачественныеПоказатели"
	ПравилаКонвертацииТЧКачественныеПоказатели = гкс_ОбменДаннымиWarehouse.ИнициализацияПравилКонвертацийСвойств();

	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертацииТЧКачественныеПоказатели, 
		"ТипВнешнейПробы", "externalSampleType", 1, "ПКС_ТипВнешнейПробы");
	
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертацииТЧКачественныеПоказатели, 
		"ПоказательВнешний", "qualityIndicatorId", 1, "ПКС_ПоказательКачестваWarehouse");

	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертацииТЧКачественныеПоказатели, "Значение", "value");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертацииТЧКачественныеПоказатели, "Комментарий", "commentary"); 
	
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, 
	 	"КачественныеПоказатели", "externalSampleTestResults", , ПравилаКонвертацииТЧКачественныеПоказатели, Истина);
	
	Возврат ПравилаКонвертации; 
	
КонецФункции

#КонецОбласти

#КонецОбласти
	
#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка, ДопПараметры)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
		
КонецПроцедуры

Процедура ТекстЗапросаТаблицаВнешниеПробы(ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "гкс_ВнешниеПробы";
	
	Если Не гкс_ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли; 
		
	ТекстЗапроса = 	
		"ВЫБРАТЬ
		|	ВнешняяПроба.Дата КАК Период,
		|	ВнешняяПроба.Ссылка КАК Регистратор,
		|	ВнешняяПробаКачественныеПоказатели.ВидПробы КАК ВидПробы,
		|	ВнешняяПроба.ДатаИзменения КАК ДатаИзменения,
		|	ВнешняяПроба.ДатаПогрузки КАК ДатаПогрузки,
		|	ВнешняяПроба.Дата КАК ДатаПробы,
		|	ВнешняяПроба.ИДКомпозитнойПробы КАК ИДКомпозитнойПробы,
		|	ВнешняяПроба.ИДПробы КАК ИДПробы,
		|	ВнешняяПроба.МестоИнспекции КАК МестоИнспекции,
		|	ВнешняяПроба.НомерДокумента КАК НомерДокумента,
		|	ВнешняяПроба.НомерЗаявки КАК НомерЗаявки,
		|	ВнешняяПроба.НомерТС КАК НомерТС,
		|	ВнешняяПроба.Организация КАК Организация,
		|	ВнешняяПробаКачественныеПоказатели.ПоказательВнешний КАК Показатель,
		|	ВнешняяПроба.НоменклатураWarehouse КАК Продукция,
		|	ВнешняяПроба.СтанцияНазначения КАК СтанцияНазначения,
		|	ВнешняяПроба.СтанцияОтправления КАК СтанцияОтправления,
		|	ВнешняяПроба.Сюрвейер КАК Сюрвейер,
		|	ВнешняяПроба.Элеватор КАК Элеватор,
		|	ВнешняяПроба.ТранспортноеСредство КАК ТранспортноеСредство,
		|	ВнешняяПроба.ВесБрутто КАК ВесБрутто,
		|	ВнешняяПроба.ВесТары КАК ВесТары,
		|	ВнешняяПроба.ВесНетто КАК ВесНетто,
		|	ВнешняяПробаКачественныеПоказатели.Значение КАК ЗначениеПоказателя,
		|	ВнешняяПробаКачественныеПоказатели.Комментарий КАК Комментарий
		|ИЗ
		|	Документ.гкс_ВнешняяПроба КАК ВнешняяПроба
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ВнешняяПроба.КачественныеПоказатели КАК ВнешняяПробаКачественныеПоказатели
		|		ПО (ВнешняяПробаКачественныеПоказатели.Ссылка = ВнешняяПроба.Ссылка)
		|ГДЕ
		|	ВнешняяПроба.Ссылка = &Ссылка
		|	И ВнешняяПроба.Проведен
		|	И ВнешняяПробаКачественныеПоказатели.Значение <> 0";	
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
		
КонецПроцедуры

Процедура ТекстЗапросаТаблицаВнешниеПробыПоЗаявкамНаПеревозку(ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "гкс_ВнешниеПробыПоЗаявкамНаПеревозку";
	
	Если Не гкс_ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли; 
		
	ТекстЗапроса = 	
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВнешняяПроба.Ссылка КАК Регистратор,
		|	ВнешняяПроба.Ссылка КАК ВнешняяПроба,
		|	ВнешняяПроба.ВидПеревозки КАК ВидПеревозки,
		|	ВнешняяПроба.Номенклатура КАК Номенклатура,
		|	ВнешняяПроба.ТранспортноеСредство КАК ТранспортноеСредство,
		|	ВнешняяПроба.НомерТС КАК НомерТС,
		|	ВнешняяПроба.ДатаПогрузки КАК ДатаПогрузки,
		|	ВнешняяПроба.СтанцияОтправления КАК СтанцияОтправления,
		|	ВнешняяПроба.Сюрвейер КАК Сюрвейер,
		|	ВнешняяПробаЗаявкиНаПеревозку.НомерЗаявки КАК НомерЗаявки,
		|	ВнешняяПроба.ВесБрутто КАК ВесБрутто,
		|	ВнешняяПроба.ВесНетто КАК ВесНетто,
		|	ВнешняяПроба.ВесТары КАК ВесТары,
		|	ВнешняяПроба.НомерЗерновоза КАК НомерЗерновоза,
		|	ВнешняяПроба.НомерПрицепа КАК НомерПрицепа,
		|	КачественныеПоказателиАнализа.Показатель КАК Показатель,
		|	КачественныеПоказателиАнализа.Значение КАК ЗначениеПоказателя,
		|	КачественныеПоказателиАнализа.ВидПробы КАК НазначениеИспользованияКачества
		|ИЗ
		|	Документ.гкс_ВнешняяПроба КАК ВнешняяПроба
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ВнешняяПроба.ЗаявкиНаПеревозку КАК ВнешняяПробаЗаявкиНаПеревозку
		|		ПО (ВнешняяПробаЗаявкиНаПеревозку.Ссылка = ВнешняяПроба.Ссылка)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ВнешняяПроба.КачественныеПоказатели КАК КачественныеПоказателиАнализа
		|		ПО (КачественныеПоказателиАнализа.Ссылка = ВнешняяПроба.Ссылка)
		|			И (КачественныеПоказателиАнализа.Показатель <> ЗНАЧЕНИЕ(Справочник.гкс_ПоказателиАнализовНоменклатуры.ПустаяСсылка))
		|			И (КачественныеПоказателиАнализа.Значение <> 0)
		|ГДЕ
		|	ВнешняяПроба.Ссылка = &Ссылка
		|	И ВнешняяПроба.Проведен";	
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
		
КонецПроцедуры
 
Процедура ТекстЗапросаТаблицаКонтрольЗаполненияВнешнихПроб(ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "гкс_КонтрольЗаполненияВнешнихПроб";
	
	Если Не гкс_ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли; 
		
	ТекстЗапроса = 	
		"ВЫБРАТЬ
		|	ВнешняяПроба.Ссылка КАК ВнешняяПроба,
		|	ВЫБОР
		|		КОГДА НЕ ВнешняяПроба.ОрганизацияWarehouse = ЗНАЧЕНИЕ(Справочник.гкс_КонтрагентыWarehouse.ПустаяСсылка)
		|				И ВнешняяПроба.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК СопоставитьОрганизацию,
		|	ВнешняяПроба.ОрганизацияWarehouse КАК ОрганизацияWarehouse,
		|	ВЫБОР
		|		КОГДА ВнешняяПроба.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК СопоставитьНоменклатуру,
		|	ВнешняяПроба.НоменклатураWarehouse КАК НоменклатураWarehouse,
		|	ВЫБОР
		|		КОГДА НЕ ВнешняяПроба.СюрвейерWarehouse = ЗНАЧЕНИЕ(Справочник.гкс_КонтрагентыWarehouse.ПустаяСсылка)
		|				И ВнешняяПроба.Сюрвейер = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК СопоставитьСюрвейер,
		|	ВнешняяПроба.СюрвейерWarehouse КАК СюрвейерWarehouse,
		|	ВЫБОР
		|		КОГДА НЕ ВнешняяПроба.ЭлеваторWarehouse = ЗНАЧЕНИЕ(Справочник.гкс_КонтрагентыWarehouse.ПустаяСсылка)
		|				И ВнешняяПроба.Элеватор = ЗНАЧЕНИЕ(Справочник.гкс_ТочкиМаршрута.ПустаяСсылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК СопоставитьЭлеватор,
		|	ВнешняяПроба.ЭлеваторWarehouse КАК ЭлеваторWarehouse,
		|	ВЫБОР
		|		КОГДА НЕ ВнешняяПроба.СтанцияОтправленияWarehouse = ЗНАЧЕНИЕ(Справочник.гкс_СтанцииWarehouse.ПустаяСсылка)
		|				И ВнешняяПроба.СтанцияОтправления = ЗНАЧЕНИЕ(Справочник.гкс_КлассификаторСтанцийЖД.ПустаяСсылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК СопоставитьСтанциюОтправления,
		|	ВЫБОР
		|		КОГДА НЕ ВнешняяПроба.СтанцияНазначенияWarehouse = ЗНАЧЕНИЕ(Справочник.гкс_СтанцииWarehouse.ПустаяСсылка)
		|				И ВнешняяПроба.СтанцияНазначения = ЗНАЧЕНИЕ(Справочник.гкс_КлассификаторСтанцийЖД.ПустаяСсылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК СопоставитьСтанциюНазначения,
		|	ВнешняяПроба.СтанцияОтправленияWarehouse КАК СтанцияОтправленияWarehouse,
		|	ВнешняяПроба.СтанцияНазначенияWarehouse КАК СтанцияНазначенияWarehouse
		|ПОМЕСТИТЬ ВТ_ДанныеПроверки
		|ИЗ
		|	Документ.гкс_ВнешняяПроба КАК ВнешняяПроба
		|ГДЕ
		|	ВнешняяПроба.Ссылка = &Ссылка
		|	И ВнешняяПроба.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеПроверки.ВнешняяПроба КАК Регистратор,
		|	ВТ_ДанныеПроверки.ВнешняяПроба КАК ВнешняяПроба,
		|	ВТ_ДанныеПроверки.ОрганизацияWarehouse КАК ОбъектWarehouse,
		|	ЗНАЧЕНИЕ(Перечисление.гкс_ТипыОбъектовWarehouse.Организация) КАК ТипОбъекта
		|ИЗ
		|	ВТ_ДанныеПроверки КАК ВТ_ДанныеПроверки
		|ГДЕ
		|	ВТ_ДанныеПроверки.СопоставитьОрганизацию
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ДанныеПроверки.ВнешняяПроба,
		|	ВТ_ДанныеПроверки.ВнешняяПроба,
		|	ВТ_ДанныеПроверки.НоменклатураWarehouse,
		|	ЗНАЧЕНИЕ(Перечисление.гкс_ТипыОбъектовWarehouse.Номенклатура)
		|ИЗ
		|	ВТ_ДанныеПроверки КАК ВТ_ДанныеПроверки
		|ГДЕ
		|	ВТ_ДанныеПроверки.СопоставитьНоменклатуру
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ДанныеПроверки.ВнешняяПроба,
		|	ВТ_ДанныеПроверки.ВнешняяПроба,
		|	ВТ_ДанныеПроверки.СюрвейерWarehouse,
		|	ЗНАЧЕНИЕ(Перечисление.гкс_ТипыОбъектовWarehouse.Сюрвейер)
		|ИЗ
		|	ВТ_ДанныеПроверки КАК ВТ_ДанныеПроверки
		|ГДЕ
		|	ВТ_ДанныеПроверки.СопоставитьСюрвейер
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ДанныеПроверки.ВнешняяПроба,
		|	ВТ_ДанныеПроверки.ВнешняяПроба,
		|	ВТ_ДанныеПроверки.ЭлеваторWarehouse,
		|	ЗНАЧЕНИЕ(Перечисление.гкс_ТипыОбъектовWarehouse.Элеватор)
		|ИЗ
		|	ВТ_ДанныеПроверки КАК ВТ_ДанныеПроверки
		|ГДЕ
		|	ВТ_ДанныеПроверки.СопоставитьЭлеватор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ДанныеПроверки.ВнешняяПроба,
		|	ВТ_ДанныеПроверки.ВнешняяПроба,
		|	ВТ_ДанныеПроверки.СтанцияОтправленияWarehouse,
		|	ЗНАЧЕНИЕ(Перечисление.гкс_ТипыОбъектовWarehouse.Станция)
		|ИЗ
		|	ВТ_ДанныеПроверки КАК ВТ_ДанныеПроверки
		|ГДЕ
		|	ВТ_ДанныеПроверки.СопоставитьСтанциюОтправления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ДанныеПроверки.ВнешняяПроба,
		|	ВТ_ДанныеПроверки.ВнешняяПроба,
		|	ВТ_ДанныеПроверки.СтанцияНазначенияWarehouse,
		|	ЗНАЧЕНИЕ(Перечисление.гкс_ТипыОбъектовWarehouse.Станция)
		|ИЗ
		|	ВТ_ДанныеПроверки КАК ВТ_ДанныеПроверки
		|ГДЕ
		|	ВТ_ДанныеПроверки.СопоставитьСтанциюНазначения"; 
		
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
		
КонецПроцедуры		

#КонецОбласти

#КонецОбласти
	
#КонецЕсли
