#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Вычисляет контрольную сумму документа для защиты от несанкционированных изменений
//
// Возвращаемое значение:
//   Строка - контрольная сумма документа
//
Функция КонтрольнаяСуммаДокумента() Экспорт
	
	КонтролируемыеДанные = Новый Структура;
	КонтролируемыеДанные.Вставить("Дата", 			Дата);
	КонтролируемыеДанные.Вставить("ДатаПогрузки", 	ДатаПогрузки);
	КонтролируемыеДанные.Вставить("ДатаИзменения", 	ДатаИзменения);
	
	КонтролируемыеДанные.Вставить("Номенклатура", 	ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
								НоменклатураWarehouse, "ИдентификаторWarehouse"));
								
    КонтролируемыеДанные.Вставить("НомерТС", 		НомерТС);
	КонтролируемыеДанные.Вставить("ИДКомпозитнойПробы", ИДКомпозитнойПробы);
	КонтролируемыеДанные.Вставить("ИДПробы", 			ИДПробы);
	КонтролируемыеДанные.Вставить("НомерЗаявки", 		НомерЗаявки);
	КонтролируемыеДанные.Вставить("НомерДокумента", 	НомерДокумента);
	
	ТабЧастьПоказатели = КачественныеПоказатели.Выгрузить(, "ВидПробы, ПоказательВнешний, Значение");
	КонтролируемыеДанные.Вставить("КачественныеПоказатели", 
									ОбщегоНазначения.ТаблицаЗначенийВМассив(ТабЧастьПоказатели));
									
	Возврат Документы.гкс_ВнешняяПроба.КонтрольнаяСумма(КонтролируемыеДанные);								
	
КонецФункции
	
#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	КонтрольнаяСумма = КонтрольнаяСуммаДокумента();	
	ЗаполнитьНомераПоискаАвтотранспорта();
	НормализоватьВес();
		
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	гкс_ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
				
	гкс_ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	гкс_ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	КонтрольнаяСумма = "";
	
КонецПроцедуры
	
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область СообщенияWarehouse

// Правило конвертации в реквизит
// 
// Параметры:
//  ПравилоКонвертации - СтрокаТаблицыЗначений - Правило конвертации
//  ПолученныеДанные - Структура - данные полученные из Warehouse
//  ДанныеЗаполнения - Структура -  Данные заполнения
//
Процедура ПКС_ТранспортноеСредство(ПравилоКонвертации, ПолученныеДанные, ДанныеЗаполнения) Экспорт
	
	Перем ПолученноеЗначение;
	
	Если ПолученныеДанные.Свойство(ПравилоКонвертации.СвойствоИсточника, ПолученноеЗначение) Тогда
		
		ДанныеЗаполнения.Вставить("ВидПеревозки", гкс_ОбменДаннымиWarehouse.ВидПеревозки(ПолученноеЗначение));	
		ЗначениеЗаполнения = гкс_ОбменДаннымиWarehouse.ТранспортноеСредствоПоНомерИзWarehouse(ПолученноеЗначение);			
		ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, ЗначениеЗаполнения);
					
	КонецЕсли;	
	
КонецПроцедуры

// Правило конвертации в реквизит
// 
// Параметры:
//  ПравилоКонвертации - СтрокаТаблицыЗначений - Правило конвертации
//  ПолученныеДанные - Структура - данные полученные из Warehouse
//  ДанныеЗаполнения - Структура -  Данные заполнения
//
Процедура ПКС_НомерЗаявки(ПравилоКонвертации, ПолученныеДанные, ДанныеЗаполнения) Экспорт
	
	Перем ПолученноеЗначение;
	
	Если ПолученныеДанные.Свойство(ПравилоКонвертации.СвойствоИсточника, ПолученноеЗначение) Тогда
		
		ЗаявкиНаПеревозку.Очистить();
		ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, ПолученноеЗначение);
			
		НомераЗаявок = гкс_ОбменДаннымиWarehouse.НомераЗаявокНаПеревозкуВМассив(ПолученноеЗначение);
		Для Каждого ЗаявкаНомер Из НомераЗаявок Цикл
			НоваяСтрока = ЗаявкиНаПеревозку.Добавить();
			НоваяСтрока.НомерЗаявки = ЗаявкаНомер;
		КонецЦикла;
		
		ДанныеЗаполнения.Вставить("КоличествоЗаявок", НомераЗаявок.Количество());

	КонецЕсли;	
	
КонецПроцедуры

// Правило конвертации в реквизит
// 
// Параметры:
//  ПравилоКонвертации - СтрокаТаблицыЗначений - Правило конвертации
//  ПолученныеДанные - Структура - данные полученные из Warehouse
//  ДанныеЗаполнения - Структура -  Данные заполнения
//
Процедура ПКС_СтанцияОтправленияWarehouse(ПравилоКонвертации, ПолученныеДанные, ДанныеЗаполнения) Экспорт
	
	Перем ПолученноеЗначение;
	
	ЗначениеЗаполнения = Справочники.гкс_КлассификаторСтанцийЖД.ПустаяСсылка();
	
	Если ДанныеЗаполнения.Свойство("ВидПеревозки")
		И ДанныеЗаполнения.ВидПеревозки = Перечисления.гкс_ТипыТранспортныхСредствДоставки.ЖДТранспорт 
		И ПолученныеДанные.Свойство(ПравилоКонвертации.СвойствоИсточника, ПолученноеЗначение) Тогда
		
		СтанцииWarehouseМенеджер = Справочники.гкс_СтанцииWarehouse;
		ЗначениеЗаполнения = СтанцииWarehouseМенеджер.СтанцияWarehouseПоИдентификатору(ПолученноеЗначение);
		
		ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, ЗначениеЗаполнения);
		ДанныеЗаполнения.Вставить("СтанцияОтправления", СтанцииWarehouseМенеджер.СтанцияКлассификатор(ЗначениеЗаполнения));
	КонецЕсли;
		
КонецПроцедуры

// Правило конвертации в реквизит
// 
// Параметры:
//  ПравилоКонвертации - СтрокаТаблицыЗначений - Правило конвертации
//  ПолученныеДанные - Структура - данные полученные из Warehouse
//  ДанныеЗаполнения - Структура -  Данные заполнения
//
Процедура ПКС_СтанцияНазначенияWarehouse(ПравилоКонвертации, ПолученныеДанные, ДанныеЗаполнения) Экспорт
	
	Перем ПолученноеЗначение;
	
	ЗначениеЗаполнения = Справочники.гкс_КлассификаторСтанцийЖД.ПустаяСсылка();
	
	Если ДанныеЗаполнения.Свойство("ВидПеревозки")
		И ДанныеЗаполнения.ВидПеревозки = Перечисления.гкс_ТипыТранспортныхСредствДоставки.ЖДТранспорт 
		И ПолученныеДанные.Свойство(ПравилоКонвертации.СвойствоИсточника, ПолученноеЗначение) Тогда
		
		СтанцииWarehouseМенеджер = Справочники.гкс_СтанцииWarehouse;
		ЗначениеЗаполнения = СтанцииWarehouseМенеджер.СтанцияWarehouseПоИдентификатору(ПолученноеЗначение);
		
		ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, ЗначениеЗаполнения);
		ДанныеЗаполнения.Вставить("СтанцияНазначения", СтанцииWarehouseМенеджер.СтанцияКлассификатор(ЗначениеЗаполнения));
	КонецЕсли;
		
КонецПроцедуры

// Правило конвертации в реквизит
// 
// Параметры:
//  ПравилоКонвертации - СтрокаТаблицыЗначений - Правило конвертации
//  ПолученныеДанные - Структура - данные полученные из Warehouse
//  ДанныеЗаполнения - Структура -  Данные заполнения
//
Процедура ПКС_СюрвейерWarehouse(ПравилоКонвертации, ПолученныеДанные, ДанныеЗаполнения) Экспорт
	
	Перем ПолученноеЗначение;
	
	Если ПолученныеДанные.Свойство(ПравилоКонвертации.СвойствоИсточника, ПолученноеЗначение) Тогда
		
		ЗначениеЗаполнения = Справочники.гкс_КонтрагентыWarehouse.ЭлементПоВнешнимДанным(
			ПолученноеЗначение, Перечисления.гкс_ТипыОбъектовWarehouse.Сюрвейер);
					
		Если ЗначениеЗаполнено(ЗначениеЗаполнения) Тогда		
			ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, ЗначениеЗаполнения);	
			ДанныеЗаполнения.Вставить("Сюрвейер", РегистрыСведений.гкс_СоответствиеОбъектовWarehouse.
				СсылкаОбъектаПоСсылкеWarehouse(ЗначениеЗаполнения)); 
		Иначе
			ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, 
				Справочники.гкс_КонтрагентыWarehouse.ПустаяСсылка());			
			ДанныеЗаполнения.Вставить("Сюрвейер", Справочники.Контрагенты.ПустаяСсылка());			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Правило конвертации в реквизит
// 
// Параметры:
//  ПравилоКонвертации - СтрокаТаблицыЗначений - Правило конвертации
//  ПолученныеДанные - Структура - данные полученные из Warehouse
//  ДанныеЗаполнения - Структура -  Данные заполнения
//
Процедура ПКС_ОрганизацияWarehouse(ПравилоКонвертации, ПолученныеДанные, ДанныеЗаполнения) Экспорт
		
	Перем ПолученноеЗначение;
	
	Если ПолученныеДанные.Свойство(ПравилоКонвертации.СвойствоИсточника, ПолученноеЗначение) Тогда
		
		ЗначениеЗаполнения = Справочники.гкс_КонтрагентыWarehouse.ЭлементПоВнешнимДанным(
			ПолученноеЗначение, Перечисления.гкс_ТипыОбъектовWarehouse.Организация);
					
		Если ЗначениеЗаполнено(ЗначениеЗаполнения) Тогда		
			ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, ЗначениеЗаполнения);	
			ДанныеЗаполнения.Вставить("Организация", РегистрыСведений.гкс_СоответствиеОбъектовWarehouse.
				СсылкаОбъектаПоСсылкеWarehouse(ЗначениеЗаполнения)); 
		Иначе
			ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, 
				Справочники.гкс_КонтрагентыWarehouse.ПустаяСсылка());			
			ДанныеЗаполнения.Вставить("Организация", Справочники.Организации.ПустаяСсылка());			
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

Процедура ПКС_ЭлеваторWarehouse(ПравилоКонвертации, ПолученныеДанные, ДанныеЗаполнения) Экспорт
	
	Перем ПолученноеЗначение;
	
	Если ПолученныеДанные.Свойство(ПравилоКонвертации.СвойствоИсточника, ПолученноеЗначение) Тогда
		
		ЗначениеЗаполнения = Справочники.гкс_КонтрагентыWarehouse.ЭлементПоВнешнимДанным(
			ПолученноеЗначение, Перечисления.гкс_ТипыОбъектовWarehouse.Элеватор);
					
		Если ЗначениеЗаполнено(ЗначениеЗаполнения) Тогда		
			ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, ЗначениеЗаполнения);	
			ДанныеЗаполнения.Вставить("Элеватор", РегистрыСведений.гкс_СоответствиеОбъектовWarehouse.
				СсылкаОбъектаПоСсылкеWarehouse(ЗначениеЗаполнения)); 
		Иначе
			ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, 
				Справочники.гкс_КонтрагентыWarehouse.ПустаяСсылка());			
			ДанныеЗаполнения.Вставить("Элеватор", Справочники.гкс_ТочкиМаршрута.ПустаяСсылка());			
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

// Правило конвертации в реквизит
// 
// Параметры:
//  ПравилоКонвертации - СтрокаТаблицыЗначений - Правило конвертации
//  ПолученныеДанные - Структура - данные полученные из Warehouse
//  ДанныеЗаполнения - Структура -  Данные заполнения
//
Процедура ПКС_НоменклатураWarehouse(ПравилоКонвертации, ПолученныеДанные, ДанныеЗаполнения) Экспорт
	
	Перем ПолученноеЗначение;	
	Если ПолученныеДанные.Свойство(ПравилоКонвертации.СвойствоИсточника, ПолученноеЗначение) Тогда
		
		ПолноеИмяОбъектаСвойства = "Справочник.гкс_ПродукцияWarehouse";
		ДанныеЗаполненияСвойства = Новый Структура;
		ДанныеЗаполненияСвойства.Вставить(Справочники.гкс_ПродукцияWarehouse.ИмяКлючевогоСвойства(), 
			ПолученноеЗначение); 
		ДанныеЗаполненияСвойства.Вставить("НаименованиеКороткое", ПолученныеДанные.goodShortName); 
		ДанныеЗаполненияСвойства.Вставить("Наименование", ПолученныеДанные.goodName); 
		
		ЗначениеЗаполнения = гкс_ОбменДаннымиWarehouse.ЭлементПоВнешнимДанным(ПолноеИмяОбъектаСвойства, 
			ПолученноеЗначение, ДанныеЗаполненияСвойства);
			
		Если ЗначениеЗаполнено(ЗначениеЗаполнения) Тогда
			ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, ЗначениеЗаполнения);
			
			// Номенклатура
			ДанныеЗаполнения.Вставить("Номенклатура", РегистрыСведений.гкс_СоответствиеОбъектовWarehouse.
				СсылкаОбъектаПоСсылкеWarehouse(ЗначениеЗаполнения)); 	
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

// Правило конвертации в реквизит
// 
// Параметры:
//  ПравилоКонвертации - СтрокаТаблицыЗначений - Правило конвертации
//  ПолученныеДанные - Структура - данные полученные из Warehouse
//  ДанныеЗаполнения - Структура -  Данные заполнения
//
Процедура ПКС_ТипВнешнейПробы(ПравилоКонвертации, ПолученныеДанные, ДанныеЗаполнения) Экспорт
	
	Перем ПолученноеЗначение;	
	Если ПолученныеДанные.Свойство(ПравилоКонвертации.СвойствоИсточника, ПолученноеЗначение) Тогда
		
		ЗначениеЗаполнения = гкс_ОбменДаннымиWarehouse.СсылкаНаОбъектПоИдентификатору(ПолученноеЗначение.id, 
		  "Справочник.гкс_ТипыВнешнихПробWarehouse");
		
		Если ЗначениеЗаполнено(ЗначениеЗаполнения) Тогда
			ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, ЗначениеЗаполнения);
			
			// вид пробы 
			ДанныеЗаполнения.Вставить("ВидПробы", гкс_ОбменДаннымиWarehouse.
				КонвертацияПредопределенныхТиповПроб(ЗначениеЗаполнения));
		Иначе		
			ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, 
				Справочники.гкс_ТипыВнешнихПробWarehouse.ПустаяСсылка());
				
			ДанныеЗаполнения.Вставить("ВидПробы", Перечисления.гкс_НазначенияИспользованияКачества.ПустаяСсылка());	
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

// Правило конвертации в реквизит
// 
// Параметры:
//  ПравилоКонвертации - СтрокаТаблицыЗначений - Правило конвертации
//  ПолученныеДанные - Структура - данные полученные из Warehouse
//  ДанныеЗаполнения - Структура -  Данные заполнения
//
Процедура ПКС_ПоказательКачестваWarehouse(ПравилоКонвертации, ПолученныеДанные, ДанныеЗаполнения) Экспорт
	
	Перем ПолученноеЗначение;
	
	Если ПолученныеДанные.Свойство(ПравилоКонвертации.СвойствоИсточника, ПолученноеЗначение) Тогда
		
		ЗначениеЗаполнения = гкс_ОбменДаннымиWarehouse.СсылкаНаОбъектПоИдентификатору(ПолученноеЗначение, 
		  "Справочник.гкс_ПоказателиКачестваWarehouse");
		
		Если ЗначениеЗаполнено(ЗначениеЗаполнения) Тогда
			ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, ЗначениеЗаполнения);
			
			// Показатель
			ДанныеЗаполнения.Вставить("Показатель", РегистрыСведений.гкс_СоответствиеОбъектовWarehouse.
				СсылкаОбъектаПоСсылкеWarehouse(ЗначениеЗаполнения)); 
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

Процедура ЗаполнитьНомераПоискаАвтотранспорта()
	
	Если ВидПеревозки <> Перечисления.гкс_ТипыТранспортныхСредствДоставки.Автомобиль Тогда
		Возврат;
	КонецЕсли;
	
	НомераАвтоИПрицепа = гкс_ПриемкаТранспорта.НомерТранспортногоСредстваВСтруктуру(НомерТС); 
	НомерЗерновоза = НомераАвтоИПрицепа.НомерЗерновоза;
	НомерПрицепа = НомераАвтоИПрицепа.НомерПрицепа;
		    	
КонецПроцедуры

// Приводит вес к значению в килограммах
//
Процедура НормализоватьВес()
	
	Тонна = 1000;
	Если (ВесБрутто <= Тонна) И (ВесТары <= Тонна) И (ВесНетто <= Тонна) Тогда
		
		ВесБрутто = ВесБрутто * Тонна;
		ВесТары = ВесТары * Тонна;
		ВесНетто = ВесНетто * Тонна;
		
	КонецЕсли;	
	
КонецПроцедуры	
	
#КонецОбласти

#КонецЕсли
