#Область ПрограммныйИнтерфейс

Функция ВключенОбменСRMQ() Экспорт
	
	Возврат гкс_ОчередьСообщенийRMQСлужебный.ЭтоБазаУчастникОбменаСRMQ();
	
КонецФункции

Функция ЕстьПолучатели(ТипМетаданных) Экспорт
	
	Возврат гкс_ОчередьСообщенийRMQВызовСервера.ЕстьПолучатели(ТипМетаданных);
	
КонецФункции

Функция ЕстьПолучателиСОтложеннымФормированием(ТипМетаданных) Экспорт
	
	Возврат гкс_ОчередьСообщенийRMQВызовСервера.ЕстьПолучателиСОтложеннымФормированием(ТипМетаданных);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекущееПриложение() Экспорт
	
	Возврат Справочники.гкс_УчастникиОбменаRMQ.ТекущееПриложение();
			
КонецФункции

Функция ПараметрыОбработкиСообщения(СвойстваСообщения) Экспорт
	
	ТипСодержимого = СвойстваСообщения["ТипСодержимого"];
	ДанныеПриложения = СвойстваСообщения["ИмяПриложения"];
	ПараметрыОбработкиСообщения = гкс_ОчередьСообщенийRMQСлужебный.ПараметрыОбработкиСообщенияШаблон();
	
	ДанныеФормата = гкс_ОчередьСообщенийRMQПовтИсп.ФорматПоТипуСодержимого(ТипСодержимого);
	Если ЗначениеЗаполнено(ДанныеФормата) Тогда
		
		НастройкиФормата = гкс_ОчередьСообщенийRMQВызовСервера.ПолучитьОбщиеНастройкиФормата(ДанныеФормата["Формат"]);

	    ЗаполнитьЗначенияСвойств(ПараметрыОбработкиСообщения, ДанныеФормата);
	    ЗаполнитьЗначенияСвойств(ПараметрыОбработкиСообщения, НастройкиФормата);
	    
	КонецЕсли;

	Приложение = гкс_ОчередьСообщенийRMQСлужебный.ПриложениеПоПараметрам(ДанныеПриложения);
	Если ЗначениеЗаполнено(Приложение) Тогда
		ПараметрыОбработкиСообщения.Вставить("Приложение", Приложение);
	КонецЕсли;
	
	Если СвойстваСообщения.Свойство("Тип") Тогда 
		ПараметрыОбработкиСообщения.Вставить("ТипКонтракта", СвойстваСообщения.Тип);
	КонецЕсли;	
	
	Возврат Новый ФиксированнаяСтруктура(ПараметрыОбработкиСообщения);
	
КонецФункции

Функция ФорматПоТипуСодержимого(ТипСодержимого) Экспорт
	
	ИмяФормата = гкс_ОчередьСообщенийRMQСлужебный.ИмяФорматаПоСодержимому(ТипСодержимого);
	Возврат Справочники.гкс_ФорматыОбменаИАС.ДанныеФорматаПоИмени(ИмяФормата);
	
КонецФункции

#Область НастройкиПодсистемыRMQ

Функция НастройкаИнтеграционногоАдаптера(ИмяНастройки) Экспорт
	
	Возврат гкс_ОчередьСообщенийRMQВызовСервера.НастройкаИнтеграционногоАдаптера(ИмяНастройки);	
	
КонецФункции

#КонецОбласти

#КонецОбласти