// @strict-types

#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
			
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АвтоПриемка", Истина);
	
	ОткрытьФорму("Обработка.гкс_ПриемкаТранспорта.Форма.ОсновнаяФорма", 
	             ПараметрыФормы, 
	             ПараметрыВыполненияКоманды.Источник, 
	             ПараметрыВыполненияКоманды.Уникальность, 
	             ПараметрыВыполненияКоманды.Окно, 
				 ПараметрыВыполненияКоманды.НавигационнаяСсылка);

КонецПроцедуры

#КонецОбласти
