#Область СлужебныйПрограммныйИнтерфейс

// Выполняет подключаемую команду интеграции с Warehouse из формы объекта или списка.
//
// Параметры:
//   Команда - КомандаФормы - вызванная команда.
//   Форма - ФормаКлиентскогоПриложения - форма, из которой вызывается команда.
//   Источник - ДанныеФормыСтруктура, ДанныеФормыКоллекция - данные, уточняющие параметр команды.
//
Процедура ВыполнитьПодключаемуюКомандуИнтеграции(Команда, Форма, Источник) Экспорт
		
	Если Команда.Имя = "гкс_ЗагрузитьКлассификатор" Тогда 	
		гкс_ИнтеграцияWarehouseВызовСервера.Обработчик_ЗагрузитьКлассификатор(Форма.ИмяФормы);
		Оповестить("Запись_КлассификаторWarehouse");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьСписокПослеОбновленияДанных(Форма, Знач ИмяСобытия, Знач Параметр, Источник) Экспорт
	
	Если ИмяСобытия = "Запись_КлассификаторWarehouse" Тогда
		
		Форма.Элементы.Список.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти