#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СтруктураОтбора") Тогда
		УстановитьОтборСписка(Параметры.СтруктураОтбора);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОтборСписка(СтруктураПараметров)
	
	Если ЗначениеЗаполнено(СтруктураПараметров.ТочкаМаршрута) Тогда
		
		ОбщегоНазначенияКлиентСервер
		      .УстановитьЭлементОтбораДинамическогоСписка(Список, 
		                                                  "ТочкаМаршрута", 
			                                              СтруктураПараметров.ТочкаМаршрута, 
			                                              ВидСравненияКомпоновкиДанных.Равно);
	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураПараметров.ВидПеревозки) Тогда
		
		ОбщегоНазначенияКлиентСервер
		       .УстановитьЭлементОтбораДинамическогоСписка(Список, 
		                                                   "ВидПеревозки", 
		                                                   СтруктураПараметров.ВидПеревозки, 
		                                                   ВидСравненияКомпоновкиДанных.Равно);
	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
