#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)

	ПараметрыВыгрузки = Новый Структура;
	ПараметрыВыгрузки.Вставить("ДокументРегистрации", Ссылка);
	ПараметрыВыгрузки.Вставить("СостояниеРегистрации", Перечисления.гкс_СостоянияРегистрации.Регистрация);
	ПараметрыВыгрузки.Вставить("Отмена", Ложь);

	гкс_ИнтеграцияСКверионСервер.ВыгрузитьСообщениеВКверион(ПараметрыВыгрузки, Отказ);

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

	ПараметрыВыгрузки = Новый Структура;
	ПараметрыВыгрузки.Вставить("ДокументРегистрации", Ссылка);
	ПараметрыВыгрузки.Вставить("СостояниеРегистрации", Перечисления.гкс_СостоянияРегистрации.Регистрация);
	ПараметрыВыгрузки.Вставить("Отмена", Истина);
     	
	гкс_ИнтеграцияСКверионСервер.ВыгрузитьСообщениеВКверион(ПараметрыВыгрузки, Отказ);

КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
#КонецЕсли