
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяМакета 		= "ШаблонСравненияПоказателей";
	Макет 			= Обработки.гкс_ОбработкаЗагрузкиВнешнихПроб.ПолучитьМакет(ИмяМакета);
	ОбластьМакета 	= Макет.ПолучитьОбласть("Шапка");
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета 	= Макет.ПолучитьОбласть("Строка");
	ТабличныйДокументДанные.Вывести(ОбластьМакета);	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьАнализ(Команда)
	Если ПроверитьЗаполнение() Тогда 
		ВыполнитьАнализНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Сбросить(Команда)
	
	Элементы.ТабличныйДокументДанные.ТолькоПросмотр = Ложь;
	Элементы.ФормаВыполнитьАнализ.Доступность = Истина;
	СброситьНаСервере(ТабличныйДокументДанные);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура СброситьНаСервере(ТабличныйДокументДанные)
	
	ИмяОбласти = СтрШаблон(
		"R1C1:R%1C4", Формат(ТабличныйДокументДанные.ВысотаТаблицы, "ЧГ="));
	Область = ТабличныйДокументДанные.Область(ИмяОбласти);
	ТабличныйДокументДанные.УдалитьОбласть(Область, ТипСмещенияТабличногоДокумента.ПоВертикали);

КонецПроцедуры

&НаСервере
Процедура ВыполнитьАнализНаСервере()
	
	// Структура макета фиксированная, вывод в 2 ТД: первый - заголовки, второй - данные.
	// 2 ТД пришлось из-за копирования-вставки из LibreOffice (при вставке затиралась колонка-заголовок).
	// 1 колонка - ТС 
	// 2 колонка - Показатель1 (может быть пустым)
	// 3 колонка - Показатель2 (может быть пустым)
	// 4 колонка - Показатель3 (может быть пустым)
	
	// Получить список ТС из Табличного документа
	ТранспортныеСредства = ВыделитьТранспортныеСредства();
	
	// Получить показатели из Табличного документа
	СоответствиеПоказателей = ВыделитьПоказателиИзТабличногоДокумента();
	Если СоответствиеПоказателей.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Заполните хотя бы один показатель в первой строке документа!'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Показатели = Новый Массив;
	Для Каждого КлючИЗначение Из СоответствиеПоказателей Цикл
		Показатели.Добавить(КлючИЗначение.Значение);
	КонецЦикла;
	
	РезультатЗапроса = РезультатЗапросаВнешнихПробПоЗаявкамНаПеревозку(Показатели, ТранспортныеСредства);
	РезультатыВнешнихПроб = РезультатЗапроса.Выгрузить();
	
	ПодготовитьДанныеТабличногоДокументаДляСравнения(СоответствиеПоказателей);
    
	// Обход первичных данных
	НомерКолонкиТС = 1;
	Для Каждого Показатель Из СоответствиеПоказателей Цикл 
		
		НомерПервойСтроки = 1;
		Для НомерСтроки = НомерПервойСтроки По ТабличныйДокументДанные.ВысотаТаблицы Цикл
			
			ОбластьТС 			= ТабличныйДокументДанные.Область(НомерСтроки, НомерКолонкиТС);
			ОбластьПоказатель 	= ТабличныйДокументДанные.Область(НомерСтроки, Показатель.Ключ);
			
			Отбор = Новый Структура("НомерТС,Показатель", ОбластьТС.Текст, Показатель.Значение);
			ТекущееЗначение = ТекущееЗначениеВнешнейПробыПоДаннымИБ(РезультатыВнешнихПроб, Отбор);
			
			ВыделитьРасхождениеПоЗначениямДляОбласти(ОбластьПоказатель, ТекущееЗначение);
			
			ОбластьПоказатель.Текст = СтрШаблон("%1 / %2", ОбластьПоказатель.Текст, ТекущееЗначение);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Элементы.ТабличныйДокументДанные.ТолькоПросмотр = Истина;
	Элементы.ФормаВыполнитьАнализ.Доступность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьДанныеТабличногоДокументаДляСравнения(Знач СоответствиеПоказателей)
	
	Для Каждого Показатель Из СоответствиеПоказателей Цикл 
		
		Для НомерСтроки = 1 По ТабличныйДокументДанные.ВысотаТаблицы Цикл 
			
			Область = ТабличныйДокументДанные.Область(НомерСтроки, Показатель.Ключ);
			Область.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
			Область.ЦветТекста 	= Новый Цвет;
			Область.Шрифт 		= Новый Шрифт;
			Текст 				= ?(ПустаяСтрока(Область.Текст), "-", Область.Текст);
			Если СтрНайти(Область.Имя, ":") Тогда 
				// Область объединенная: разъединить и заполнить значения в ячейках
				Область.Разъединить();
				Для НПП = Область.Верх По Область.Низ Цикл 
					ОбластьЗначения = ТабличныйДокументДанные.Область(НПП, Показатель.Ключ);
					ОбластьЗначения.Текст = Текст;
				КонецЦикла;
				
				НомерСтроки = Область.Низ;
				
			Иначе 
				Область.Текст = Текст;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ВыделитьРасхождениеПоЗначениямДляОбласти(ОбластьПоказатель, ТекущееЗначение)
	
	ОписаниеТипа 	= Новый ОписаниеТипов("Число");
	ВнешнееЗначение = ОбластьПоказатель.Текст;
	Если Не ОписаниеТипа.ПривестиЗначение(ВнешнееЗначение) = ОписаниеТипа.ПривестиЗначение(ТекущееЗначение) Тогда
		ОбластьПоказатель.ЦветТекста = ЦветаСтиля.ЦветТекстаОтрицательногоЗначения;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ТекущееЗначениеВнешнейПробыПоДаннымИБ(РезультатыВнешнихПроб, Отбор)
	
	ДанныеВнешнейПробы = РезультатыВнешнихПроб.НайтиСтроки(Отбор);
	Если ДанныеВнешнейПробы.Количество() = 0 Тогда
		ТекущееЗначение = "-";
	Иначе
		ТекущееЗначение = Формат(ДанныеВнешнейПробы[0].ЗначениеПоказателя, "ЧДЦ=2; ЧН=0,00");
	КонецЕсли;
	Возврат ТекущееЗначение
	
КонецФункции

&НаСервере
Функция РезультатЗапросаВнешнихПробПоЗаявкамНаПеревозку(Показатели, ТранспортныеСредства)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НомерЗаявки", НомерЗаявки);
	Запрос.УстановитьПараметр("НазначениеИспользованияКачества", НазначениеИспользованияКачества);
	Запрос.УстановитьПараметр("Показатели", Показатели);
	Запрос.УстановитьПараметр("ТранспортныеСредства", ТранспортныеСредства);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВнешниеПробыПоЗаявкамНаПеревозку.НомерЗаявки КАК НомерЗаявки,
	|	ВнешниеПробыПоЗаявкамНаПеревозку.НомерТС КАК НомерТС,
	|	ВнешниеПробыПоЗаявкамНаПеревозку.НазначениеИспользованияКачества КАК НазначениеИспользованияКачества,
	|	ВнешниеПробыПоЗаявкамНаПеревозку.Показатель КАК Показатель,
	|	ВнешниеПробыПоЗаявкамНаПеревозку.ЗначениеПоказателя КАК ЗначениеПоказателя
	|ИЗ
	|	РегистрСведений.гкс_ВнешниеПробыПоЗаявкамНаПеревозку КАК ВнешниеПробыПоЗаявкамНаПеревозку
	|ГДЕ
	|	ВнешниеПробыПоЗаявкамНаПеревозку.НомерЗаявки = &НомерЗаявки
	|	И ВнешниеПробыПоЗаявкамНаПеревозку.НазначениеИспользованияКачества = &НазначениеИспользованияКачества
	|	И ВнешниеПробыПоЗаявкамНаПеревозку.Показатель В(&Показатели)
	|	И ВнешниеПробыПоЗаявкамНаПеревозку.НомерТС В(&ТранспортныеСредства)";
	Возврат Запрос.Выполнить();
	
КонецФункции

&НаСервере
Функция ВыделитьПоказателиИзТабличногоДокумента()
	
	СоответствиеПоказателей = Новый Соответствие;
	
	Область = ТабличныйДокумент.Область("R1C2");
	Если ЗначениеЗаполнено(Область.Значение) Тогда 
		СоответствиеПоказателей.Вставить(Область.Право, Область.Значение);
	КонецЕсли;
	
	Область = ТабличныйДокумент.Область("R1C3");
	Если ЗначениеЗаполнено(Область.Значение) Тогда 
		СоответствиеПоказателей.Вставить(Область.Право, Область.Значение);
	КонецЕсли;
	
	Область = ТабличныйДокумент.Область("R1C4");
	Если ЗначениеЗаполнено(Область.Значение) Тогда 
		СоответствиеПоказателей.Вставить(Область.Право, Область.Значение);
	КонецЕсли;
	
	Возврат СоответствиеПоказателей;
	
КонецФункции

&НаСервере
Функция ВыделитьТранспортныеСредства()
	
	ТранспортныеСредства = Новый Массив;
	Для НомерСтроки = 1 По ТабличныйДокументДанные.ВысотаТаблицы Цикл 
		
		ИмяОбласти = СтрШаблон("R%1C1", Формат(НомерСтроки, "ЧГ="));
		ОбластьТС = ТабличныйДокументДанные.Область(ИмяОбласти);
		Если ЗначениеЗаполнено(ОбластьТС.Текст) Тогда 
			ТранспортныеСредства.Добавить(ОбластьТС.Текст);
		КонецЕсли;
		
	КонецЦикла;
	Возврат ТранспортныеСредства;

КонецФункции

#КонецОбласти