#Область ОбработкаКоманд

&НаКлиенте
Процедура ПоказатьЗапрос(Команда)
	
	Элементы.ГруппаЗапрос.Видимость = Истина;
	ПоказатьЗапросНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОтвет(Команда)
	
	Элементы.ГруппаОтвет.Видимость = Истина;
	ПоказатьОтветНаСервере();
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПоказатьЗапросНаСервере()
	
	РеквизитЗапись	= РеквизитФормыВЗначение("Запись");
	ТекстЗапроса	= РеквизитЗапись.ХранилищеЗапроса.Получить();
	Если НЕ ЗначениеЗаполнено(ТекстЗапроса) Тогда
		Возврат;
	КонецЕсли;
	 
	Если СтрНайти(НРег(Запись.ТипСодержимого),"json") > 0 Тогда      
		
		Читатель = Новый ЧтениеJSON;               
		Читатель.УстановитьСтроку(ТекстЗапроса);
		ВремРезультат = ПрочитатьJSON(Читатель, Истина);   	
		
		Писатель = Новый ЗаписьJSON;
		Писатель.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, Символы.Таб, Истина));
		
		ЗаписатьJSON(Писатель, ВремРезультат);
		
		ТекстЗапроса = Писатель.Закрыть();
		
	КонецЕсли;    
	
	Заголовки = РеквизитЗапись.ХранилищеЗаголовковЗапроса.Получить();
	ЗаголовкиЗапроса.Очистить();
	Если ЗначениеЗаполнено(Заголовки) Тогда
		Для Каждого КлючИЗначение Из Заголовки Цикл
			СтрокаЗаголовок = ЗаголовкиЗапроса.Добавить();
			СтрокаЗаголовок.Заголовок = КлючИЗначение.Ключ;
			СтрокаЗаголовок.Значение = КлючИЗначение.Значение;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьОтветНаСервере()
	
	РеквизитЗапись	= РеквизитФормыВЗначение("Запись");
	ТекстОтвета		= РеквизитЗапись.ХранилищеОтвета.Получить();  
	Если НЕ ЗначениеЗаполнено(ТекстОтвета) Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрНайти(НРег(Запись.ТипСодержимого),"json") > 0 Тогда      
		
		Читатель = Новый ЧтениеJSON;               
		Читатель.УстановитьСтроку(ТекстОтвета);
		ВремРезультат = ПрочитатьJSON(Читатель, Истина);   	
		
		Писатель = Новый ЗаписьJSON;
		Писатель.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, Символы.Таб, Истина));
		
		ЗаписатьJSON(Писатель, ВремРезультат);
		
		ТекстОтвета = Писатель.Закрыть();
		
	КонецЕсли;   
	
	Заголовки = РеквизитЗапись.ХранилищеЗаголовковОтвета.Получить();
	ЗаголовкиЗапроса.Очистить();
	Если ЗначениеЗаполнено(Заголовки) Тогда
		Для Каждого КлючИЗначение Из Заголовки Цикл
			СтрокаЗаголовок = ЗаголовкиОтвета.Добавить();
			СтрокаЗаголовок.Заголовок = КлючИЗначение.Ключ;
			СтрокаЗаголовок.Значение = КлючИЗначение.Значение;
		КонецЦикла;
	КонецЕсли;

	
КонецПроцедуры    

#КонецОбласти 