#Если ТолстыйКлиентОбычноеПриложение ИЛИ Сервер ИЛИ ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СформироватьСообщение(Данные, Параметры) Экспорт
	
	Формирователь = ПолучитьЭкземплярФормирователяПоПараметрам(Данные, Параметры);  
	ЗадатьВПараметрыОбъектыСобытия(Параметры, Данные); 
	
	Возврат Формирователь.СформироватьСообщение();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

Функция ЗадатьВПараметрыОбъектыСобытия(Параметры, Данные)
	
	ТипЗнчХМЛ = XMLТипЗнч(Данные);
	Параметры.Вставить("ВыгруженныеОбъекты", Новый Массив);
	Если гкс_ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Данные)) Тогда
		Параметры["ВыгруженныеОбъекты"].Добавить(Данные); 
	ИначеЕсли СтрНайти(ТипЗнчХМЛ.ИмяТипа, "DocumentObject") > 0
		ИЛИ СтрНайти(ТипЗнчХМЛ.ИмяТипа, "CatalogObject") > 0 Тогда
		Параметры["ВыгруженныеОбъекты"].Добавить(Данные.Ссылка);
	КонецЕсли;
		
КонецФункции

Функция ПолучитьЭкземплярФормирователяПоПараметрам(Данные, Параметры) Экспорт
	
	Перем Формат;
	
	Параметры.Свойство("Формат", Формат);
	Если НЕ ЗначениеЗаполнено(Формат) Тогда
		ИсключениеНеУказанФорматДляСозданияЭкземпляра();
	КонецЕсли;
	
	Экземпляр = Создать();
	Экземпляр.УстановитьФормат(Формат);
	Экземпляр.УстановитьОбъект(Данные);
	Если Параметры.Свойство("ТестыИспытания") Тогда
		Экземпляр.НастроитьОбъектДляТестовИспытаний(Параметры["ТестыИспытания"]);	
	КонецЕсли;
	
	Возврат Экземпляр;
	
КонецФункции

#Область СлужебныеПроцедурыИФункции

Процедура ИсключениеНеУказанФорматДляСозданияЭкземпляра()
	ВызватьИсключение НСтр("ru='Не указан формат для формирования экземпляра'")	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли