#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда 
		Возврат;
	КонецЕсли;
	УправлениеВидимостьюЭлементовФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаПечать(Команда)
	
	РеквизитыПодписанта 				= ПолучитьРеквизитыПодписанта(Подписант);
	ПодписантНаименование 				= РеквизитыПодписанта.Наименование;
	ПодписантДолжность 					= РеквизитыПодписанта.Должность;
	МассивПломбыПереданныеОтправителю 	= ПломбыПереданныеОтправителю.ВыгрузитьЗначения();
	МассивПломбыОставшиесяУПолучателя 	= ПломбыОставшиесяУПолучателя.ВыгрузитьЗначения();
	
	ДанныеПечати = Новый Структура;
	ДанныеПечати.Вставить("Подписант", 							ПодписантНаименование);
	ДанныеПечати.Вставить("МассивПломбыПереданныеОтправителю", 	МассивПломбыПереданныеОтправителю);
	ДанныеПечати.Вставить("МассивПломбыОставшиесяУПолучателя", 	МассивПломбыОставшиесяУПолучателя);
	ДанныеПечати.Вставить("ДолжностьПодписанта", 				ПодписантДолжность);
	
	Закрыть(Новый Структура("ДанныеПечати", ДанныеПечати));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеВидимостьюЭлементовФормы()
	
	Элементы.ГруппаНомераПломб.Видимость 	=  Параметры.Свойство("ПечатьАктОтбораПроб");
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРеквизитыПодписанта(Подписант)
	
	Возврат гкс_ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Подписант, "Наименование, Должность");
	
КонецФункции

#КонецОбласти