#Область СлужебныеПроцедурыИФункции

// Вызывается перед одноименным обработчиком. См. гкс_ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания
// Основное назначение - определить свою логику обработки для конфигураций не поддерживающих БСП,
// либо поддерживающих частично
// @Skip-warning
//
// Параметры:
//	ИмяЗадания - Строка - имя регламентного задания
//  ОбработкаЗавершена - Булево - признак, обозначающий что обработка для конкретного задания завершена
//  и продолжать ее в  См гкс_ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания не требуется
//
Процедура ПриНачалеВыполненияРегламентногоЗадания(ИмяЗадания, ОбработкаЗавершена) Экспорт
	
КонецПроцедуры

#КонецОбласти