#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура СоздатьДокументВыездНаКПП(ДокументОснование) Экспорт
	
	НовыйДокументВыездНаКПП = СоздатьДокумент();
	НовыйДокументВыездНаКПП.Дата				= ТекущаяДатаСеанса();
	НовыйДокументВыездНаКПП.ДокументОснование 	= ДокументОснование;
	НовыйДокументВыездНаКПП.ВремяВыезда			= ТекущаяДатаСеанса();
	
	Попытка
		НовыйДокументВыездНаКПП.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		
		ИнформацияОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());	
		ТекстИсключения = НСтр("ru = 'Ошибка проведения документа'", ОбщегоНазначения.КодОсновногоЯзыка());
			
		ЗаписьЖурналаРегистрации(
			ТекстИсключения,
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Документы.гкс_ВыездНаКПП, , ИнформацияОбОшибке);
	Конецпопытки;	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли