
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)

	ПроверитьУникальностьТочкиМаршрута(Объект.Ссылка, Объект.ТочкаМаршрута, Отказ);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПроверитьУникальностьТочкиМаршрута(Ссылка, ТочкаМаршрута, Отказ)
	
	Если Не ПолучитьФункциональнуюОпцию("гкс_ИспользоватьИнтеграциюСРПВ")
		Или ТочкаМаршрута.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ТочкаМаршрута", ТочкаМаршрута);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПРЕДСТАВЛЕНИЕ(СтруктураПЛК.Ссылка) КАК Ссылка,
	|	ПРЕДСТАВЛЕНИЕ(СтруктураПЛК.ТочкаМаршрута) КАК ТочкаМаршрута
	|ИЗ
	|	Справочник.гкс_СтруктураПЛК КАК СтруктураПЛК
	|ГДЕ
	|	НЕ СтруктураПЛК.Ссылка = &Ссылка
	|	И СтруктураПЛК.ТочкаМаршрута = &ТочкаМаршрута
	|	И СтруктураПЛК.ТипТранспортныхСредств = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыТранспортныхСредствДоставки.ЖДТранспорт)";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ТекстСообщения = СтрШаблон(
		"Точка маршрута %1 уже используется в Структуре ПЛК %2",
		Выборка.Ссылка, Выборка.ТочкаМаршрута);
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	
КонецПроцедуры

#КонецОбласти