#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка 
	Или Отбор.ГруппаТС = Справочники.гкс_ГруппыТС.ГруппаРегистрации(Отбор.РегистрацияТранспорта.Значение) Тогда
		Возврат;
	КонецЕсли;	
	
	Если Не Справочники.гкс_ГруппыТС.ВозможноДобавлениеВГруппуПоРазмеру(Отбор.ГруппаТС.Значение) Тогда					
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Невозможно добавить %1 в группу %2'"), 
							Отбор.РегистрацияТранспорта.Значение, Отбор.ГруппаТС.Значение);
							
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
