#Область СлужебныйПрограммныйИнтерфейс

// Создает прокси веб-сервиса. В случае ошибки вызывается исключение.
//
// Возвращаемое значение:
//	WSПрокси - Прокси web-сервиса.
//
Функция ПроксиВебСервисаСРПВ() Экспорт

	ИменаПараметровПодключения = "АдресWSDL,URIПространстваИмен,ИмяСервиса,ИмяТочкиПодключения,Таймаут";
	ПараметрыСервисаСРПВ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Справочники.гкс_ПодключениеКВебСервисам.ПодключениеСРПВ, ИменаПараметровПодключения);
	ПараметрыПодключения = ОбщегоНазначения.ПараметрыПодключенияWSПрокси();
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ПараметрыПодключения, ПараметрыСервисаСРПВ, Истина);

	Возврат ОбщегоНазначения.СоздатьWSПрокси(ПараметрыПодключения);

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекущийПЛК() Экспорт

	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.гкс_ТочкаМаршрутаБазы.Получить();

КонецФункции

Функция ИдентификаторТекущегоПЛК() Экспорт

	ТекущийПЛК = ТекущийПЛК();
	Возврат РегистрыСведений.гкс_СоответствияОбъектовСРПВ.ИдентификаторОбъектаСРПВ(
		ТекущийПЛК, Перечисления.гкс_ТипыОбъектовСРПВ.ПЛК);

КонецФункции

#КонецОбласти
