
#Область СлужебныеПроцедурыИФункции

//@skip-warning
Процедура ПриОпределенииИмениМодуляОбрабтчика(ИмяМодуля, Запрос, ПространствоИменXDTO) Экспорт
	
КонецПроцедуры

Функция ОбработатьЗапрос(Запрос) Экспорт
	
	Попытка
		
		// Пример программного кода обработки...
		// Если ПроверитьТип(Сообщение, "Тип1") Тогда
		//	 Возврат Создать(Сообщение);
		// ИначеЕсли ПроверитьТип(Сообщение, "Тип2") Тогда
		//	 Возврат ПолучитьОбъекты(Сообщение);
		// КонецЕсли	
		
		Возврат Неопределено;
		
	Исключение
		ВызватьИсключение  ОписаниеОшибки();
	КонецПопытки;
	
КонецФункции

Функция СформироватьОшибку(Тема, Текст) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти