#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПараметрыОткрытияОтчета(Параметры) Экспорт
	
	ОтчетОбъект = Создать();
	КомпоновщикНастроек = ОтчетОбъект.КомпоновщикНастроек;
	НастройкиКомпоновки = КомпоновщикНастроек.Настройки;
	
	Для Каждого Параметр Из Параметры Цикл
		НастройкиКомпоновки.ПараметрыДанных.УстановитьЗначениеПараметра(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;	
	
	ПараметрыОткрытия = Новый Структура();                     
	ПараметрыОткрытия.Вставить("СформироватьПриОткрытии", Истина);
	ПараметрыОткрытия.Вставить("Вариант", НастройкиКомпоновки); 
	ПараметрыОткрытия.Вставить("ПользовательскиеНастройки", КомпоновщикНастроек.ПользовательскиеНастройки);
	ПараметрыОткрытия.Вставить("РежимПоНастройкамКомпоновки");
	
	Возврат ПараметрыОткрытия;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// Параметры:
//   Настройки - см. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.Настройки.
//   НастройкиОтчета - см. ВариантыОтчетов.ОписаниеОтчета.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "АнализПредварительнойЗаписи");
	НастройкиВарианта.Наименование = НСтр("ru = 'Анализ предварительной записи'");
	НастройкиВарианта.ВидимостьПоУмолчанию = Истина;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти

#КонецЕсли