#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("КалендарьОчереди.Открытие");

	ОткрытьФорму("Обработка.гкс_КалендарьОчереди.Форма", 
				 Неопределено, 
				 ПараметрыВыполненияКоманды.Источник, 
				 ПараметрыВыполненияКоманды.Уникальность, 
				 ПараметрыВыполненияКоманды.Окно, 
				 ПараметрыВыполненияКоманды.НавигационнаяСсылка,
				 Неопределено,
	             РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

#КонецОбласти