#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область Проведение

// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив из Строка - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	
	МеханизмыДокумента.Добавить("МорскаяЛогистика");
	
КонецПроцедуры

// Возвращает таблицы для движений, необходимые для проведения документа по регистрам учетных механизмов.
//
// Параметры:
//  Документ - ДокументСсылка, ДокументОбъект - ссылка на документ или объект, по которому необходимо получить данные
//  Регистры - Структура - список имен регистров, для которых необходимо получить таблицы
//  ДопПараметры - Структура - дополнительные параметры для получения данных, определяющие контекст проведения.
//
// Возвращаемое значение:
//  Структура - см. гкс_ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения.
Функция ДанныеДокументаДляПроведения(Документ, Регистры, ДопПараметры = Неопределено) Экспорт
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = гкс_ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	КонецЕсли;
	
	Если ТипЗнч(Документ) = Тип("ДокументОбъект.гкс_ПрибытиеСуднаНаПЛК") Тогда
		ДокументСсылка = Документ.Ссылка;
	Иначе
		ДокументСсылка = Документ;
	КонецЕсли;
	
	Запрос			= Новый Запрос;
	ТекстыЗапроса	= Новый СписокЗначений;
	
	Если Не ДопПараметры.ПолучитьТекстыЗапроса Тогда
		////////////////////////////////////////////////////////////////////////////
		// Создадим запрос инициализации движений
		ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка, ДопПараметры);
		
		////////////////////////////////////////////////////////////////////////////
		// Сформируем текст запроса
		ТекстЗапросаТаблицаОбработкаСудов(ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаСостоянияФрахта(ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаТранспортныеДокументыФрахта(ТекстыЗапроса, Регистры);
		
	КонецЕсли;
	
	// Получим таблицы для движений
	Возврат гкс_ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения(Запрос, ТекстыЗапроса, ДопПараметры);
	
КонецФункции

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Подробней См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа
// 
//  Параметры:
//   Ограничение - Структура - со свойствами:
//    * Текст                             - Строка - ограничение доступа для пользователей.
//                                            Если пустая строка, значит, доступ разрешен.
//    * ТекстДляВнешнихПользователей      - Строка - ограничение доступа для внешних пользователей.
//                                            Если пустая строка, значит, доступ запрещен.
//    * ПоВладельцуБезЗаписиКлючейДоступа - Неопределено - определить автоматически.
//                                        - Булево - если Ложь, то всегда записывать ключи доступа,
//                                            если Истина, тогда не записывать ключи доступа,
//                                            а использовать ключи доступа владельца (требуется,
//                                            чтобы ограничение было строго по объекту-владельцу).
///   * ПоВладельцуБезЗаписиКлючейДоступаДляВнешнихПользователей - Неопределено, Булево - см.
//                                            описание предыдущего параметра.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Фрахт.ТочкаМаршрута)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка, ДопПараметры)
	
	МенеджерВременныхТаблиц = Неопределено;
	
	Если ДопПараметры <> Неопределено
		И ДопПараметры.Свойство("МенеджерВременныхТаблиц", МенеджерВременныхТаблиц) Тогда
		
		МенеджерВременныхТаблиц = ?(МенеджерВременныхТаблиц = Неопределено,
			Новый МенеджерВременныхТаблиц,
			МенеджерВременныхТаблиц);
		
	Иначе
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	КонецЕсли;
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	ПодготовитьДанныеДокумента(Запрос);
	
КонецПроцедуры

Процедура ПодготовитьДанныеДокумента(Запрос)
	
	Запрос.Текст = ТекстЗапросаДанныеДокумента();
	Запрос.Выполнить();
	
КонецПроцедуры

Функция ТекстЗапросаДанныеДокумента()
	
	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПрибытиеСуднаНаПЛК.Ссылка КАК Ссылка,
	|	ПрибытиеСуднаНаПЛК.Дата КАК Дата,
	|	ПрибытиеСуднаНаПЛК.Фрахт КАК Фрахт,
	|	ПрибытиеСуднаНаПЛК.Номенклатура КАК Номенклатура,
	|	ПрибытиеСуднаНаПЛК.ЕдиницаИзмеренияВеса КАК ЕдиницаИзмеренияВеса
	|ПОМЕСТИТЬ ДанныеДокумента
	|ИЗ
	|	Документ.гкс_ПрибытиеСуднаНаПЛК КАК ПрибытиеСуднаНаПЛК
	|ГДЕ
	|	ПрибытиеСуднаНаПЛК.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПрибытиеСуднаНаПЛКТранспортныеДокументы.Ссылка КАК Ссылка,
	|	ПрибытиеСуднаНаПЛКТранспортныеДокументы.ТранспортныйДокумент КАК ТранспортныйДокумент,
	|	ПрибытиеСуднаНаПЛКТранспортныеДокументы.Трюм КАК Трюм,
	|	ПрибытиеСуднаНаПЛКТранспортныеДокументы.КоличествоВТрюме КАК КоличествоВТрюме
	|ПОМЕСТИТЬ ТранспортныеДокументы
	|ИЗ
	|	Документ.гкс_ПрибытиеСуднаНаПЛК.ТранспортныеДокументы КАК ПрибытиеСуднаНаПЛКТранспортныеДокументы
	|ГДЕ
	|	ПрибытиеСуднаНаПЛКТранспортныеДокументы.Ссылка = &Ссылка";

КонецФункции

Процедура ТекстЗапросаТаблицаОбработкаСудов(ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "гкс_ОбработкаСудов";
	
	Если Не гкс_ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли; 
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ДанныеДокумента.Дата КАК Период,
	|	ДанныеДокумента.Фрахт КАК Фрахт,
	|	ДанныеДокумента.Номенклатура КАК Номенклатура,
	|	ДанныеДокумента.ЕдиницаИзмеренияВеса КАК ЕдиницаИзмеренияВеса,
	|	ТранспортныеДокументы.ТранспортныйДокумент КАК Коносамент,
	|	ТранспортныеДокументы.Трюм КАК Трюм,
	|	СУММА(ТранспортныеДокументы.КоличествоВТрюме) КАК Количество
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТранспортныеДокументы КАК ТранспортныеДокументы
	|		ПО ДанныеДокумента.Ссылка = ТранспортныеДокументы.Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Дата,
	|	ДанныеДокумента.Фрахт,
	|	ДанныеДокумента.Номенклатура,
	|	ДанныеДокумента.ЕдиницаИзмеренияВеса,
	|	ТранспортныеДокументы.ТранспортныйДокумент,
	|	ТранспортныеДокументы.Трюм,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|ИМЕЮЩИЕ
	|	СУММА(ТранспортныеДокументы.КоличествоВТрюме) > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Трюм";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
КонецПроцедуры

Процедура ТекстЗапросаТаблицаСостоянияФрахта(ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "гкс_СостоянияФрахта";
	
	Если Не гкс_ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли; 
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Дата КАК Период,
	|	ДанныеДокумента.Фрахт КАК Фрахт,
	|	ЗНАЧЕНИЕ(Перечисление.гкс_СостоянияТранспортныхСредств.Прибыл) КАК Состояние
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_Фрахт КАК ДокументФрахт
	|		ПО ДанныеДокумента.Фрахт = ДокументФрахт.Ссылка";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
КонецПроцедуры

Процедура ТекстЗапросаТаблицаТранспортныеДокументыФрахта(ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "гкс_ТранспортныеДокументыФрахта";
	
	Если Не гкс_ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли; 
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Фрахт КАК Фрахт,
	|	ТранспортныеДокументы.Трюм КАК Трюм,
	|	ТранспортныеДокументы.ТранспортныйДокумент КАК Коносамент
	|ИЗ
	|	ТранспортныеДокументы КАК ТранспортныеДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеДокумента КАК ДанныеДокумента
	|		ПО ТранспортныеДокументы.Ссылка = ДанныеДокумента.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Трюм";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли