#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	Если ТипДанныхЗаполнения = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.гкс_Фрахт") Тогда
		
		Если Не гкс_МорскаяЛогистика.ДоступноСозданиеПрибытияСуднаНаПЛК(ДанныеЗаполнения) Тогда
			ВызватьИсключение НСтр("ru = 'Для выбранного Фрахта недоступно создание Прибытия судна на ПЛК. 
						|Возможно, Прибытие судна на ПЛК уже создано либо Фрахт не является поставкой сырья.'");
		КонецЕсли;
		
		ЗаполнитьНаОснованииФрахта(ДанныеЗаполнения);
		
	Иначе
		Возврат;
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	гкс_ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Ответственный.Пустая() Тогда
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	гкс_ПроведениеДокументов.ПриЗаписиДокумента(ЭтотОбъект, Отказ);
	
	Если гкс_ПроведениеДокументов.СвойстваДокумента(ЭтотОбъект).РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		гкс_МорскаяЛогистика.АктуализироватьЛотыДляФрахта(Дата, Фрахт, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	гкс_ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	гкс_ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверитьВозможностьИспользованияФрахта(Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьВозможностьИспользованияФрахта(Отказ)
	
	// Один Фрахт на одно Прибытие судна на ПЛК
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Фрахт", Фрахт);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Представление(ДокументПрибытиеСуднаНаПЛК.Ссылка) КАК ПрибытиеСуднаНаПЛК,
	|	Представление(ДокументПрибытиеСуднаНаПЛК.Фрахт) КАК Фрахт
	|ИЗ
	|	Документ.гкс_ПрибытиеСуднаНаПЛК КАК ДокументПрибытиеСуднаНаПЛК
	|ГДЕ
	|	НЕ ДокументПрибытиеСуднаНаПЛК.ПометкаУдаления
	|	И ДокументПрибытиеСуднаНаПЛК.Фрахт = &Фрахт
	|	И НЕ ДокументПрибытиеСуднаНаПЛК.Ссылка = &Ссылка";
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ТекстСообщения = СтрШаблон(	
			НСтр("ru = 'Для документа %1 уже оформлено прибытие судна на ПЛК %2'"),
			Выборка.Фрахт, Выборка.ПрибытиеСуднаНаПЛК);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииФрахта(ДанныеЗаполнения)
	
	ДанныеЗаполнения = гкс_МорскаяЛогистикаВызовСервера.ДанныеЗаполненияПрибытияСуднаНаПЛК(ДанныеЗаполнения);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения.Реквизиты);
	Для Каждого СтрокаДокумента Из ДанныеЗаполнения.ТранспортныеДокументы Цикл
		ЗаполнитьЗначенияСвойств(ТранспортныеДокументы.Добавить(), СтрокаДокумента);
	КонецЦикла;
	
	Дата = ТекущаяДатаСеанса();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли