#Если ТолстыйКлиентОбычноеПриложение ИЛИ Сервер ИЛИ ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда		
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ИмяПредопределенныхДанных) Тогда
		
		ТекстСообщения = НСтр("ru='Разрешено только редактирование существующих настроек, 
		                      |либо создание новых предопределенных'");		
		ВызватьИсключение ТекстСообщения;
		
	КонецЕсли;
			
КонецПроцедуры

#КонецОбласти 
 
#Иначе	
ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте'");
#КонецЕсли
