
#Область ПрограммныйИнтерфейс

// Процедура позволяет конфигурации-потребителю событий зарегистрировать
// свои процедуры обработки сообщений в разрезе имен очередей
//
// Параметры:
//   Обработчики - Соответствие - коллекция зарегистрированных обработчиков событий
//
Процедура ПриРегистрацииОбработчиковСообщений(Знач Обработчики) Экспорт

	// Для регистрации обработчика необходимо использовать следующий код:
	//
	// 		ПолучениеСообщенийСлужебный.ДобавитьОбработчикСообщения(Обработчики, "МойОбщийМодуль.МойМетодОбработки", 2);
	// 		ПолучениеСообщенийСлужебный.ДобавитьОбработчикСообщения(Обработчики, "МойОбщийМодуль.МойМетодОбработки");
	// 
	// 	Последним параметром может передаваться версия обработчика в виже числа - например, 1 или 2
	//	Если этот параметр не указан, используется версия, возвращаемая методом ВерсияПротоколаПоУмолчанию()
	//
	// Метод обработчика для протокола версии 2 должен иметь параметры:
	//  - ТекстСообщения - Строка - Тело принятого сообщения.
	//  - СвойстваСообщения - Соответствие - коллекция свойств сообщения из очереди.
	//  - ПодпискаНаОчередь - СправочникСсылка.ПодпискиНаОчередиСообщений - Ссылка на элемент справочника обрабатываемой подписки на очередь.
	//  - Отказ - Булево -
	//		Отказ = Ложь отправляет на сервер «RabbitMQ» вызов «BasicAck». 
	//		Отказ = Истина отправляет на сервер «RabbitMQ» вызов «BasicReject(ВернутьВОчередь)»
	//		Оба этих ответа считаются обработкой сообщения. 
	//		В обоих случаях сообщение удаляется из очереди.
	//		Но если есть «dead-letters policy» (задана политика управления подобными сообщениями)
	// 		И параметр «ВернутьВОчередь» равен значению «Истина»
	// 			то сообщение, обработанное через «BasicReject», после удаления из очереди перекладывается в другую точку обмена.
	//		Подробнее в FAQ подсистемы.
	//		Значение по умолчанию - Ложь.
	//  - ВернутьВОчередь - Булево - Если признак ВернутьВОчередь будет установлен в Истина и Отказ равен Истина, 
	//		то сообщение считается обработанным и будет перемещено в текущеее место очереди или конец очереди сервера. Подробнее в FAQ подсистемы.
	//		Значение по умолчанию - Ложь.
	//
	// Код обработчика должен быть написан таким образом, чтобы выбрасывать исключения только в том случае, 
	// 	если произошла действительно серьезная ошибка, обработка сообщения сейчас невозможна, 
	//	а сервер очередей должен повторить отправку этого же сообщения еще раз.
	//
	// Метод обработчика для протокола версии 1 должен иметь параметры:
	//  - ТекстСообщения - Строка - Тело принятого сообщения.
	//  - Отказ - Булево - 
	//		Отказ = Ложь отправляет на сервер «RabbitMQ» вызов «BasicAck». 
	//		Отказ = Истина отправляет на сервер «RabbitMQ» вызов «BasicReject(Ложь)»
	//		Оба этих ответа считаются обработкой сообщения. 
	//		В обоих случаях сообщение удаляется из очереди.
	//		Подробнее в FAQ подсистемы.
	//		Значение по умолчанию - Ложь.
	//
	// Код обработчика должен быть написан таким образом, чтобы выбрасывать исключения только в том случае, 
	// 	если произошла действительно серьезная ошибка, обработка сообщения сейчас невозможна, 
	//	а сервер очередей должен повторить отправку этого же сообщения еще раз.
	
	ПолучениеСообщенийСлужебный.ДобавитьОбработчикСообщения(Обработчики, "гкс_ОчередьСообщенийRMQ.ОбработатьСообщение", 2);
	
КонецПроцедуры

// Возвращается версия протокола обработчика сообщения по умолчанию
//
//  Возвращаемое значение:
//   Число - версия протокола
//
Функция ВерсияПротоколаПоУмолчанию() Экспорт
	
	Возврат 1;
	
КонецФункции

#КонецОбласти