#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает цену и ставку НДС в спецификации по номенклатуре из первой строки
//
// Параметры:
//   Спецификация - ДокументСсылка.ЦБТ_СпецификацииКДоговоруКонтрагента - Спецификация
//   Номенклатура - СправочникСсылка.Номенклатура - Номенклатура
//
// Возвращаемое значение:
//  Структура - Структура("Цена, СтавкаНДС, ЦенаВключаетНДС").
//
Функция ПолучитьСуммовыеПоказатели(Спецификация, Номенклатура) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЦБТ_СпецификацияКДоговоруКонтрагентаТовары.Цена КАК Цена,
		|	ЦБТ_СпецификацияКДоговоруКонтрагентаТовары.СтавкаНДС КАК СтавкаНДС,
		|	ЦБТ_СпецификацияКДоговоруКонтрагента.ЦенаВключаетНДС КАК ЦенаВключаетНДС
		|ИЗ
		|	Документ.гкс_СпецификацияКДоговоруКонтрагента.Товары КАК ЦБТ_СпецификацияКДоговоруКонтрагентаТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_СпецификацияКДоговоруКонтрагента КАК ЦБТ_СпецификацияКДоговоруКонтрагента
		|		ПО ЦБТ_СпецификацияКДоговоруКонтрагентаТовары.Ссылка = ЦБТ_СпецификацияКДоговоруКонтрагента.Ссылка
		|ГДЕ
		|	ЦБТ_СпецификацияКДоговоруКонтрагентаТовары.Ссылка = &Ссылка
		|	И ЦБТ_СпецификацияКДоговоруКонтрагентаТовары.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Ссылка", Спецификация);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Показатели = Новый Структура("Цена, СтавкаНДС, ЦенаВключаетНДС");
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		 ЗаполнитьЗначенияСвойств(Показатели, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
	Возврат Показатели;
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ВариантыОтчетов

// Определяет список команд отчетов.
//
// Параметры:
//  КомандыОтчетов - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//  Параметры - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	 ВариантыОтчетовПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти 

#КонецОбласти
	
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Ссылка");
	Поля.Добавить("Номер");
	Поля.Добавить("Дата");
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли