#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ВерсионированиеОбъектов") Тогда
		МодульВерсионированиеОбъектов = ОбщегоНазначения.ОбщийМодуль("ВерсионированиеОбъектов");
		МодульВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
		
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
    Если ИмяСобытия = "WarehouseВнешняяПроба_Запись" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ОбновитьДаннымиWarehouse(Команда)
	
	ВыделенныеСтроки = гкс_ОбщегоНазначенияПЛККлиент.ПроверитьПолучитьВыделенныеВСпискеСсылки(Элементы.Список);
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = ОбновитьДаннымиНаСервере("ExternalSamples_GetById", ВыделенныеСтроки);
	Если ДлительнаяОперация <> Неопределено Тогда
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьЗавершениеОбменаВнешнимиПробами", ЭтотОбъект);
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьСообщения = Истина;
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПробыЗаПериод(Команда)
	
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("Период", ПериодЗагрузки);
	
	ДополнительныеПараметры = Новый Структура("ИмяМетода", "ExternalSamples_GetBetweenDates");
			
	ОткрытьФорму("Документ.гкс_ВнешняяПроба.Форма.ВыборПериода", СтруктураПараметры,,,,, 
		Новый ОписаниеОповещения("ВыборПериодаЗагрузкиЗавершение", ЭтотОбъект, ДополнительныеПараметры),
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
КонецПроцедуры
	
&НаКлиенте
Процедура ПолучитьОбновленияПробЗаПериод(Команда)
	
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("Период", ПериодЗагрузки);
	
	ДополнительныеПараметры = Новый Структура("ИмяМетода", "ExternalSamples_GetBetweenUpdatedOnDates");
			
	ОткрытьФорму("Документ.гкс_ВнешняяПроба.Форма.ВыборПериода", СтруктураПараметры,,,,, 
		Новый ОписаниеОповещения("ВыборПериодаЗагрузкиЗавершение", ЭтотОбъект, 
			ДополнительныеПараметры), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыборПериодаЗагрузкиЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт

	Если ТипЗнч(РезультатВыбора) <> Тип("СтандартныйПериод") Тогда
		Возврат;
	КонецЕсли;

	ПериодЗагрузки = РезультатВыбора;
	
	Если Не(ТипЗнч(ДополнительныеПараметры) = Тип("Структура")
		И ДополнительныеПараметры.Свойство("ИмяМетода")) Тогда
		Возврат;
	КонецЕсли;	
	
	ДлительнаяОперация = ПолучитьПробыНаСервере(ДополнительныеПараметры.ИмяМетода,
		ПериодЗагрузки.ДатаНачала, ПериодЗагрузки.ДатаОкончания);
		
	Если ДлительнаяОперация <> Неопределено Тогда
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ПослеЗагрузкиДанных", ЭтотОбъект);
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьСообщения = Истина;
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	КонецЕсли;
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Функция ОбновитьДаннымиНаСервере(ТипЗапроса, ДокументыВнешнейПробы)
		
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(
		ПараметрыВыполнения,
		"Документы.гкс_ВнешняяПроба.ОбновитьДаннымиИзWarehouse",
		ДокументыВнешнейПробы);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьЗавершениеОбменаВнешнимиПробами(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		Если Результат.Свойство("Сообщения") И Результат.Сообщения <> Неопределено Тогда
			Для Каждого Сообщение Из Результат.Сообщения Цикл
				Сообщение.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		Если Результат.Свойство("Статус") Тогда
			Если Результат.Статус = "Ошибка" Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.КраткоеПредставлениеОшибки);
			ИначеЕсли Результат.Статус = "Выполнено" Тогда
				Элементы.Список.Обновить();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПробыНаСервере(ИмяМетода, ДатаНачала, ДатаОкончания)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	
	ПараметрПериод = Новый Структура;
	ПараметрПериод.Вставить("ДатаНачала", ДатаНачала);
	ПараметрПериод.Вставить("ДатаОкончания", ДатаОкончания);
	
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения,
				"Документы.гкс_ВнешняяПроба.ЗагрузитьВнешниеПробыЗаПериод", ИмяМетода, ПараметрПериод);
	
КонецФункции

&НаКлиенте
Процедура ПослеЗагрузкиДанных(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Если Результат.Статус = "Ошибка" Тогда	
		
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Произошла ошибка при загрузке данных из Warehouse %1 %2'"), 
			Символы.ПС, Результат.КраткоеПредставлениеОшибки);
			
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		
	Иначе
			
		ТекстСообщения = НСтр("ru = 'Загрузка данных из Warehouse завершена'");		
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);	
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
