#Область ОбработчикиСобытийФормы

&НаСервере
Процедура гкс_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ДобавитьИзменитьЭлементыФормы();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДобавитьИзменитьЭлементыФормы()
	
	НовыйЭлемент = Элементы.Добавить("гкс_ПриОтклоненииОтНормыОтклонятьКачество", Тип("ПолеФормы"));
	НовыйЭлемент.Заголовок = НСтр("ru='При отклонении от нормы отклонять качество'");
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Объект.гкс_ПриОтклоненииОтНормыОтклонятьКачество";
		
	НовыйЭлемент = Элементы.Добавить("ОбозначениеВФормуле", Тип("ПолеФормы"), Элементы.ЧисловойДиапазон);
	НовыйЭлемент.Заголовок = НСтр("ru='Обозначение в формуле'");;
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гкс_ОбозначениеВФормуле";
	
	// Гкс+ [ERP-2856] Масягина Е.Ю. 28.10.2021 Добавлено:
	НовыйЭлемент = Элементы.Добавить("гкс_СчитатьСреднееПоФормулеРазжижения", Тип("ПолеФормы"));
	НовыйЭлемент.Заголовок = НСтр("ru='Считать среднее по формуле разжижения'");
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Объект.гкс_СчитатьСреднееПоФормулеРазжижения";
КонецПроцедуры

#КонецОбласти
