#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Определяет является переданное значение РезультатыПробПолучены
// 
// Параметры:
//  Значение - ПеречислениеСсылка.гкс_СостоянияРегистрации - 
// 
// Возвращаемое значение:
//  Булево - Истина, если переданное значение РезультатыПробПолучены
//
Функция ЭтоРезультатыПробПолучены(Значение) Экспорт	
	Возврат Значение = РезультатыПробПолучены;	
КонецФункции

Функция ИмяЗначенияМетаданных(ЗначениеПеречисления) Экспорт
	
	ИмяЗначенияПеречисления = "";
	Если ТипЗнч(ЗначениеПеречисления) = Тип("ПеречислениеСсылка.гкс_СостоянияРегистрации") Тогда
		ИндексЗначенияПеречисления = Перечисления.гкс_СостоянияРегистрации.Индекс(ЗначениеПеречисления);
		ИмяЗначенияПеречисления 
				= Метаданные.Перечисления.гкс_СостоянияРегистрации.ЗначенияПеречисления[ИндексЗначенияПеречисления].Имя;
	КонецЕсли; 
	
	Возврат ИмяЗначенияПеречисления;
		
КонецФункции
 
#КонецОбласти

#КонецЕсли