#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка ИЛИ Отказ Тогда
		Возврат;
	КонецЕсли;

	ДокументРегистрации = Неопределено;
	Если Не ДополнительныеСвойства.Свойство("ДокументРегистрацииДляОбмена", ДокументРегистрации)
		Или Не ЗначениеЗаполнено(ДокументРегистрации) Тогда
		Возврат;
	КонецЕсли;

	Документы.гкс_ОснованиеДляДвиженияЗапасов.ЗарегистрироватьВОбменRMQ(ДокументРегистрации);

КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ДокументРегистрации = Отбор.ДокументРегистрации.Значение;
	Если Не ЗначениеЗаполнено(ДокументРегистрации) И Количество() > 0 Тогда
		ДокументРегистрации = ЭтотОбъект[0].ДокументРегистрации;
	КонецЕсли;

	ДополнительныеСвойства.Вставить("ДокументРегистрацииДляОбмена", ДокументРегистрации);  
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте'");
#КонецЕсли
