#Область СлужебныеПроцедурыИФункции

//@skip-warning
Процедура ПередДобавлениемОбъектаВСписокПрочитанных(Результат, ПрочитанныйОбъект) Экспорт
	
КонецПроцедуры

//@skip-warning
Процедура ПередЗагрузкойОбъектаВПервыйРаз(Результат, ПрочитанныйОбъект, СтандартнаяОбработка) Экспорт
	
	
КонецПроцедуры

//@skip-warning
Процедура ПослеЗагрузкиВсехПрочитанныхОбъектовБезПроверки(Результат) Экспорт
	
	
КонецПроцедуры

//@skip-warning
Процедура ПередЗагрузкойОбъектаСоВсемиПроверками(Результат, ЗагруженныйОбъект, СтандартнаяОбработка) Экспорт
	
	
КонецПроцедуры

//@skip-warning
Процедура ПослеЗагрузкиВсехОбъектовСоВсемиПроверками(Результат) Экспорт
	
	
КонецПроцедуры

#КонецОбласти