#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция возвращает настройки подключения
//
// Возвращаемое значение:
// Структура - структура с данными подключения
//
Функция НастройкиПодключения(ВладельцНастроек) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПодключениеКВебСервисам.Сервер КАК Сервер,
		|	ПодключениеКВебСервисам.Порт КАК Порт,
		|	ПодключениеКВебСервисам.АдресWSDL КАК АдресWSDL,
		|	ПодключениеКВебСервисам.ТехнологияОбмена КАК ТехнологияОбмена,
		|	ПодключениеКВебСервисам.Таймаут КАК Таймаут,
		|	ПодключениеКВебСервисам.ИспользоватьАутентификациюОС КАК ИспользоватьАутентификациюОС,
		|	ПодключениеКВебСервисам.ИспользоватьЗащищенноеСоединение КАК ИспользоватьЗащищенноеСоединение
		|ИЗ
		|	Справочник.гкс_ПодключениеКВебСервисам КАК ПодключениеКВебСервисам
		|ГДЕ
		|	ПодключениеКВебСервисам.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", ВладельцНастроек);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда

		НастройкиПодключения = СтруктураНастроекПоТипуСервиса(ВыборкаДетальныеЗаписи.ТехнологияОбмена);
		ЗаполнитьЗначенияСвойств(НастройкиПодключения, ВыборкаДетальныеЗаписи);

		Если ВыборкаДетальныеЗаписи.ИспользоватьАутентификациюОС Тогда
			НастройкиПодключения.ИспользоватьАутентификациюОС = Истина;
		Иначе
			НастройкиПодключения.ИспользоватьАутентификациюОС = Ложь;

			ИмяПарольПользователя = ИмяПарольПользователя(ВладельцНастроек);
			НастройкиПодключения.ИмяПользователя = ИмяПарольПользователя.Пользователь;
			НастройкиПодключения.Пароль	= ИмяПарольПользователя.Пароль;
		КонецЕсли;

	Иначе
		НастройкиПодключения = Неопределено;
	КонецЕсли;

	Возврат НастройкиПодключения;

КонецФункции

// Функция возвращает настройки подключения
//
// Возвращаемое значение:
// Структура - структура с данными подключения
//				├ Пользователь - строка - логин
//				├ Пароль - строка - пароль
//
Функция ИмяПарольПользователя(ВладельцНастроек) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Результат = Новый Структура;
	Результат.Вставить("Пользователь", "");
	Результат.Вставить("Пароль", "");

	ДанныеБХ = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(ВладельцНастроек, "ИмяПарольПользователя");

	Если Не ДанныеБХ = Неопределено Тогда
		Результат.Пользователь = ДанныеБХ.ИмяПользователя;
		Результат.Пароль = ДанныеБХ.ПарольПользователя;
	КонецЕсли;

	Возврат Результат;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СтруктураНастроекПоТипуСервиса(ТипСервиса)

	НастройкиПодключения = Новый Структура;
	НастройкиПодключения.Вставить("ИмяПользователя");
	НастройкиПодключения.Вставить("Пароль");
	НастройкиПодключения.Вставить("Таймаут", 0);
	НастройкиПодключения.Вставить("ИспользоватьАутентификациюОС", Ложь);
	НастройкиПодключения.Вставить("ИспользоватьЗащищенноеСоединение", Ложь);

	Если ТипСервиса = Перечисления.гкс_ТехнологииОбменаДанными.SOAP Тогда
		НастройкиПодключения.Вставить("АдресWSDL");
	Иначе
		НастройкиПодключения.Вставить("Сервер");
    	НастройкиПодключения.Вставить("Порт");
	КонецЕсли;

	Возврат НастройкиПодключения;

КонецФункции

#КонецОбласти

#КонецЕсли
