#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Параметры.Свойство("ДатаНачала") И Параметры.Свойство("ДатаОкончания") Тогда		
		ДатаНачала = Параметры.ДатаНачала;
		ДатаОкончания = Параметры.ДатаОкончания;
	Иначе
		
		ТекущаяДатаСеанса = ТекущаяДатаСеанса();
		ДатаНачала = НачалоДня(ТекущаяДатаСеанса);
		ДатаОкончания = КонецДня(ТекущаяДатаСеанса);
	КонецЕсли;
		
	Если Параметры.Свойство("Организация") Тогда
		Организация = Параметры.Организация;
	Иначе
		Организация = ОрганизацияПЛК();	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиСобытийЭлементовТаблицыФормыВремяНахожденияТСНаПЛК

&НаКлиенте
Процедура ВремяНахожденияТСНаПЛКВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ВремяНахожденияТСНаПЛК.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "ВремяНахожденияТСНаПЛКДокументРегистрации" Тогда 
		ПоказатьЗначение(, ТекущиеДанные.ДокументРегистрации);
	ИначеЕсли Поле.Имя = "ВремяНахожденияТСНаПЛКНоменклатура" Тогда	
		ПоказатьЗначение(, ТекущиеДанные.Номенклатура);
	ИначеЕсли Поле.Имя = "ВремяНахожденияТСНаПЛКТС" Тогда	
		ПоказатьЗначение(, ТекущиеДанные.ТС);
	ИначеЕсли Поле.Имя = "ВремяНахожденияТСНаПЛКПричинаОтклонения" Тогда

		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("ДокументРегистрации", ТекущиеДанные.ДокументРегистрации);
		ПараметрыОткрытия.Вставить("ЭтоВызовИзФормыПричиныОтклоненияНормПогрузки", Истина);
		
		ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ПричинаОтклоненияПогрузкиЗавершение", ЭтотОбъект);
		
		ОткрытьФорму("Обработка.гкс_ПриемкаТранспорта.Форма.ФормаОтклонениеНормПогрузки", ПараметрыОткрытия,,,,, 
			ОписаниеОповещенияОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
			
	Иначе
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыВремяНахожденияТСНаПЛК 

#Область ОбработчикиКомандФормы 

&НаКлиенте
Процедура ЗаполнитьВремяНахожденияТС(Команда)
	
	Если Не ВозможноЗаполнитьВремяНахожденияТС() Тогда
		Возврат;	
	КонецЕсли;
	
	ЗаполнитьВремяНахожденияТСНаСервере();
		
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ОрганизацияПЛК()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РегистрацияНаПЛК.Организация КАК Организация
	|ИЗ
	|	РегистрСведений.гкс_ВремяНахожденияТСНаПЛК КАК ВремяНахожденияТСНаПЛК
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_РегистрацияНаПЛК КАК РегистрацияНаПЛК
	|		ПО ВремяНахожденияТСНаПЛК.ДокументРегистрации = РегистрацияНаПЛК.Ссылка
	|ГДЕ
	|	ВремяНахожденияТСНаПЛК.ВремяВзвешенБрутто МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ВремяНахожденияТСНаПЛК.ЕстьОтклонение
	|
	|СГРУППИРОВАТЬ ПО
	|	РегистрацияНаПЛК.Организация";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	ДанныеЗапроса = Запрос.Выполнить().Выгрузить();
	Если ДанныеЗапроса.Количество() = 1 Тогда
		Возврат ДанныеЗапроса[0].Организация;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПричинаОтклоненияПогрузкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	                          
	Если ТипЗнч(Результат) = Тип("Структура") И Результат.Свойство("ПричинаОтклонения") <> Неопределено Тогда
		
		ТекущиеДанные = Элементы.ВремяНахожденияТСНаПЛК.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ТекущиеДанные.ПричинаОтклонения = Результат.ПричинаОтклонения;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ВозможноЗаполнитьВремяНахожденияТС()
	
	ВозможноЗаполнитьВремяНахожденияТС = Истина;
	
	Если Не ЗначениеЗаполнено(ДатаНачала) Или Не ЗначениеЗаполнено(ДатаОкончания) Тогда
		ВозможноЗаполнитьВремяНахожденияТС = Ложь;
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Незаполнен период.'"));
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		ВозможноЗаполнитьВремяНахожденияТС = Ложь;
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Незаполнена организация.'"));
	КонецЕсли;
	
	Возврат ВозможноЗаполнитьВремяНахожденияТС;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьВремяНахожденияТСНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВремяНахожденияТСНаПЛК.ДокументРегистрации КАК ДокументРегистрации,
	|	РегистрацияНаПЛК.Номенклатура КАК Номенклатура,
	|	РегистрацияНаПЛК.ТранспортноеСредство КАК ТС,
	|	ВремяНахожденияТСНаПЛК.ВремяВзвешенБрутто КАК ВремяВзвешенБрутто,
	|	ВремяНахожденияТСНаПЛК.ВремяВзвешенТара КАК ВремяВзвешенТара,
	|	ВремяНахожденияТСНаПЛК.Отклонение КАК Отклонение,
	|	ВремяНахожденияТСНаПЛК.Комментарий КАК ПричинаОтклонения,
	|	РегистрацияНаПЛК.Организация КАК Организация,
	|	ВремяНахожденияТСНаПЛК.ВремяНаПЛК КАК ВремяНаПЛК
	|ИЗ
	|	РегистрСведений.гкс_ВремяНахожденияТСНаПЛК КАК ВремяНахожденияТСНаПЛК
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_РегистрацияНаПЛК КАК РегистрацияНаПЛК
	|		ПО ВремяНахожденияТСНаПЛК.ДокументРегистрации = РегистрацияНаПЛК.Ссылка
	|ГДЕ
	|	РегистрацияНаПЛК.Организация = &Организация
	|	И ВремяНахожденияТСНаПЛК.ВремяВзвешенБрутто МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ВремяНахожденияТСНаПЛК.ЕстьОтклонение";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	ВремяНахожденияТСНаПЛК.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции