
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает Код локализации базы.
// 
// Возвращаемое значение:
//  Строка - Код локализации базы
Функция КодЛокализацииБазы() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СтраныМира.КодАльфа2 КАК КодАльфа2
	|ИЗ
	|	Справочник.СтраныМира КАК СтраныМира
	|ГДЕ
	|	СтраныМира.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Константы.гкс_СтранаЛокализации.Получить());
	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Результат = НРег(ВыборкаДетальныеЗаписи.КодАльфа2);
	Иначе
		Результат = "";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
