#Если ТолстыйКлиентОбычноеПриложение ИЛИ Сервер ИЛИ ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПараметыМетодаОбработки(Знач ПотокСобытий = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ПотокСобытий) Тогда
		ПотокСобытий = Справочники.гкс_ПотокиСобытий.ОсновнойПотокПоУмолчанию();
	КонецЕсли;
	
	КлючШаблон = "ОбработкаВходящихСообщенийRMQ#%1"; // Не локализуется
	ИмяМетода = "гкс_ОбработкаОчередиВходящихСообщенийRMQ.ОбработатьСообщенияОчереди";
	
	Ключ = СтрШаблон(КлючШаблон, XMLСтрока(ПотокСобытий));
	Наименование = СтрШаблон("Обработка очереди входящих сообщений. (%1)", Строка(ПотокСобытий));
	
	Параметры = Новый Структура;	
	Параметры.Вставить("Ключ", Ключ);
	Параметры.Вставить("ИмяМетода", ИмяМетода);
	Параметры.Вставить("Наименование", Наименование);
	              
	Возврат Параметры;
	
КонецФункции

#КонецОбласти

#Область СлужебныепроцедурыФункции

Функция СформироватьГруппыОбработкиСообщений(Выборка) Экспорт
	
	ДанныеОчереди = Новый Структура;
	ДанныеОчереди.Вставить("Очередь", Выборка);
	ДанныеОчереди.Вставить("ИмяОчереди", "ОчередьОбработкиВходящихСообщений");
	ДанныеОчереди.Вставить("КоличествоПотоков", КоличествоПотоковВыполнения());
	
	Возврат гкс_АлгоритмыИСтруктурыОбработкиИАС.СформироватьГруппыОбработкиОбъектовИзОчереди(ДанныеОчереди);
		
КонецФункции

#Область НастройкиФормированияСообщений

Функция КоличествоПотоковВыполнения() Экспорт
	
	КоличествоПотоков = 
	гкс_ОчередьСообщенийRMQПовтИсп.НастройкаИнтеграционногоАдаптера("МаксимальноеКоличествоПотоковОбработки");	
	Если НЕ ЗначениеЗаполнено(КоличествоПотоков) Тогда		
		КоличествоПотоков = 5;		
	КонецЕсли;
	
	Возврат КоличествоПотоков;
	
КонецФункции

Функция РазмерПорцииОбработки() Экспорт
	
	РазмерПорцииОбработки = 
	гкс_ОчередьСообщенийRMQПовтИсп.НастройкаИнтеграционногоАдаптера("РазмерПорцииОбработки");
	Если НЕ ЗначениеЗаполнено(РазмерПорцииОбработки) Тогда		
		РазмерПорцииОбработки = 50;		
	КонецЕсли;
	
	Возврат РазмерПорцииОбработки;
	
КонецФункции

Функция ТаймаутОбработки() Экспорт
	
	ТаймаутОбработки = гкс_ОчередьСообщенийRMQПовтИсп.НастройкаИнтеграционногоАдаптера("ТаймаутОбработкиПорцииСообщений");	
	Если НЕ ЗначениеЗаполнено(ТаймаутОбработки) Тогда		
		ТаймаутОбработки = 300; // 5 минут по умолчанию		
	КонецЕсли;
	
	Возврат ТаймаутОбработки;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли