#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает настройки напоминания
// 
// Параметры:
//  Объект - СправочникСсылка.ИдентификаторыОбъектовМетаданных - Ссылка на идентификатор объекта метаданных
//
// Возвращаемое значение:
//  Структура, Неопределено - настройки напоминания.
//
Функция ПолучитьНастройкиНапоминания(Объект) Экспорт
	
	Настройки = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РСНастройкиНапоминанияПользователя.Настройки КАК Настройки
		|ИЗ
		|	РегистрСведений.гкс_НастройкиНапоминанияПользователя КАК РСНастройкиНапоминанияПользователя
		|ГДЕ
		|	РСНастройкиНапоминанияПользователя.Объект = &Объект";
	
	Запрос.УстановитьПараметр("Объект", Объект);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Настройки = Выборка.Настройки.Получить();
	КонецЦикла;
	
    Возврат Настройки;

КонецФункции

#КонецОбласти

#КонецЕсли