#Область ПрограммныйИнтерфейс

Функция ПолучитьФабрикуПоМодели(Модель) Экспорт
	
	Возврат Справочники.гкс_МоделиДанныхXDTO.ПолучитьФабрикуПоМодели(Модель);
	
КонецФункции

Функция МассивВерсийФорматаВКонфигурации() Экспорт
	
	СуществующиеВерсииФормата = гкс_ОбменЧерезУниверсальныйФормат.ТаблицаВерсииФорматаВКонфигурации();
	
	ТаблицаВМассивеИсходная = гкс_ОбщегоНазначения.ТаблицаЗначенийВМассив(СуществующиеВерсииФормата);
	
	ТаблицаВМассивеПодготовительная = Новый Массив;
	Для Каждого ЭлементМассива Из ТаблицаВМассивеИсходная Цикл
		ТаблицаВМассивеПодготовительная.Добавить(Новый ФиксированнаяСтруктура(ЭлементМассива));		
	КонецЦикла;
		
	Возврат Новый ФиксированныйМассив(ТаблицаВМассивеПодготовительная); 	
	
КонецФункции

Функция ПолучитьНастройкиФормата(Формат) Экспорт
	
	Настройки = гкс_ОчередьСообщенийRMQВызовСервера.ПолучитьНастройкиФорматаED(Формат);
	Если НЕ ТипЗнч(Настройки) = Тип("Структура") Тогда
		Возврат Новый ФиксированнаяСтруктура;		
	КонецЕсли;
	
	Возврат Новый ФиксированнаяСтруктура(Настройки);
	
КонецФункции

#КонецОбласти
