#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// Параметры:
//   Настройки - см. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.Настройки.
//   НастройкиОтчета - см. ВариантыОтчетов.ОписаниеОтчета.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
		
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ПриемкаАвто");
	НастройкиВарианта.Наименование = НСтр("ru = 'Отчет по приемке авто'");
	НастройкиВарианта.Описание = НСтр("ru = 'Отчет по приемке авто'");
	
	НастройкиВарианта.ВидимостьПоУмолчанию = Истина;
	
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ПриемкаЖД");
	НастройкиВарианта.Наименование = НСтр("ru = 'Отчет по приемке ЖД'");
	НастройкиВарианта.Описание = НСтр("ru = 'Отчет по приемке ЖД'");
	
	НастройкиВарианта.ВидимостьПоУмолчанию = Истина;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти

#КонецЕсли