#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЭтотОбъект.Значение Тогда
		Константы.гкс_ИспользоватьИнтеграциюСWarehouse.Установить(Ложь);
		Константы.гкс_ИспользоватьИнтеграциюСКверион.Установить(Ложь);
		Константы.гкс_ИспользоватьИнтеграциюСРПВ.Установить(Ложь);
		Константы.гкс_ИспользоватьИнтеграциюССАРА.Установить(Ложь);
		Константы.гкс_ИспользоватьКонтрольВесаОтгрузки.Установить(Ложь);
		Константы.гкс_ИспользоватьКонтрольВместимостиСкладов.Установить(Ложь);
		Константы.гкс_ИспользоватьКонтрольПоПредельнымУровнямКачестваПоставщиков.Установить(Ложь);
		Константы.гкс_ИспользоватьКонтрольПревышенияВесаАвтомобиля.Установить(Ложь);
		Константы.гкс_ИспользоватьПредварительнуюРегистрациюНаКПП.Установить(Ложь);
		Константы.гкс_ИспользоватьЭлектронноеТабло.Установить(Ложь);
		Константы.гкс_ИспользоватьЭлектроннуюОчередь.Установить(Ложь);
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли