
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ФормаВладелец = ПараметрыВыполненияКоманды.Источник;
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Фрахт", ПараметрКоманды);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора); 
	ОткрытьФорму("Справочник.гкс_Лоты.ФормаСписка",
		ПараметрыФормы, ФормаВладелец, ФормаВладелец.УникальныйИдентификатор, ПараметрыВыполненияКоманды.Окно);
		
КонецПроцедуры

#КонецОбласти