
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда 
		Возврат;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаПечать(Команда)
	
	НаименованиеДляПечати = ПолучитьНаименованиеДляПечатиЛаборанта(Лаборант);
	
	ДанныеПечати = Новый Структура;
	ДанныеПечати.Вставить("Лаборант", НаименованиеДляПечати);	
	
	Закрыть(Новый Структура("ДанныеПечати", ДанныеПечати));

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьНаименованиеДляПечатиЛаборанта(Лаборант)
	
	Возврат гкс_ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Лаборант, "Наименование");
	
КонецФункции

#КонецОбласти