#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьВидимостьДоступностьЭлементовФормы();	
КонецПроцедуры  

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы


&НаКлиенте
Процедура ПоказательПриИзменении(Элемент)
	Объект.ОтклонятьКачество = ОтклонятьКачествоПоказателя(Объект.Показатель);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыиФункции

&НаСервереБезКонтекста
Функция ОтклонятьКачествоПоказателя(Показатель)
	Возврат
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Показатель, "гкс_ПриОтклоненииОтНормыОтклонятьКачество");
КонецФункции

&НаСервере
Процедура УстановитьВидимостьДоступностьЭлементовФормы() 
	
	ГруппыТС = Объект.ТипВходногоКонтроля = 
		Перечисления.гкс_ТипыУсиленногоКонтроляКачества.ГруппыТС;
	Элементы.КоличествоТС.Видимость = ГруппыТС;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ТипВходногоКонтроляПриИзменении(Элемент)
	Если Объект.ТипВходногоКонтроля <> 
		ПредопределенноеЗначение("Перечисление.гкс_ТипыУсиленногоКонтроляКачества.ГруппыТС") Тогда
		Объект.КоличествоТС = 0;
	КонецЕсли;
	
	УстановитьВидимостьДоступностьЭлементовФормы();
	
КонецПроцедуры

#КонецОбласти
