#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Создает издателя с определенным типом точки обмена "fanout/direct/topic"
//
// Параметры:
//  ИмяПубликации - идентификатор потока событий
//                - exchange_name в терминах RMQ
//  ТипОбмена     - тип точки обмена
//
// Возвращаемое значение:
//   Класс ИздательСобытий
//
Функция СоздатьПоТипуОбмена(Знач ИмяТочкиДоступа, Знач ТипОбмена, Знач КлючСоединения = "") Экспорт

	Издатель = Обработки.ИздательСобытий.Создать();
	Издатель.ИмяТочкиОбмена = ИмяТочкиДоступа;
	Издатель.ТипТочкиОбмена = ТипОбмена;
	Издатель.КлючСоединения = КлючСоединения;
	
	Возврат Издатель;

КонецФункции // СоздатьПоТипуОбмена()

#КонецОбласти

#КонецЕсли