
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидПеревозки", 
		ПредопределенноеЗначение("Перечисление.гкс_ТипРегистрации.Приемка"));
		
	ПараметрыФормы.Вставить("ТипРегистрации", 
		ПредопределенноеЗначение("Перечисление.гкс_ТипыТранспортныхСредствДоставки.Автомобиль"));
		
	Если гкс_ПриемкаТранспортаВызовСервера.ФормироватьКомпозитныйЛабораторныйАнализ() Тогда
		ИмяФормы = "Обработка.гкс_ПриемкаТранспорта.Форма.ФормаПринятыеТС_by";
	Иначе	
		ИмяФормы = "Обработка.гкс_ПриемкаТранспорта.Форма.ФормаПринятыеТС";			
	КонецЕсли;
	
	ОткрытьФорму(ИмяФормы, ПараметрыФормы, 
	             ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, 
	             ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);

КонецПроцедуры