#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ОбработатьКомандуНаСервере(ПараметрКоманды);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбработатьКомандуНаСервере(СсылкаНаЗадание)
	
	РеквизитыЗадания = гкс_ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаЗадание, "Активно, ОтборПотокСобытий");
	
	Если НЕ РеквизитыЗадания.Активно Тогда
		гкс_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		                НСтр("ru='Задание не активно. Интерактивное выполнение невозможно'"));
		Возврат;
	КонецЕсли;
	
	//@skip-warning
	гкс_ОчередьСообщенийRMQСлужебный.ОбработатьОчередьВходящихСообщений(РеквизитыЗадания["ОтборПотокСобытий"]);
	
КонецПроцедуры

#КонецОбласти
