#Область ОписаниеПеременных

&НаКлиенте
Перем ИдентификаторЗамераПроведение;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	УстановитьВидимостьДоступностьЭлементовФормы();

	Если Не ЗначениеЗаполнено(Объект.Статус) Тогда
		Объект.Статус = Перечисления.гкс_СтатусыЛабораторногоАнализа.ОтборПробы;
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
		
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		гкс_УправлениеДоступом.ОпределитьДоступностьВозможностьИзмененияДокументаПоРеестру(ЭтотОбъект, Объект);
	КонецЕсли;
					
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
        ИдентификаторЗамераПроведение = 
		ОценкаПроизводительностиКлиент.ЗамерВремени("ПроведениеДокумента.Интерактивно.ЛабораторныйАнализ", 
		                                            Истина);
		
	ИначеЕсли ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Если Не ПараметрыЗаписи.Свойство("ЕстьВопросыПередЗаписью")
			И ДокументУчаствуетВУсиленномКонтроле(
				Объект.гкс_ДокументРегистрации, Объект.гкс_НазначениеИспользованияКачества) Тогда
				
			Отказ = Истина;	
			ОписаниеОповещенияОЗавершении = 
				Новый ОписаниеОповещения("ПодверждениеРаспроведения", ЭтотОбъект, ПараметрыЗаписи); 
			ТекстВопроса = 
				СтрШаблон(НСтр("ru = 'У документа есть данные по усиленному контролю. Уверены что хотите распровести?'"));
				
			ПоказатьВопрос(ОписаниеОповещенияОЗавершении, ТекстВопроса, 
				РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Нет);	
					
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ОграничитьДоступКФорме();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ИзменениеЛабараторногоАнализа");
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ОценкаПроизводительностиКлиент.УстановитьПризнакОшибкиЗамера(ИдентификаторЗамераПроведение, Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НазначениеИспользованияКачестваПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	ЗаполнитьПоСпецификацииДляИсследования();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ЗаполнитьПоСпецификацииДляИсследования();
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	
	ОбновитьДатуДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументРегистрацииПриИзменении(Элемент)
	ЗаполнитьПоСпецификацииДляИсследования();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКачественныеПоказатели

&НаКлиенте
Процедура КачественныеПоказателиЗначениеПриИзменении(Элемент)

	ТекущиеДанные = Элементы.КачественныеПоказатели.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда	
		Возврат;	
	КонецЕсли;
	
	ОбновитьСоответствиеБазисуВСтроке(ТекущиеДанные.Показатель);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	гкс_ОбщегоНазначенияПЛККлиент.ПровестиИЗакрыть(ЭтотОбъект, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПровестиДокумент(Команда)
	гкс_ОбщегоНазначенияПЛККлиент.Провести(ЭтотОбъект, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	гкс_ОбщегоНазначенияПЛККлиент.Записать(ЭтотОбъект, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоСпецификации(Команда)
	
    ЗаполнитьПоСпецификацииДляИсследования();	

КонецПроцедуры

&НаКлиенте
Процедура ПодобратьСпецификацию(Команда)
	
	ПодобратьСпецификациюНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#Область РаботаСФормой

&НаСервере
Процедура УстановитьВидимостьДоступностьЭлементовФормы()
	
	УстановитьВидимостьЭлементовФормы();
		
	Если Параметры.Ключ.Пустая() И Параметры.Свойство("ИзАРМа") Тогда		
		ОграничитьДоступностьЭлементовЕслиФормаПодчинена();		
	КонецЕсли;
	
	ОграничитьДоступКФорме();
	
КонецПроцедуры

&НаСервере
Процедура ОграничитьДоступностьЭлементовЕслиФормаПодчинена()
	
	Элементы.ДокументРегистрация.Доступность = Ложь;
	Элементы.Склад.Доступность = Ложь;
	Элементы.Номеннклатура.Доступность = Ложь;
	Элементы.Организация.Доступность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовФормы()
	
	Элементы.Дата.Видимость = Не ЗначениеЗаполнено(Объект.гкс_МестнаяДата);
	Элементы.МестнаяДата.Видимость = ЗначениеЗаполнено(Объект.гкс_МестнаяДата); 
	
	Если Объект.гкс_НазначениеИспользованияКачества = Перечисления.гкс_НазначенияИспользованияКачества.Приемка Тогда
		Элементы.ГруппаПоказателиДляКомпозита.Видимость = Истина;
	Иначе
		Элементы.ГруппаПоказателиДляКомпозита.Видимость = Ложь;
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Процедура ОграничитьДоступКФорме()
	
	Если Не ТолькоПросмотр Тогда // может быть уже установлен, если оформлен реестр ЗПП-3 
		ТолькоПросмотр = Не (Пользователи.ЭтоПолноправныйПользователь() ИЛИ ЛабораторныйАнализВыполняется());
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ОбновитьДатуДокумента()
	Объект.Дата = ТекущаяДатаСеанса();
	Объект.гкс_МестнаяДата = Дата(1, 1, 1, 0, 0, 0);
	УстановитьВидимостьЭлементовФормы();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСоответствиеБазисуВСтроке(Показатель)
				
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ПроверитьСоотвествиеКачеству(Показатель);
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
					
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоСпецификацииДляИсследования()

	Если Объект.КачественныеПоказатели.Количество() <> 0 Тогда

		ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ЗаполнитьПоСпецификацииЗавершение", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Табличная часть ""Качественные показатели"" будет перезаполнена. 
							|Продолжить выполнение операции?'");

		ПоказатьВопрос(ОписаниеОповещенияОЗавершении, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 0);
	Иначе
		ЗаполнитьПоказателиДляИсследования();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоСпецификацииЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьПоказателиДляИсследования();		
	КонецЕсли;
    
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоказателиДляИсследования()
		
	ДокументОбъект = РеквизитФормыВЗначение("Объект"); 
	ДокументОбъект.ЗаполнитьПоказателиДляИсследования();
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Функция ЛабораторныйАнализВыполняется()
	
	Возврат Не Объект.Статус = Перечисления.гкс_СтатусыЛабораторногоАнализа.Выполнен;
	
КонецФункции

&НаСервере
Процедура ПодобратьСпецификациюНаСервере()
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	
    ТекущийОбъект.НормативнаяСертификация = гкс_РаботаСПоказателямиНоменклатуры.
		НормативнаяСертификацияПоФактическомуКачеству(ТекущийОбъект);
		
	ТекущийОбъект.ПроверитьСоотвествиеКачеству();
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");

КонецПроцедуры

&НаСервереБезКонтекста
Функция ДокументУчаствуетВУсиленномКонтроле(ДокументРегистрации, НазначениеИспользования)
	Если Не ПолучитьФункциональнуюОпцию("гкс_ИспользоватьЗаблокированныеТС") Тогда
		Возврат Ложь;
	КонецЕсли;	
	Назначения = Новый СписокЗначений;
	Назначения.Добавить(Перечисления.гкс_НазначенияИспользованияКачества.Приемка);
	Назначения.Добавить(Перечисления.гкс_НазначенияИспользованияКачества.ПромежуточныйКомпозит);
	Если Назначения.НайтиПоЗначению(НазначениеИспользования) = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;    
	
	Возврат 
		гкс_ВходнойКонтрольКачества.ЕстьДанныеПоУсиленномуКонтролю(ДокументРегистрации);	  
	
КонецФункции	

&НаКлиенте
Процедура ПодверждениеРаспроведения(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		гкс_ОбщегоНазначенияПЛККлиент.ОтменаПроведения(ЭтотОбъект, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
