
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПараметрыВыбораДляТипаСсылки();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПриложениеПриИзменении(Элемент)
	ЗаполнитьСопоставлениеПоСценарию();
КонецПроцедуры

&НаКлиенте
Процедура ТипСсылкиПриИзменении(Элемент)
	ЗаполнитьСопоставлениеПоСценарию();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗадатьСоответствие(Команда)
	
	Отказ = Ложь;
	ДлительнаяОперация = НачатьУстановкуСоответствия(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
		
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Вставить("ТекстСообщения", "Выполняется установка соответствия");
	ПараметрыОжидания.Вставить("Заголовок", "Выполнение операции");
	ПараметрыОжидания.Вставить("ВыводитьСообщения", Истина);
		
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗаданияСоответствия", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОповещения, ПараметрыОжидания);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьПараметрыВыбораДляТипаСсылки()
	
	КоллекцияИдентификаторов = КоллекцияДоступныхТипов();

	НовыеЗначения 	= Новый ФиксированныйМассив(КоллекцияИдентификаторов);
	НовыйПараметр 	= Новый ПараметрВыбора("Отбор.Ссылка", НовыеЗначения);
	НовыйМассив 	= Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	НовыеПараметры 	= Новый ФиксированныйМассив(НовыйМассив);
	
	Элементы.ТипСсылки.ПараметрыВыбора = НовыеПараметры;
	
КонецПроцедуры

&НаСервере
Функция КоллекцияДоступныхТипов()
	
	Результат = Новый Массив;
	ОписаниеОбъектовМетаданных = Новый Массив;
	ОписаниеОбъектовМетаданных.Добавить(Метаданные.Справочники.Номенклатура);
	ОписаниеОбъектовМетаданных.Добавить(Метаданные.Справочники.гкс_ТочкиМаршрута);
	
	КоллекцияИдентификаторов = ОбщегоНазначения.ИдентификаторыОбъектовМетаданных(
		ОписаниеОбъектовМетаданных);
		
	Для Каждого ЭлементКоллекции Из КоллекцияИдентификаторов Цикл 
		Результат.Добавить(ЭлементКоллекции.Значение);
		Результат.Добавить(ЭлементКоллекции.Значение.Родитель);
	КонецЦикла;
	
	Возврат ОбщегоНазначенияКлиентСервер.СвернутьМассив(Результат);

КонецФункции

&НаСервере
Функция ЭтоНоменклатураДляМорскойЛогистики()
	// TODO: дописать определение приложения для МЛ
	Возврат ТипСсылки = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Метаданные.Справочники.Номенклатура);
КонецФункции

&НаСервере
Функция ЭтоТочкиМаршрутаДляМорскойЛогистики()
	// TODO: дописать определение приложения для МЛ
	Возврат ТипСсылки = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Метаданные.Справочники.гкс_ТочкиМаршрута);
КонецФункции

&НаСервере
Процедура ЗаполнитьСопоставлениеПоСценарию()
	
	СопоставлениеОбъектов.Очистить();
	Если ЭтоНоменклатураДляМорскойЛогистики() Тогда
		ЗаполнитьСопоставлениеДляНоменклатурыМорскойЛогистики();
	ИначеЕсли ЭтоТочкиМаршрутаДляМорскойЛогистики() Тогда
		ЗаполнитьСопоставлениеДляТочекМаршрутаМорскойЛогистики();
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСопоставлениеДляНоменклатурыМорскойЛогистики()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ФрахтГрузы.Номенклатура КАК Ссылка,
	|	ФрахтГрузы.Номенклатура КАК ЗаменяемаяСсылка,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ФрахтГрузы.Номенклатура) КАК Идентификатор
	|ИЗ
	|	Документ.гкс_Фрахт.Грузы КАК ФрахтГрузы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО ФрахтГрузы.Номенклатура = СправочникНоменклатура.Ссылка
	|ГДЕ
	|	СправочникНоменклатура.Ссылка ЕСТЬ NULL";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	СопоставлениеОбъектов.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСопоставлениеДляТочекМаршрутаМорскойЛогистики()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ФрахтСклады.Склад КАК Ссылка,
	|	ФрахтСклады.Склад КАК ЗаменяемаяСсылка,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ФрахтСклады.Склад) КАК Идентификатор
	|ИЗ
	|	Документ.гкс_Фрахт.Склады КАК ФрахтСклады
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.гкс_ТочкиМаршрута КАК СправочникТочкиМаршрута
	|		ПО ФрахтСклады.Склад = СправочникТочкиМаршрута.Ссылка
	|ГДЕ
	|	СправочникТочкиМаршрута.Ссылка ЕСТЬ NULL";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	СопоставлениеОбъектов.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&НаСервере
Функция НачатьУстановкуСоответствия(Отказ)
 	
	Если Не ПроверитьЗаполнение() Тогда
		Отказ = Истина;;
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.Вставить("ОжидатьЗавершение", Неопределено);
	ПараметрыВыполнения.Вставить("ЗапуститьВФоне"	, Истина);
	
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("Приложение"			, Приложение);
	ПараметрыМетода.Вставить("ТипСсылки"			, ТипСсылки);
	ПараметрыМетода.Вставить("СопоставлениеОбъектов", СопоставлениеОбъектов.Выгрузить());
	
	ИмяМетода = "Обработки.гкс_СопоставлениеОбъектовВнешнихСистем.ЗадатьСоответствиеМеждуОбъектами";
	
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(
		ПараметрыВыполнения, ИмяМетода, ПараметрыМетода, УникальныйИдентификатор);
	
КонецФункции

#Область ОбратныеВызовы

&НаКлиенте
Процедура ПослеЗаданияСоответствия(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		ТекстСообщения = НСтр("ru = 'Установка соответствия выполнена успешно'");
		ПоказатьПредупреждение(Неопределено, ТекстСообщения);
		ЗаполнитьСопоставлениеПоСценарию();
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		
		ТекстСообщения = СтрШаблон(НСтр("ru = 'При установке соответствия произошла ошибка %1 %2'"), 
			Символы.ПС, Результат.КраткоеПредставлениеОшибки);
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		
	Иначе // Выполняется/Отменено
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
