#Область ПрограммныйИнтерфейс

// Вызывает сокращение журнала событий. Удаляет устаревшие записи из РС "Журнал событий HTTP"
Процедура гкс_СократитьЖурналСобытийHTTPСервисов() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(
		Метаданные.РегламентныеЗадания.гкс_СократитьЖурналСобытийHTTPСервисов);
	
	Если ПустаяСтрока(ИмяПользователя()) Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	РегистрыСведений.гкс_ЖурналСобытийHTTPСервисов.СократитьЗаписиЖурнала();
	
КонецПроцедуры

#КонецОбласти
