
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает действующие подписки на события для оповещений
// 
// Параметры:
//	 ПодпискаДействует - Булево - условие на активность подписки
//
// Возвращаемое значение:
//  Соотвествие - соответствие ("Имя предопределенных данных", "Ссылка")
//
Функция ПодпискиНаРассылки(ПодпискаДействует = Неопределено) Экспорт
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПодпискиНаРассылкиИОповещения.Ссылка КАК Ссылка,
	|	ПодпискиНаРассылкиИОповещения.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
	|ИЗ
	|	Справочник.гкс_ПодпискиНаРассылкиИОповещения КАК ПодпискиНаРассылкиИОповещения
	|ГДЕ
	|	ПодпискиНаРассылкиИОповещения.Предопределенный
	|	И &УсловиеАктивности";
	
	Если ПодпискаДействует <> Неопределено Тогда
		Запрос.УстановитьПараметр("Действует", ПодпискаДействует);
		ТекстЗамены = "ПодпискиНаРассылкиИОповещения.ПодпискаДействует = &Действует";
	Иначе
		ТекстЗамены = "ИСТИНА";
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеАктивности", ТекстЗамены);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Результат.Вставить(
			ВыборкаДетальныеЗаписи.ИмяПредопределенныхДанных, ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

#КонецОбласти

#КонецОбласти

#КонецЕсли
