#Область СлужебныеПроцедурыИФункции

#Область ЗаполнениеОбъектов

Процедура ЗаполнитьПрибытиеСуднаПоДаннымФрахта(Форма, ЗаполнятьШапку = Истина) Экспорт
	
	Объект = Форма.Объект;
	Объект.ТранспортныеДокументы.Очистить();
	
	ДанныеЗаполнения = гкс_МорскаяЛогистикаВызовСервера.ДанныеЗаполненияПрибытияСуднаНаПЛК(Объект.Фрахт);
	Если ЗаполнятьШапку Тогда
		ЗаполнитьЗначенияСвойств(Объект, ДанныеЗаполнения.Реквизиты);
	КонецЕсли;
	
	Для Каждого СтрокаДокумента Из ДанныеЗаполнения.ТранспортныеДокументы Цикл
		ЗаполнитьЗначенияСвойств(Объект.ТранспортныеДокументы.Добавить(), СтрокаДокумента);
	КонецЦикла;	
	
КонецПроцедуры

Функция ВесПоТранспортномуДокументу(ТранспортныйДокумент) Экспорт
	Возврат гкс_МорскаяЛогистикаВызовСервера.ВесПоТранспортномуДокументу(ТранспортныйДокумент);
КонецФункции

#КонецОбласти

#КонецОбласти