
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает числовое значение процента ставки НДС
//
// Параметры:
//  СтавкаНДС - ПеречислениеСсылка.СтавкиНДС - , валюта, по которой необходимо 
//  
// Возвращаемое значение:
//  Соотвествие - соответствие ставкам НДС числовых значений НДС
//
Функция ПроцентСтавкиНДС(СтавкаНДС) Экспорт
	
	СоответствиеЗначенийСтавокУчетаНДС = СоответствиеЗначенийСтавокУчетаНДС();	
	ЗначениеСтавки = СоответствиеЗначенийСтавокУчетаНДС.Получить(СтавкаНДС);
	
	Возврат ?(ЗначениеСтавки = Неопределено, 0, ЗначениеСтавки);
		
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Формирует соответствие ставок НДС их числовым значениям
//  
// Возвращаемое значение:
//  Соотвествие - соответствие ставкам НДС числовых значений НДС
//
Функция СоответствиеЗначенийСтавокУчетаНДС()
	
	СоответствиеСтавокНДС = Новый Соответствие;
	
	Ставки = Перечисления.СтавкиНДС;
	
	СоответствиеСтавокНДС.Вставить(Ставки.БезНДС, 0);
	СоответствиеСтавокНДС.Вставить(Ставки.НДС0, 0);
	СоответствиеСтавокНДС.Вставить(Ставки.НДС10, 10);
	СоответствиеСтавокНДС.Вставить(Ставки.НДС10_110, 10);
	СоответствиеСтавокНДС.Вставить(Ставки.НДС12, 12);
	СоответствиеСтавокНДС.Вставить(Ставки.НДС18, 18);
	СоответствиеСтавокНДС.Вставить(Ставки.НДС18_118, 18);
	СоответствиеСтавокНДС.Вставить(Ставки.НДС20, 20);
	СоответствиеСтавокНДС.Вставить(Ставки.НДС20_120, 20);
		
	Возврат СоответствиеСтавокНДС;     
	
КонецФункции

#КонецОбласти

#КонецЕсли