// @strict-types


#Область ПрограммныйИнтерфейс

// Стандартная для данной конфигурации функция форматирования сумм
//
// Параметры: 
//  Сумма  - Число - величина, которую мы хотим форматировать, 
//  ЧН - Строка - форматная строка, представляющая нулевое значение числа,
//  ЧРГ - Строка - строка символ-разделитель групп целой части числа.
//
// Возвращаемое значение:
//  РезультирующаяСтрока - Строка - отформатированная должным образом строковое представление суммы.
//
Функция ФорматСумм(Знач Сумма, ЧН = "", ЧРГ = "") Экспорт
	
	Сумма = ?(Сумма < 0, -Сумма, Сумма);
	ФорматнаяСтрока = "ЧДЦ=2" +
					?(НЕ ЗначениеЗаполнено(ЧН), "", ";" + "ЧН=" + ЧН) +
					?(НЕ ЗначениеЗаполнено(ЧРГ),"", ";" + "ЧРГ=" + ЧРГ);
	РезультирующаяСтрока = СокрЛ(Формат(Сумма, ФорматнаяСтрока));
	
	Возврат РезультирующаяСтрока;

КонецФункции // ФорматСумм()

// ФИО руководителя лаборатории
//
// Возвращаемое значение:
//   Строка 
//
Функция РуководительЛабораторииФИО() Экспорт
	РуководительЛаборатории = 
		гкс_ОбщегоНазначенияВызовСервера.ПроизвольныйПредопределенныйОбъект("РуководительЛаборатории");
	Если ЗначениеЗаполнено(РуководительЛаборатории) Тогда
		РуководительЛабораторииФИО = 
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РуководительЛаборатории, "Наименование");	
		РуководительЛабораторииФИО = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(РуководительЛабораторииФИО);
	Иначе
		РуководительЛабораторииФИО = "";
	КонецЕсли;
	Возврат РуководительЛабораторииФИО;
КонецФункции

#КонецОбласти

