
#Если ТолстыйКлиентОбычноеПриложение ИЛИ Сервер ИЛИ ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

// Обработка проверки заполнения.
// 
// Параметры:
//  Отказ - Булево - Отказ
//  ПроверяемыеРеквизиты - Массив - Проверяемые реквизиты
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ИсключаемыеРеквизиты = Новый Массив;
	Если гкс_РаботаСВебСервисами.ЭтоSOAP(ТехнологияОбмена) Тогда
		ИсключаемыеРеквизиты.Добавить("Сервер");
	Иначе
		ИсключаемыеРеквизиты.Добавить("АдресWSDL");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, ИсключаемыеРеквизиты);
	
КонецПроцедуры

#КонецОбласти

#Иначе	
ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте'");
#КонецЕсли