#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция НастройкиИнтеграции() Экспорт
	
	ТекЭлемент 	= Справочники.гкс_НастройкиИнтеграцииWarehouse.ПоУмолчанию;	
	Реквизиты 	= ИнициализироватьСтруктураЭлемента();
	
	Возврат гкс_ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекЭлемент, Реквизиты);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИнициализироватьСтруктураЭлемента() Экспорт
	
	СтруктураНастройки = Новый Структура;
	СтруктураНастройки.Вставить("КоличествоНеудачныхОбработок", 			0);
	СтруктураНастройки.Вставить("РазмерПорцииОбработки", 					0);
	СтруктураНастройки.Вставить("СрокХранениеВходящихДанныхWarehouse", 		0);
	СтруктураНастройки.Вставить("СрокХранениеВнешнихПроб", 					0);
	СтруктураНастройки.Вставить("СрокХранениеИсторииИзмененияВнешнихПроб", 	0);
	СтруктураНастройки.Вставить("РазмерПорцииОбработкиОчистки", 			0);
	СтруктураНастройки.Вставить("ОтборПоОрганизации", 						ИнициализироватьТабличнуюЧасть());
	
	Возврат СтруктураНастройки;

КонецФункции

Функция ИнициализироватьТабличнуюЧасть()
	
	ТЗОрганизации = Новый ТаблицаЗначений;
	ТЗОрганизации.Колонки.Добавить("Организация");
	
	Возврат ТЗОрганизации;

КонецФункции

#КонецОбласти

#КонецЕсли