 #Область ОбработчикиКомандФормы
 
   &НаКлиенте
Процедура ИнформацияGUIDПоСсылке(Команда)
	
	ИнформацияGUIDПоСсылкеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиСсылкуПоGUID(Команда)
	
	Если НЕ ЗначениеЗаполнено(GUID) Тогда
		
		Возврат;
				
	КонецЕсли;
	
	НайтиСсылкуПоGUIDНаСервере();

КонецПроцедуры

#КонецОбласти
 
#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнформацияGUIDПоСсылкеНаСервере()
		
	ДанныеGUID = РеквизитФормыВЗначение("Объект").ДанныеGUID();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеGUID);
		
КонецПроцедуры

&НаСервере
Процедура НайтиСсылкуПоGUIDНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Объект.Ссылка = ОбработкаОбъект.СсылкаПоGUID(GUID);	
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ДанныеGUID = ОбработкаОбъект.ДанныеGUID();
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеGUID);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПреобразоватьGUIDНеНайден(Команда)
	
	Если НЕ ЗначениеЗаполнено(GUIDОбъектаНеНайден) Тогда
		
		Возврат;
				
	КонецЕсли;
	
	СтрокаПреобразование = СтрЗаменить(GUIDОбъектаНеНайден, "<Объект не найден> (", "");
	СтрокаПреобразование = СтрЗаменить(СтрокаПреобразование, ")", "");
	СтрокаПреобразование = СтрЗаменить(СтрокаПреобразование, "0x", "");
	СтрокаПреобразование = Сред(СтрокаПреобразование, Найти(СтрокаПреобразование, ":") + 1, СтрДлина(СтрокаПреобразование));
	
	GUID = Сред(СтрокаПреобразование, 25, 8) + "-" + Сред(СтрокаПреобразование, 21, 4) + "-" 
	+ Сред(СтрокаПреобразование, 17, 4) + "-" 
	+ Сред(СтрокаПреобразование, 1, 4) + "-" 
	+ Сред(СтрокаПреобразование, 5, 12);
	
КонецПроцедуры

#КонецОбласти



