#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	ДанныеДляПредставления = Новый Массив;
	
	ДобавитьПоле(ДанныеДляПредставления, Формат(ПроизводственныеСутки, "ДФ=dd.MM.yyyy"));
	ДобавитьПоле(ДанныеДляПредставления, Контрагент);
	ДобавитьПоле(ДанныеДляПредставления, Номенклатура);
	ДобавитьПоле(ДанныеДляПредставления, ГоловаГруппы);
		
	Наименование = СтрСоединить(ДанныеДляПредставления, ";");	
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьПоле(МассивСтрок, ЗначениеПоля)
	
	Если ЗначениеЗаполнено(ЗначениеПоля) Тогда
		МассивСтрок.Добавить(ЗначениеПоля);
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти


#КонецЕсли