#Область ПрограммныйИнтерфейс

// Возвращает общий модуль локализации объекта по полному имени объекта метаданных.
//
// Параметры:
//  ПолноеИмя - Строка - полное имя объекта метаданных. Пример: "Справочник.Организации".
//
// Возвращаемое значение:
//  ОбщийМодуль - общий модуль локализации объекта.
//
Функция МодульЛокализации(ПолноеИмя) Экспорт
	
	ИмяМодуляЛокализации = "";
	ЧастиИмени = СтрРазделить(ПолноеИмя, ".");
	Если ЧастиИмени.Количество() > 1 Тогда
		ИмяМодуляЛокализации = ЧастиИмени[1] + "Локализация";
	Иначе
		ИмяМодуляЛокализации = ПолноеИмя + "Локализация";
	КонецЕсли;
	
	КодЛокализацииБазы = КодЛокализацииБазы();
	Если ЗначениеЗаполнено(КодЛокализацииБазы) Тогда
		ИмяМодуляЛокализации = СтрШаблон("%1_%2", ИмяМодуляЛокализации, КодЛокализацииБазы);
	КонецЕсли;	
	
	ОбщийМодульЛокализации = Неопределено;
	
	Если Метаданные.ОбщиеМодули.Найти(ИмяМодуляЛокализации) <> Неопределено Тогда
		ОбщийМодульЛокализации = Вычислить(ИмяМодуляЛокализации); // ВычислитьВБезопасномРежиме не требуется, т.к. проверка надежная.
	КонецЕсли;
	
	Если ТипЗнч(ОбщийМодульЛокализации) = Тип("ОбщийМодуль") Тогда
		Возврат ОбщийМодульЛокализации;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Возвращает Код локализации базы.
// 
// Возвращаемое значение:
//  Строка - Код локализации базы
Функция КодЛокализацииБазы() Экспорт
	
	Возврат гкс_ЛокализацияПовтИсп.КодЛокализацииБазы();
	
КонецФункции

#КонецОбласти
