#Область СлужебныйПрограммныйИнтерфейс

// Точка входа регистрации тестов YAxUnit.
Процедура ИсполняемыеСценарии() Экспорт

	ЮТТесты.ДобавитьСерверныйТест("ЭтоСсылка_Строка_Ложь", "ЭтоСсылка(Строка) = Ложь");
	ЮТТесты.ДобавитьСерверныйТест("ЭтоСсылка_Число_Ложь", "ЭтоСсылка(Число) = Ложь");

КонецПроцедуры

#КонецОбласти

#Область Тесты

Процедура ЭтоСсылка_Строка_Ложь() Экспорт
	ЮТест.ОжидаетЧто(гкс_ОбщегоНазначения.ЭтоСсылка(Тип("Строка")), "Строка не является ссылкой")
		.ЭтоЛожь();
КонецПроцедуры

Процедура ЭтоСсылка_Число_Ложь() Экспорт
	ЮТест.ОжидаетЧто(гкс_ОбщегоНазначения.ЭтоСсылка(Тип("Число")), "Число не является ссылкой")
		.ЭтоЛожь();
КонецПроцедуры

#КонецОбласти
