
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработатьУстановкуУмолчаний();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СлушатьОчередь(Команда)
	
	СлушатьОчередьНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбработатьУстановкуУмолчаний()

	ЧастотаПульса = 1;
	ВремяПрослушки = 20;
	
КонецПроцедуры
	
&НаСервере
Процедура СлушатьОчередьНаСервере()
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеПодписки = ДанныеПодписки(ПодпискаНаОчередиСообщений);
	
	ПолучениеСообщенийСлужебный.ПолучитьСообщениеВнутренний(ДанныеПодписки.ИмяОчереди,
			                                                ВремяПрослушки,
														    ДанныеПодписки.КлючСоединения,
														    ДанныеПодписки.Подписка,
														    ЧастотаПульса);
												  
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеПодписки(Знач Подписка)
	Возврат Справочники.ПодпискиНаОчередиСообщений.ДанныеПодписки(Подписка);
КонецФункции

#КонецОбласти