#Если ТолстыйКлиентОбычноеПриложение ИЛИ Сервер ИЛИ ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтотОбъект.ЭтаБаза Тогда
		
		ПроверкаНаЗаписьТекущегоПриложения(ЭтотОбъект, Отказ);
		
	КонецЕсли; 
		 
КонецПроцедуры

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	
	СтандартнаяОбработка = Ложь;
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Код) Тогда	
		ЭтотОбъект.Код = Строка(Новый УникальныйИдентификатор);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверкаНаЗаписьТекущегоПриложения(ЭтотОбъект, Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИСТИНА КАК ЕстьТекущееПриложение
	|ИЗ
	|	Справочник.гкс_УчастникиОбменаRMQ КАК гкс_УчастникиОбменаRMQ
	|ГДЕ
	|	НЕ гкс_УчастникиОбменаRMQ.Ссылка = &СсылкаНаОбъект
	|	И гкс_УчастникиОбменаRMQ.ЭтаБаза";
	
	Запрос.УстановитьПараметр("СсылкаНаОбъект", ЭтотОбъект.Ссылка);
	ТекущееПриложениеУстановлено = НЕ Запрос.Выполнить().Пустой();
	
	Если ТекущееПриложениеУстановлено Тогда
		
		Отказ = Истина;
		ТекстСообщения = НСтр("ru='Уже есть участник с признаком ""Текущее приложение""'");
		
		гкс_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте'");
#КонецЕсли
