#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Перем Сообщение;
	
	Параметры.Свойство("Сообщение", Сообщение);
	
	Если ЗначениеЗаполнено(Сообщение) Тогда
		
		ПараметрыФиксированныхНастроек = Отчет.КомпоновщикНастроек.ФиксированныеНастройки.ПараметрыДанных;
		КорневойИдентификаторСообщения = гкс_ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сообщение, 
        "КорневойИдентификаторСообщения");
				
		ПараметрыФиксированныхНастроек.УстановитьЗначениеПараметра("ТекущееСообщение", Сообщение);
		ПараметрыФиксированныхНастроек.УстановитьЗначениеПараметра("КорневойИдентификаторСообщения", 
        КорневойИдентификаторСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

