// Область ПрограммныйИнтерфейс и Экспорт для подавления замечаний SQ

#Область ПрограммныйИнтерфейс

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт
	Источник = ПараметрыВыполненияКоманды.Источник;
	КомандаПечатьЯрлыкПробы(Источник);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура КомандаПечатьЯрлыкПробы(Источник)
	
	Элементы = Источник.Элементы;
	ТекущиеДанные = Элементы.СписокРегистрации.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(ТекущиеДанные.ДокументРегистрацииАнализов) Тогда
		
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(ТекущиеДанные.ДокументРегистрацииАнализов);
		МенеджерПечати = гкс_ПриемкаТранспортаКлиентСервер.ИмяМенеджераПечатиЛабораторногоАнализа();
		
		ОписаниеКоманды = Новый Структура();
		ОписаниеКоманды.Вставить("ОбъектыПечати",	МассивОбъектов);
		ОписаниеКоманды.Вставить("Форма",			Источник);
		ОписаниеКоманды.Вставить("Идентификатор",	"ПФ_MXL_ЯрлыкПробы");
		ОписаниеКоманды.Вставить("Представление",	НСтр("ru = 'Ярлык пробы'"));
		ОписаниеКоманды.Вставить("МенеджерПечати",	МенеджерПечати);
		ОписаниеКоманды.Вставить("ПроверкаПроведенияПередПечатью", Ложь);
		ОписаниеКоманды.Вставить("Обработчик",
			"гкс_УправлениеПечатьюКлиент.КомандаПечати_ПФ_ЯрлыкПробы");
		
		гкс_УправлениеПечатьюКлиент.КомандаПечати_ПФ_ЯрлыкПробы(ОписаниеКоманды);
		
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			гкс_ПриемкаТранспортаКлиентСервер.ТекстОшибкиНеЗаполненЛабораторныйАнализ());
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти