
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СброситьКоличествоНеудачныхОбработок(Команда)
	
	СброситьКоличествоНеудачныхОбработокНаСервере();
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СброситьКоличествоНеудачныхОбработокНаСервере()
	
	МассивСтрок = Элементы.Список.ВыделенныеСтроки;
	
	Если Не ЗначениеЗаполнено(МассивСтрок) Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерОбработка = РегистрыСведений.гкс_ОчередьОбработкиВходящихДанныхWarehouse;
	
	Отбор = Новый Структура("ВходящиеДанные,Порядок", Неопределено, 0);
	
	Для Каждого КлючЗаписи Из МассивСтрок Цикл
				
		ЗаполнитьЗначенияСвойств(Отбор, КлючЗаписи);
		
		СтруктураЗаписи = МенеджерОбработка.ВыбратьЗапистьПоОтбору(Отбор);
		
		СтруктураЗаписи.КоличествоНеудачныхОбработок = 0;
		
		МенеджерОбработка.ЗафиксироватьИзмененияВходящихДанныхВОчереди(СтруктураЗаписи);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
