#Если ТолстыйКлиентОбычноеПриложение ИЛИ Сервер ИЛИ ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда		
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда     
		Возврат;        
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Порядок) И НЕ ЗначениеЗаполнено(ЭтотОбъект.ДатаПостановкиВОчередь) Тогда
		ЭтотОбъект.ДатаПостановкиВОчередь = гкс_ОчередьСообщенийRMQ.МестноеВремяИБ(ЭтотОбъект.Порядок);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 
 
#Иначе	
ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте'");
#КонецЕсли

