#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Выполняет запрос к сервису Warehouse для указанного типа операции и обрабатывает полученный ответ.
//
// Параметры:
//   ТипЗапроса - Строка- тип выполняемого запроса
//   ПараметрыЗапроса - Структура - параметры для формирования запроса
//
Процедура ВыполнитьЗапросКWarehouse(ТипЗапроса, ПараметрыЗапроса) Экспорт

	РесурсыСервисов = Справочники.гкс_РесурсыВебСервисов;
	РесурсВебСервиса = РесурсыСервисов.ОписаниеПоИмениПредопределенного(ТипЗапроса);

	Если Не ЗначениеЗаполнено(РесурсВебСервиса) Тогда
		Возврат;
	КонецЕсли;

	Если РесурсВебСервиса = РесурсыСервисов.ExternalSamples_GetById Тогда
		ПараметрыЗапроса.Вставить("id", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыЗапроса.Ссылка, "ИДПробы"));
	КонецЕсли;

	ПараметрыПреобразованияJSON = Новый Структура;
	ПараметрыПреобразованияJSON.Вставить("ПрочитатьВСоответствие", Ложь);
	ПараметрыПреобразованияJSON.Вставить("ИменаСвойствСоЗначениямиДата", "date,createdOn,updatedOn,loadDate");

	ДанныеОтветаВСтруктуре = гкс_ИнтеграцияWarehouse.ВыполнитьЗапросКWarehouse(
		РесурсВебСервиса, ПараметрыЗапроса, ПараметрыПреобразованияJSON);

	гкс_ОбменДаннымиWarehouse.ОбработатьПолученныеДанные(ДанныеОтветаВСтруктуре, ПараметрыЗапроса.Ссылка);

КонецПроцедуры

// Обновляет или создает документ "Внешняя проба" на основании данных из системы Warehouse.
// Записывает документ при изменении контрольной суммы.
//
// Параметры:
//   ДанныеИсточника - Массив из Структура - Массив структур с данными пробы из Warehouse.
//   Первая структура содержит основные данные, остальные — показатели качества.
//
Процедура ОбновитьПоДаннымWarehouse(ДанныеИсточника) Экспорт

	МенеджерСоотвествияОбъектов = РегистрыСведений.гкс_СоответствиеОбъектовWarehouse;

	ПерваяСтрокаДанных = ДанныеИсточника[0];
	ДокументВнешнейПробы = ПолучитьСсылкуПоИдентификатору(ПерваяСтрокаДанных.ИДПробы);

	Если Не ЗначениеЗаполнено(ДокументВнешнейПробы) Тогда
		ВнешняяПроба = Документы.гкс_ВнешняяПроба.СоздатьДокумент();
	Иначе
		ВнешняяПроба = ДокументВнешнейПробы.ПолучитьОбъект();
	КонецЕсли;

	ЗаполнитьЗначенияСвойств(ВнешняяПроба, ПерваяСтрокаДанных);
	ВнешняяПроба.Дата = ПерваяСтрокаДанных.ДатаПробы;
	ВнешняяПроба.НоменклатураWarehouse = ПерваяСтрокаДанных.Продукция;
	ВнешняяПроба.Номенклатура = МенеджерСоотвествияОбъектов.
								СсылкаОбъектаПоСсылкеWarehouse(ПерваяСтрокаДанных.Продукция);

	ВнешняяПроба.КачественныеПоказатели.Очистить();

	Для Каждого ДанныеСтроки Из ДанныеИсточника Цикл
		НоваяСтрока = ВнешняяПроба.КачественныеПоказатели.Добавить();
		НоваяСтрока.ВидПробы = ДанныеСтроки.ВидПробы;
		НоваяСтрока.ПоказательВнешний = ДанныеСтроки.Показатель;
		НоваяСтрока.Показатель = МенеджерСоотвествияОбъектов.
								СсылкаОбъектаПоСсылкеWarehouse(ДанныеСтроки.Показатель);

		НоваяСтрока.Значение = ДанныеСтроки.ЗначениеПоказателя;
	КонецЦикла;

	КонтрольнаяСуммаДокументаНовая = ВнешняяПроба.КонтрольнаяСуммаДокумента();

	// записываем только если есть изменения клювых данных
	Если ВнешняяПроба.КонтрольнаяСумма = КонтрольнаяСуммаДокументаНовая Тогда
		Возврат;
	КонецЕсли;

	Попытка
		ВнешняяПроба.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Интеграция Warehouse.Формирование документов ""Внешняя проба""'"),
			УровеньЖурналаРегистрации.Ошибка, , ,
			ПодробноеПредставлениеОшибки);
	КонецПопытки;

КонецПроцедуры

// Возвращает ссылку на документ по идентификатору
//
// Параметры:
//  Идентификатор - Строка - идентификатор Warehouse.
//
// Возвращаемое значение:
//  ДокументСсылка.гкс_ВнешняяПроба - ссылка на документ.
//
Функция ПолучитьСсылкуПоИдентификатору(Идентификатор) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВнешняяПроба.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.гкс_ВнешняяПроба КАК ВнешняяПроба
	|ГДЕ
	|	ВнешняяПроба.ИДПробы = &Идентификатор";

	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	РезультатЗапроса = Запрос.Выполнить();

	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат = Выборка.Ссылка;
	Иначе
		Результат = ПустаяСсылка();
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Вычисляет контрольную сумму по алгоритму MD5.
//
// Параметры:
//  КонтролируемыеДанные - Структура
//
// Возвращаемое значение:
//  Строка - контрольная сумма строкой без пробелов (например 32 символа).
//
Функция КонтрольнаяСумма(КонтролируемыеДанные) Экспорт

	Возврат ОбщегоНазначения.КонтрольнаяСуммаСтрокой(КонтролируемыеДанные);

КонецФункции

#Область КонвертацияПриОбмене

// Возвращает имя ключевого реквизита объекта.
//
// Возвращаемое значение:
//   Строка
//
Функция ИмяКлючевогоСвойства() Экспорт

	Возврат "ИДПробы";

КонецФункции

// Возвращает имя ключевого поля в Warehouse.
//
// Возвращаемое значение:
//   Строка
//
Функция ИмяКлючевогоСвойстваВWarehouse() Экспорт

	Возврат "id";

КонецФункции

// Возвращает правила конвертации свойств документа для интеграции с системой Warehouse
//
// Возвращаемое значение:
//   ТаблицаЗначений:
//
Функция ИнициализацияПравилКонвертацийСвойств() Экспорт

	ПравилаКонвертации = гкс_ОбменДаннымиWarehouse.ИнициализацияПравилКонвертацийСвойств();

	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "ИДПробы", 			"id");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "ИДКомпозитнойПробы", "groupId");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "Дата", 				"date");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "ДатаПогрузки", 		"loadDate");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "ДатаИзменения", 		"updatedOn");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "Организация", 		"client", 1, "ПКС_Организация");
	//гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "Номенклатура", 		"");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "НоменклатураWarehouse",
																"goodId", 1, "ПКС_НоменклатураWarehouse");

	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "НомерТС", 			"transport");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "ТранспортноеСредство",
																"transport", 1, "ПКС_ТранспортноеСредство");

	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "СтанцияОтправления",
																"stationId", 1, "ПКС_СтанцияОтправления");

	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "СтанцияНазначения",
																"stationDestId", 1, "ПКС_СтанцияНазначения");

	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "НомерЗаявки", 		"orderNumber");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "НомерДокумента", 	"refId");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "Комментарий", 		"commentary");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "Сюрвейер", 			"contractor", 1, "ПКС_Сюрвейер");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "МестоИнспекции", 	"inspectionPlace");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "ПриоритетныйВидПробы", "priorityExSampleTypeName");

	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "ВесБрутто", 	"weightGross");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "ВесТары", 	"weightTare");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "ВесНетто", 	"weightNet");

	// правила для табличной части "КачественныеПоказатели"
	ПравилаКонвертацииТЧКачественныеПоказатели = гкс_ОбменДаннымиWarehouse.ИнициализацияПравилКонвертацийСвойств();

	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертацииТЧКачественныеПоказатели,
		"ВидПробы", "externalSampleType", 1, "ПКС_ВидПробы");


	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертацииТЧКачественныеПоказатели,
		"ПоказательВнешний", "qualityIndicatorId", 1, "ПКС_ПоказательКачестваWarehouse");

	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертацииТЧКачественныеПоказатели, "Значение", "value");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертацииТЧКачественныеПоказатели, "Комментарий", "commentary");

	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации,
	 	"КачественныеПоказатели", "externalSampleTestResults", , ПравилаКонвертацииТЧКачественныеПоказатели, Истина);

	Возврат ПравилаКонвертации;

КонецФункции

#КонецОбласти

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецЕсли
