#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Вычисляет контрольную сумму документа для защиты от несанкционированных изменений
//
// Возвращаемое значение:
//   Строка - контрольная сумма документа
//
Функция КонтрольнаяСуммаДокумента() Экспорт

	КонтролируемыеДанные = Новый Структура;
	КонтролируемыеДанные.Вставить("Дата", 			Дата);
	КонтролируемыеДанные.Вставить("ДатаПогрузки", 	ДатаПогрузки);
	КонтролируемыеДанные.Вставить("ДатаИзменения", 	ДатаИзменения);

	КонтролируемыеДанные.Вставить("Номенклатура", 	ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
								НоменклатураWarehouse, "ИдентификаторWarehouse"));

    КонтролируемыеДанные.Вставить("НомерТС", 		НомерТС);
	КонтролируемыеДанные.Вставить("ИДКомпозитнойПробы", ИДКомпозитнойПробы);
	КонтролируемыеДанные.Вставить("ИДПробы", 			ИДПробы);
	КонтролируемыеДанные.Вставить("НомерЗаявки", 		НомерЗаявки);
	КонтролируемыеДанные.Вставить("НомерДокумента", 	НомерДокумента);

	ТабЧастьПоказатели = КачественныеПоказатели.Выгрузить(, "ВидПробы, ПоказательВнешний, Значение");
	КонтролируемыеДанные.Вставить("КачественныеПоказатели",
									ОбщегоНазначения.ТаблицаЗначенийВМассив(ТабЧастьПоказатели));

	Возврат Документы.гкс_ВнешняяПроба.КонтрольнаяСумма(КонтролируемыеДанные);

КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	КонтрольнаяСумма = КонтрольнаяСуммаДокумента();

КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	//гкс_ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

	//гкс_ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область СообщенияWarehouse

// Правило конвертации в реквизит
//
// Параметры:
//  ПравилоКонвертации - СтрокаТаблицыЗначений - Правило конвертации
//  ПолученныеДанные - Структура - данные полученные из Warehouse
//  ДанныеЗаполнения - Структура -  Данные заполнения
//
Процедура ПКС_ТранспортноеСредство(ПравилоКонвертации, ПолученныеДанные, ДанныеЗаполнения) Экспорт

	Перем ПолученноеЗначение;

	Если ПолученныеДанные.Свойство(ПравилоКонвертации.СвойствоИсточника, ПолученноеЗначение) Тогда

		ЗначениеЗаполнения = Справочники.ТранспортныеСредства.ТранспортноеСредствоПоНомеру(ПолученноеЗначение);

		Если ЗначениеЗаполнено(ЗначениеЗаполнения) Тогда
			ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, ЗначениеЗаполнения);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Правило конвертации в реквизит
//
// Параметры:
//  ПравилоКонвертации - СтрокаТаблицыЗначений - Правило конвертации
//  ПолученныеДанные - Структура - данные полученные из Warehouse
//  ДанныеЗаполнения - Структура -  Данные заполнения
//
Процедура ПКС_СтанцияОтправления(ПравилоКонвертации, ПолученныеДанные, ДанныеЗаполнения) Экспорт

	Перем ПолученноеЗначение;

	Если ПолученныеДанные.Свойство(ПравилоКонвертации.СвойствоИсточника, ПолученноеЗначение) Тогда

		НаименованиеОбъекта = "";
		ПолученныеДанные.Свойство("stationName", НаименованиеОбъекта);

		ЗначениеЗаполнения = гкс_ОбменДаннымиWarehouse.СсылкаИБПоСоотвествиюИдентификаторов(
			ПолученноеЗначение, Перечисления.гкс_ТипыОбъектовWarehouse.СтанцияОтправления, НаименованиеОбъекта);

		Если ЗначениеЗаполнено(ЗначениеЗаполнения) Тогда
			ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, ЗначениеЗаполнения);
		Иначе
			ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации,
				Справочники.гкс_КлассификаторСтанцийЖД.ПустаяСсылка());
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Правило конвертации в реквизит
//
// Параметры:
//  ПравилоКонвертации - СтрокаТаблицыЗначений - Правило конвертации
//  ПолученныеДанные - Структура - данные полученные из Warehouse
//  ДанныеЗаполнения - Структура -  Данные заполнения
//
Процедура ПКС_СтанцияНазначения(ПравилоКонвертации, ПолученныеДанные, ДанныеЗаполнения) Экспорт

	Перем ПолученноеЗначение;

	Если ПолученныеДанные.Свойство(ПравилоКонвертации.СвойствоИсточника, ПолученноеЗначение) Тогда

		НаименованиеОбъекта = "";
		ПолученныеДанные.Свойство("stationDestName", НаименованиеОбъекта);

		ЗначениеЗаполнения = гкс_ОбменДаннымиWarehouse.СсылкаИБПоСоотвествиюИдентификаторов(
			ПолученноеЗначение, Перечисления.гкс_ТипыОбъектовWarehouse.СтанцияНазначения, НаименованиеОбъекта);

		Если ЗначениеЗаполнено(ЗначениеЗаполнения) Тогда
			ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, ЗначениеЗаполнения);
		Иначе
			ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации,
				Справочники.гкс_КлассификаторСтанцийЖД.ПустаяСсылка());
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Правило конвертации в реквизит
//
// Параметры:
//  ПравилоКонвертации - СтрокаТаблицыЗначений - Правило конвертации
//  ПолученныеДанные - Структура - данные полученные из Warehouse
//  ДанныеЗаполнения - Структура -  Данные заполнения
//
Процедура ПКС_Сюрвейер(ПравилоКонвертации, ПолученныеДанные, ДанныеЗаполнения) Экспорт

	Перем ПолученноеЗначение;

	Если ПолученныеДанные.Свойство(ПравилоКонвертации.СвойствоИсточника, ПолученноеЗначение) Тогда

		ЗначениеЗаполнения = гкс_ОбменДаннымиWarehouse.СсылкаИБПоСоотвествиюИдентификаторов(
			ПолученноеЗначение.id, Перечисления.гкс_ТипыОбъектовWarehouse.Сюрвейер, ПолученноеЗначение.name);

		Если ЗначениеЗаполнено(ЗначениеЗаполнения) Тогда
			ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, ЗначениеЗаполнения);
		Иначе
			ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации,
				Справочники.гкс_КлассификаторСтанцийЖД.ПустаяСсылка());
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Правило конвертации в реквизит
//
// Параметры:
//  ПравилоКонвертации - СтрокаТаблицыЗначений - Правило конвертации
//  ПолученныеДанные - Структура - данные полученные из Warehouse
//  ДанныеЗаполнения - Структура -  Данные заполнения
//
Процедура ПКС_Организация(ПравилоКонвертации, ПолученныеДанные, ДанныеЗаполнения) Экспорт

	Перем ПолученноеЗначение;

	Если ПолученныеДанные.Свойство(ПравилоКонвертации.СвойствоИсточника, ПолученноеЗначение) Тогда

		ЗначениеЗаполнения = гкс_ОбменДаннымиWarehouse.СсылкаИБПоСоотвествиюИдентификаторов(
			ПолученноеЗначение.id, Перечисления.гкс_ТипыОбъектовWarehouse.Организация, ПолученноеЗначение.name);

		Если ЗначениеЗаполнено(ЗначениеЗаполнения) Тогда
			ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, ЗначениеЗаполнения);
		Иначе
			ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации,
				Справочники.гкс_КлассификаторСтанцийЖД.ПустаяСсылка());
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Правило конвертации в реквизит
//
// Параметры:
//  ПравилоКонвертации - СтрокаТаблицыЗначений - Правило конвертации
//  ПолученныеДанные - Структура - данные полученные из Warehouse
//  ДанныеЗаполнения - Структура -  Данные заполнения
//
Процедура ПКС_НоменклатураWarehouse(ПравилоКонвертации, ПолученныеДанные, ДанныеЗаполнения) Экспорт

	Перем ПолученноеЗначение;
	Если ПолученныеДанные.Свойство(ПравилоКонвертации.СвойствоИсточника, ПолученноеЗначение) Тогда

		ПолноеИмяОбъектаСвойства = "Справочник.гкс_ПродукцияWarehouse";
		ДанныеЗаполненияСвойства = Новый Структура;
		ДанныеЗаполненияСвойства.Вставить(Справочники.гкс_ПродукцияWarehouse.ИмяКлючевогоСвойства(),
			ПолученноеЗначение);
		ДанныеЗаполненияСвойства.Вставить("НаименованиеКороткое", ПолученныеДанные.goodShortName);
		ДанныеЗаполненияСвойства.Вставить("Наименование", ПолученныеДанные.goodName);

		ЗначениеЗаполнения = гкс_ОбменДаннымиWarehouse.ЭлементПоВнешнимДанным(ПолноеИмяОбъектаСвойства,
			ПолученноеЗначение, ДанныеЗаполненияСвойства);

		Если ЗначениеЗаполнено(ЗначениеЗаполнения) Тогда
			ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, ЗначениеЗаполнения);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Правило конвертации в реквизит
//
// Параметры:
//  ПравилоКонвертации - СтрокаТаблицыЗначений - Правило конвертации
//  ПолученныеДанные - Структура - данные полученные из Warehouse
//  ДанныеЗаполнения - Структура -  Данные заполнения
//
Процедура ПКС_ВидПробы(ПравилоКонвертации, ПолученныеДанные, ДанныеЗаполнения) Экспорт

	Перем ПолученноеЗначение;

	Если ПолученныеДанные.Свойство(ПравилоКонвертации.СвойствоИсточника, ПолученноеЗначение) Тогда

		ЗначениеЗаполнения = гкс_ОбменДаннымиWarehouse.СсылкаИБПоСоотвествиюИдентификаторов(
			ПолученноеЗначение.id, Перечисления.гкс_ТипыОбъектовWarehouse.ВидПробы, ПолученноеЗначение.name);

		Если ЗначениеЗаполнено(ЗначениеЗаполнения) Тогда
			ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, ЗначениеЗаполнения);
		Иначе
			ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации,
				Справочники.гкс_КлассификаторСтанцийЖД.ПустаяСсылка());
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Правило конвертации в реквизит
//
// Параметры:
//  ПравилоКонвертации - СтрокаТаблицыЗначений - Правило конвертации
//  ПолученныеДанные - Структура - данные полученные из Warehouse
//  ДанныеЗаполнения - Структура -  Данные заполнения
//
Процедура ПКС_ПоказательКачестваWarehouse(ПравилоКонвертации, ПолученныеДанные, ДанныеЗаполнения) Экспорт

	Перем ПолученноеЗначение;

	Если ПолученныеДанные.Свойство(ПравилоКонвертации.СвойствоИсточника, ПолученноеЗначение) Тогда

		ЗначениеЗаполнения = гкс_ОбменДаннымиWarehouse.СсылкаНаОбъектПоИдентификатору(ПолученноеЗначение,
		  "Справочник.гкс_ПоказателиКачестваWarehouse");

		Если ЗначениеЗаполнено(ЗначениеЗаполнения) Тогда
			ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, ЗначениеЗаполнения);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
