#Если ТолстыйКлиентОбычноеПриложение ИЛИ Сервер ИЛИ ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = "ПОУМОЛЧАНИЮ" Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЗначенияЗаполненияПоУмолчанию());	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗначенияЗаполненияПоУмолчанию()
	
	ПортПоУмолчанию = 5672;
	
    ЗначенияЗаполнения = Новый Структура;
	
	ЗначенияЗаполнения.Вставить("АдресСервера", "localhost");  
	ЗначенияЗаполнения.Вставить("ВиртуальныйХост", "");
	ЗначенияЗаполнения.Вставить("Порт", ПортПоУмолчанию);
	ЗначенияЗаполнения.Вставить("Логин", "");
    ЗначенияЗаполнения.Вставить("Пароль", ""); 
	
	ЗначенияЗаполнения.Вставить("ИмяПредопределенныхДанных", "Основной");
	
	Возврат ЗначенияЗаполнения;
	
КонецФункции

#КонецОбласти

#Иначе	
ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте'");
#КонецЕсли
