#Если ТолстыйКлиентОбычноеПриложение Или Сервер Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура УстановитьСостояниеСообщения(Сообщение, УчастникОбмена, Состояние) Экспорт
	
	Если НЕ ЗначениеЗаполнено(УчастникОбмена) Тогда
		УчастникОбмена = гкс_ОчередьСообщенийRMQВызовСервера.ТекущееПриложение();
	КонецЕсли;
		
	Если НЕ ЗначениеЗаполнено(Состояние) Тогда
		Состояние = Перечисления.гкс_СостоянияИсходящихСообщенийRMQ.ОшибкаФормированияСостояния;
	КонецЕсли;
	
	
	ТипСообщения = ТипСообщения(ТипЗнч(Сообщение)); 
	
	СтруктураЗаписи = Новый Структура;
	СтруктураЗаписи.Вставить("Сообщение", Сообщение);
	СтруктураЗаписи.Вставить("УчастникОбмена", УчастникОбмена);
	СтруктураЗаписи.Вставить("Состояние", Состояние);
	СтруктураЗаписи.Вставить("ТипСообщения", ТипСообщения);
		
	гкс_ОбменДаннымиСервер.ДобавитьЗаписьВРегистрСведений(СтруктураЗаписи, "гкс_ТекущиеСостоянияСообщений");
		
КонецПроцедуры

Функция ТипСообщения(Тип)
	
	ТипСообщения = Перечисления.гкс_ТипыСообщений.ПустаяСсылка();
	Если Тип = Тип("СправочникСсылка.ИсходящиеСообщения") Тогда
		ТипСообщения = Перечисления.гкс_ТипыСообщений.ИсходящееСообщение;
	ИначеЕсли Тип = Тип("СправочникСсылка.гкс_ВходящиеСообщенияRMQ") Тогда
		ТипСообщения = Перечисления.гкс_ТипыСообщений.ВходящееСообщение;
	КонецЕсли;
	
	Возврат ТипСообщения;
КонецФункции

#КонецОбласти

#КонецЕсли
