
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	ПоказатьОповещениеПользователя(
		НСтр("ru = 'Настройки сохранены'"),
		,
		НСтр("ru = 'Основные настройки системы успешно сохранены'"));

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НастройкиПриемкиПЛКПоТочкамМаршрутаНажатие(Элемент)
	ОткрытьФорму("РегистрСведений.гкс_НастройкиПриемкаПЛКПоТочкамМаршрута.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура гкс_ИспользоватьИнтеграциюСРПВПриИзменении(Элемент)

	ИспользоватьИнтеграциюСРПВ = НаборКонстант.гкс_ИспользоватьИнтеграциюСРПВ;
	Если Не ИспользоватьИнтеграциюСРПВ Тогда
		НаборКонстант.гкс_ИспользоватьОбменДоступнымиМестамиРазгрузкиСРПВ = Ложь;
	КонецЕсли;

	УстановитьВидимостьДоступность();

КонецПроцедуры

&НаКлиенте
Процедура гкс_ИспользоватьУсиленныйКонтрольКачестваПриИзменении(Элемент)
	Если Не НаборКонстант.гкс_ИспользоватьУсиленныйКонтрольКачества Тогда
		НаборКонстант.гкс_ИспользоватьЗаблокированныеТС = Ложь;
		НаборКонстант.гкс_СрокУстановкиПравилКаждоеТС = 0;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьДоступность()

	ИспользоватьИнтеграциюСРПВ = НаборКонстант.гкс_ИспользоватьИнтеграциюСРПВ;
	Элементы.гкс_ИспользоватьОбменДоступнымиМестамиРазгрузкиСРПВ.Доступность = ИспользоватьИнтеграциюСРПВ;
	Элементы.гкс_ПериодОжиданияОтветаОтСРПВ						.Доступность = ИспользоватьИнтеграциюСРПВ;
	Элементы.гкс_КоличествоДнейВидимостиПрибывшихВагонов		.Доступность = ИспользоватьИнтеграциюСРПВ;

КонецПроцедуры

#КонецОбласти
