#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Записывает в регистр актуальную информацию о положении вагонов на путях.
// 
// Параметры:
//  ДанныеОПоложенииВагонов - Массив - коллекция с данными о положении вагонов в виде структур.
Процедура АктуализироватьИнформациюОПоложенииВагоновНаПутях(ДанныеОПоложенииВагонов) Экспорт
	
	ТаблицаДляЗагрузки = ПодготовитьТаблицуДляЗагрузки(ДанныеОПоложенииВагонов);
	Если Не ТаблицаДляЗагрузки = Неопределено Тогда 
		ЗаписатьАктуальныеДанные(ТаблицаДляЗагрузки);
	КонецЕсли;
	
КонецПроцедуры

// Обновляет Склад и Яму разгрузки в документе НаправлениеНаРазгрузку при перемещении вагона на путь из 
// Доступных мест разгрузки. Метод вызывается регламентным заданием гкс_ОбновлениеИнформацииОВагонахСРПВ.
Процедура ОбновитьМестаРазгрузкиПоТекущемуПоложениюВагона() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаДляОбновленияМестРазгрузкиПоНахождениюВагона();
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Попытка
			
			ДанныеЗаполнения = Новый Структура;
			ДанныеЗаполнения.Вставить("Склад"		, Выборка.Склад);
			ДанныеЗаполнения.Вставить("ЯмаРазгрузки", Выборка.ЯмаРазгрузки);
			Если Выборка.ЗаполнитьСлужебнуюНоменклатуру Тогда
				ДанныеЗаполнения.Вставить("СлужебнаяНоменклатура", Выборка.СлужебнаяНоменклатура);
			КонецЕсли;
			ДанныеЗаполнения.Вставить("НеРегистрироватьДляПередачиСРПВ", Истина);
			
			Документы.гкс_НаправлениеНаРазгрузку.СоздатьИзменитьИзАРМПриемки(
				ДанныеЗаполнения, Истина, Выборка.ДокументНаправлениеНаРазгрузку);
				
		Исключение

			ПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(
				"Интеграция СРПВ. Обновление направления на разгрузку", 
				УровеньЖурналаРегистрации.Ошибка,,, 
				ПредставлениеОшибки);
				
		КонецПопытки;
		
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПодготовитьТаблицуДляЗагрузки(ДанныеОПоложенииВагонов)
	
	ТаблицаДляОбработки = ИнициализироватьТаблицаДляЗагрузки();
	МассивВТаблицуЗначений(ДанныеОПоложенииВагонов, ТаблицаДляОбработки);
	
	Запрос = Новый Запрос();
	Запрос.Текст = ТекстЗапросаСопоставленияОбъектов();
	Запрос.УстановитьПараметр("ДанныеДляЗагрузки"	, ТаблицаДляОбработки);
	Запрос.УстановитьПараметр("ДатаСостояния"		, ТекущаяДатаСеанса());
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		ДанныеДляЗагрузки = Неопределено;
	Иначе 
		
		НачатьТранзакцию();
		Попытка
			
			ДанныеДляЗагрузки = РезультатЗапроса.Выгрузить();
			Для Каждого СтрокаЗагрузки Из ДанныеДляЗагрузки Цикл
			
				// Дозаполнить ссылочные свойства коллекции.
				Если Не ЗначениеЗаполнено(СтрокаЗагрузки.Путь) Тогда
					СтрокаЗагрузки.Путь = НовыйПЛК(СтрокаЗагрузки);
					ОбновитьВДанныхДляЗагрузки(ДанныеДляЗагрузки, СтрокаЗагрузки, "RailWayTrackIdPark", "Путь");
				КонецЕсли;	
				
				Если Не ЗначениеЗаполнено(СтрокаЗагрузки.Вагон) Тогда
					СтрокаЗагрузки.Вагон = НовыйВагон(СтрокаЗагрузки);
					ОбновитьВДанныхДляЗагрузки(ДанныеДляЗагрузки, СтрокаЗагрузки, "WaggonNumber", "Вагон");
				КонецЕсли;
				
			КонецЦикла;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(
				"Интеграция СРПВ. Нахождение вагонов на путях", 
				УровеньЖурналаРегистрации.Ошибка,,, 
				ПредставлениеОшибки);
				
			ДанныеДляЗагрузки = Неопределено;
			
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат ДанныеДляЗагрузки;
	
КонецФункции

Процедура ОбновитьВДанныхДляЗагрузки(ДанныеДляЗагрузки, СтрокаЗагрузки, ИмяПоляКлюча, ИмяОбновляемогоПоля)
	
	СтрокиОтбора = ДанныеДляЗагрузки.НайтиСтроки(
		Новый Структура(ИмяПоляКлюча, СтрокаЗагрузки[ИмяПоляКлюча]));
	Для Каждого СтрокаОтбора Из СтрокиОтбора Цикл 
		СтрокаОтбора[ИмяОбновляемогоПоля] = СтрокаЗагрузки[ИмяОбновляемогоПоля];
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьАктуальныеДанные(ТаблицаДляЗагрузки)
	
	Попытка

		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Загрузить(ТаблицаДляЗагрузки);
		НаборЗаписей.Записать(РежимЗамещения.Замещение);
		
	Исключение
		
		ПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(
			"Интеграция СРПВ. Нахождение вагонов на путях", 
			УровеньЖурналаРегистрации.Ошибка,,, 
			ПредставлениеОшибки);
		
	КонецПопытки;
	
КонецПроцедуры

Функция НовыйПЛК(СтрокаДанных)
	
	ЖДПуть = Справочники.гкс_СтруктураПЛК.СоздатьЭлемент();
	ЖДПуть.УстановитьНовыйКод();
	ЖДПуть.Наименование = СтрокаДанных.RailWayTrackName;
	ЖДПуть.ТипТранспортныхСредств = Перечисления.гкс_ТипыТранспортныхСредствДоставки.ЖДТранспорт;
	ЖДПуть.ОбменДанными.Загрузка = Истина;
	ЖДПуть.Записать();
	
	ДобавитьСоответствиеОбъекта(СтрокаДанных, ЖДПуть.Ссылка);
	
	Возврат ЖДПуть.Ссылка;
	
КонецФункции

Функция НовыйВагон(СтрокаДанных)
	
	ЖдВагон = Справочники.ТранспортныеСредства.СоздатьЭлемент();
	ЖдВагон.УстановитьНовыйКод();
	ЖдВагон.НомерТранспортногоСредства = СтрокаДанных.WaggonNumber;
	ЖдВагон.Наименование = СтрокаДанных.WaggonNumber;
	ЖдВагон.ВидПеревозки = Перечисления.гкс_ТипыТранспортныхСредствДоставки.ЖДТранспорт;
	ЖдВагон.ОбменДанными.Загрузка = Истина;
	ЖдВагон.Записать();
	
	Возврат ЖдВагон.Ссылка;
	
КонецФункции

Процедура ДобавитьСоответствиеОбъекта(СтрокаДанных, Ссылка)
	
	МенеджерЗаписи = РегистрыСведений.гкс_СоответствияОбъектовСРПВ.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИдентификаторСРПВ = СтрокаДанных.RailWayTrackIdPark;
	МенеджерЗаписи.ТипОбъектаСРПВ = Перечисления.гкс_ТипыОбъектовСРПВ.СтруктураПЛК;
	МенеджерЗаписи.Ссылка = Ссылка;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Процедура МассивВТаблицуЗначений(Массив, Таблица) Экспорт

	Для Каждого ЭлементМассива Из Массив Цикл
		ЗаполнитьЗначенияСвойств(Таблица.Добавить(), ЭлементМассива);
	КонецЦикла;

КонецПроцедуры

Функция ИнициализироватьТаблицаДляЗагрузки()
	
	ДлинаСтроки8 = 8;
	ДлинаСтроки10 = 10;
	ДлинаСтроки20 = 20;
	ДлинаСтроки25 = 25;
	
	Таблица = Новый ТаблицаЗначений();
	Таблица.Колонки.Добавить("WaggonNumber", ОбщегоНазначения.ОписаниеТипаСтрока(ДлинаСтроки8));
	Таблица.Колонки.Добавить("WaggonDispatchId", ОбщегоНазначения.ОписаниеТипаЧисло(ДлинаСтроки20));
	Таблица.Колонки.Добавить("WaggonIndexPark", ОбщегоНазначения.ОписаниеТипаЧисло(ДлинаСтроки10));
	Таблица.Колонки.Добавить("RailWayTrackIdPark", ОбщегоНазначения.ОписаниеТипаЧисло(ДлинаСтроки20));
	Таблица.Колонки.Добавить("RailWayTrackName", ОбщегоНазначения.ОписаниеТипаСтрока(ДлинаСтроки25));
	Таблица.Колонки.Добавить("PlcId", ОбщегоНазначения.ОписаниеТипаСтрока(ДлинаСтроки20));

	Возврат Таблица;
	
КонецФункции

#Область ТекстыЗапросов

Функция ТекстЗапросаСопоставленияОбъектов()
	Возврат 
	"ВЫБРАТЬ
	|	ДЗ.WaggonNumber КАК WaggonNumber,
	|	ДЗ.WaggonDispatchId КАК WaggonDispatchId,
	|	ДЗ.WaggonIndexPark КАК WaggonIndexPark,
	|	ДЗ.RailWayTrackIdPark КАК RailWayTrackIdPark,
	|	ДЗ.RailWayTrackName КАК RailWayTrackName
	|ПОМЕСТИТЬ ДанныеПоВагонам
	|ИЗ
	|	&ДанныеДляЗагрузки КАК ДЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПоВагонам.WaggonNumber КАК WaggonNumber,
	|	ДанныеПоВагонам.WaggonDispatchId КАК WaggonDispatchId,
	|	ДанныеПоВагонам.WaggonIndexPark КАК WaggonIndexPark,
	|	МАКСИМУМ(ЕСТЬNULL(ТранспортныеСредства.Ссылка, ЗНАЧЕНИЕ(Справочник.ТранспортныеСредства.ПустаяСсылка))) КАК Вагон,
	|	ДанныеПоВагонам.RailWayTrackIdPark КАК RailWayTrackIdPark,
	|	ДанныеПоВагонам.RailWayTrackName КАК RailWayTrackName,
	|	ЕСТЬNULL(гкс_СоответствияОбъектовСРПВ.Ссылка, ЗНАЧЕНИЕ(Справочник.гкс_СтруктураПЛК.ПустаяСсылка)) КАК Путь,
	|	МАКСИМУМ(&ДатаСостояния) КАК ДатаСостояния
	|ИЗ
	|	ДанныеПоВагонам КАК ДанныеПоВагонам
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТранспортныеСредства КАК ТранспортныеСредства
	|		ПО ТранспортныеСредства.НомерТранспортногоСредства = ДанныеПоВагонам.WaggonNumber
	|		И ТранспортныеСредства.ВидПеревозки = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыТранспортныхСредствДоставки.ЖДТранспорт)
	|		И НЕ ТранспортныеСредства.ПометкаУдаления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СоответствияОбъектовСРПВ КАК гкс_СоответствияОбъектовСРПВ
	|		ПО ДанныеПоВагонам.RailWayTrackIdPark = гкс_СоответствияОбъектовСРПВ.ИдентификаторСРПВ
	|		И гкс_СоответствияОбъектовСРПВ.ТипОбъектаСРПВ = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыОбъектовСРПВ.СтруктураПЛК)
	|СГРУППИРОВАТЬ ПО
	|	ДанныеПоВагонам.WaggonNumber,
	|	ДанныеПоВагонам.WaggonDispatchId,
	|	ДанныеПоВагонам.WaggonIndexPark,
	|	ДанныеПоВагонам.RailWayTrackIdPark,
	|	ДанныеПоВагонам.RailWayTrackName,
	|	ЕСТЬNULL(гкс_СоответствияОбъектовСРПВ.Ссылка, ЗНАЧЕНИЕ(Справочник.гкс_СтруктураПЛК.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДанныеПоВагонам";
КонецФункции

Функция ТекстЗапросаДляОбновленияМестРазгрузкиПоНахождениюВагона()
	Возврат 
	"ВЫБРАТЬ
	|	АРМПриемкиНаПЛКСписокРегистраций.ДокументНаправлениеНаРазгрузку КАК ДокументНаправлениеНаРазгрузку,
	|	АРМПриемкиНаПЛКСписокРегистраций.ТранспортноеСредство КАК ТранспортноеСредство,
	|	НаправлениеНаРазгрузку.СлужебнаяНоменклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК
	|		ЗаполнитьСлужебнуюНоменклатуру
	|ПОМЕСТИТЬ АРМПриемкиНаПЛКСписокРегистраций
	|ИЗ
	|	РегистрСведений.гкс_АРМПриемкиНаПЛКСписокРегистраций КАК АРМПриемкиНаПЛКСписокРегистраций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_НаправлениеНаРазгрузку КАК НаправлениеНаРазгрузку
	|		ПО АРМПриемкиНаПЛКСписокРегистраций.ДокументНаправлениеНаРазгрузку = НаправлениеНаРазгрузку.Ссылка
	|		И НаправлениеНаРазгрузку.ЯмаРазгрузки = ЗНАЧЕНИЕ(Справочник.гкс_ТочкиМаршрута.ПустаяСсылка)
	|		И НаправлениеНаРазгрузку.Склад = ЗНАЧЕНИЕ(Справочник.гкс_ТочкиМаршрута.ПустаяСсылка)
	|ГДЕ
	|	АРМПриемкиНаПЛКСписокРегистраций.ВидПеревозки = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыТранспортныхСредствДоставки.ЖДТранспорт)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТранспортноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НахождениеВагоновНаПутяхСРПВ.Вагон КАК Вагон,
	|	СтруктураПЛК.ТочкаМаршрута КАК ПутьТочкаМаршрута
	|ПОМЕСТИТЬ НахождениеВагоновНаПутяхСРПВ
	|ИЗ
	|	РегистрСведений.гкс_НахождениеВагоновНаПутяхСРПВ КАК НахождениеВагоновНаПутяхСРПВ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.гкс_СтруктураПЛК КАК СтруктураПЛК
	|		ПО НахождениеВагоновНаПутяхСРПВ.Путь = СтруктураПЛК.Ссылка
	|ГДЕ
	|	НахождениеВагоновНаПутяхСРПВ.Вагон В
	|		(ВЫБРАТЬ
	|			АРМПриемкиНаПЛКСписокРегистраций.ТранспортноеСредство
	|		ИЗ
	|			АРМПриемкиНаПЛКСписокРегистраций)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Вагон
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АРМПриемкиНаПЛКСписокРегистраций.ДокументНаправлениеНаРазгрузку КАК ДокументНаправлениеНаРазгрузку,
	|	АРМПриемкиНаПЛКСписокРегистраций.ЗаполнитьСлужебнуюНоменклатуру КАК ЗаполнитьСлужебнуюНоменклатуру,
	|	НахождениеВагоновНаПутяхСРПВ.ПутьТочкаМаршрута КАК ПутьТочкаМаршрута
	|ПОМЕСТИТЬ НаправленияНаРазгрузкуСПутями
	|ИЗ
	|	АРМПриемкиНаПЛКСписокРегистраций КАК АРМПриемкиНаПЛКСписокРегистраций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НахождениеВагоновНаПутяхСРПВ КАК НахождениеВагоновНаПутяхСРПВ
	|		ПО АРМПриемкиНаПЛКСписокРегистраций.ТранспортноеСредство = НахождениеВагоновНаПутяхСРПВ.Вагон
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументНаправлениеНаРазгрузку
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаправленияНаРазгрузкуСПутями.ДокументНаправлениеНаРазгрузку КАК ДокументНаправлениеНаРазгрузку,
	|	НаправленияНаРазгрузкуСПутями.ЗаполнитьСлужебнуюНоменклатуру КАК ЗаполнитьСлужебнуюНоменклатуру,
	|	НаправлениеНаРазгрузкуДоступныеМестаРазгрузки.Силос КАК Склад,
	|	НаправлениеНаРазгрузкуДоступныеМестаРазгрузки.СлужебнаяНоменклатура КАК СлужебнаяНоменклатура,
	|	НаправлениеНаРазгрузкуДоступныеМестаРазгрузки.ЯмаРазгрузки КАК ЯмаРазгрузки
	|ИЗ
	|	НаправленияНаРазгрузкуСПутями КАК НаправленияНаРазгрузкуСПутями
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_НаправлениеНаРазгрузку.ДоступныеМестаРазгрузки КАК
	|			НаправлениеНаРазгрузкуДоступныеМестаРазгрузки
	|		ПО НаправленияНаРазгрузкуСПутями.ДокументНаправлениеНаРазгрузку = НаправлениеНаРазгрузкуДоступныеМестаРазгрузки.Ссылка
	|		И НаправленияНаРазгрузкуСПутями.ПутьТочкаМаршрута = НаправлениеНаРазгрузкуДоступныеМестаРазгрузки.ЯмаРазгрузки";
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
