#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение Тогда
	
#Область ПрограммныйИнтерфейс

// Возвращет подготовленную ФабрикуXDTO инициализированную моделью данных.
// Если параметр модели неопределена, возвращается глобальная фабрика конфигурации ФабрикаXDTO
//
// Параметры:
// 	Модель - СправочникСсылка.гкс_МоделиДанныхXDTO - модель на основании содержимого 
//  которой нужно получить фабрику XDTO
//
// Возвращаемое значение:
// 	ФабрикаXDTO - 
//
Функция ПолучитьФабрикуПоМодели(Модель = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Модель) Тогда
		Возврат ФабрикаXDTO;
	КонецЕсли;
	
	Содержимое = гкс_ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Модель, "Содержимое"); 
	
	СодержимоеМоделиВСтроке = Содержимое.Получить();
	Если НЕ ЗначениеЗаполнено(СодержимоеМоделиВСтроке) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЧитательXML = Новый ЧтениеXML;
	ЧитательXML.УстановитьСтроку(СодержимоеМоделиВСтроке);
	
	МодельТипов = ФабрикаXDTO.ПрочитатьXML(ЧитательXML);
	
	Возврат Новый ФабрикаXDTO(МодельТипов);
		
КонецФункции

#КонецОбласти

#КонецЕсли