#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьЗначенияПоУмолчаниюПередЗаписью();
	Если НЕ ЗначениеЗаполнено(ДатаСоздания) Тогда
		ДатаСоздания = ТекущаяУниверсальнаяДата();
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыиФункции

Процедура УстановитьЗначенияПоУмолчаниюПередЗаписью()
	
	Если НЕ ЗначениеЗаполнено(ДатаСоздания) Тогда
		ДатаСоздания = ТекущаяУниверсальнаяДата();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Наименование) И ЗначениеЗаполнено(ПространствоИмен) Тогда
		Наименование = СтрШаблон("%1 от %2", ПространствоИмен, Формат(ДатаСоздания, "ДФ=dd.MM.yyyy;"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе	
ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте'");
#КонецЕсли
