#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Шаблон = НСтр("ru='Изменение связи. До: 
                  | Идентификатор: %1
				  | Ссылка: %2
				  | Приложение: %3'");
	
	Информация = гкс_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон,
	                                                                         ТекущийОбъект.Идентификатор,
																             Строка(ТекущийОбъект.Ссылка),
																             Строка(ТекущийОбъект.Приложение));	
	гкс_ОчередьСообщенийRMQ.ЗаписьИнформацииВЖурналРегистрации(Информация,
															   НСтр("ru='ИзменениеСвязи'"),
															   ТекущийОбъект.Ссылка.Метаданные(),
															   ТекущийОбъект.Ссылка);
	
КонецПроцедуры           

#КонецОбласти