#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
			
#Область СлужебныеПроцедурыИФункции

Функция СостояниеПоРезультатуОбработки(РезультатОбработки) Экспорт
	
	Сотояние = Неопределено;
	МенеджерСостоянийОбработки = Перечисления.гкс_СостоянияВходящихСообщенийRMQ; 
	СостояниеОбработки = МенеджерСостоянийОбработки[РезультатОбработки];
	
	Если СостояниеОбработки = МенеджерСостоянийОбработки.ВОбработке 
		ИЛИ СостояниеОбработки = МенеджерСостоянийОбработки.Зарегистрировано Тогда
		Сотояние = Доставлено;
	ИначеЕсли СостояниеОбработки = МенеджерСостоянийОбработки.Обработано Тогда
		Сотояние = ДоставленоИОбработано;
	ИначеЕсли СостояниеОбработки = МенеджерСостоянийОбработки.ОшибкаОбработки Тогда
		Сотояние = ОшибкаОбработкиПолучателем;
	КонецЕсли;
	
	Возврат Сотояние;
		
КонецФункции
	
#КонецОбласти

#КонецЕсли