#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет максимально допустимый вес в зависисмости от вида транспорта и количества осей
//
// Параметры:
//  ВидПеревозки - ПеречислениеСсылка.гкс_ТипыТранспортныхСредствДоставки -
//  КоличествоОсей  - ПеречислениеСсылка.гкс_КоличествоОсейТранспортногоСредства -
// 
// Возвращаемое значение:
//  ДопустимыйВес - Число -  значение допустимого веса
//
Функция МаксимальныйДопустимыйВес(ВидПеревозки, КоличествоОсей) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДопустимыеМассыТранспортныхСредств.ДопустимаяМасса КАК ДопустимаяМасса
	|ИЗ
	|	РегистрСведений.гкс_ДопустимыеМассыТранспортныхСредств КАК ДопустимыеМассыТранспортныхСредств
	|ГДЕ
	|	ДопустимыеМассыТранспортныхСредств.ВидПеревозки = &ВидПеревозки
	|	И ДопустимыеМассыТранспортныхСредств.КоличествоОсей = &КоличествоОсей";
	
	Запрос.УстановитьПараметр("КоличествоОсей", КоличествоОсей);
	Запрос.УстановитьПараметр("ВидПеревозки", ВидПеревозки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		
		Результат = ВыборкаДетальныеЗаписи.ДопустимаяМасса;
	Иначе	
		Результат = Неопределено;
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
