
#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ПарамерыЗаполнены(Параметры, Запись) Тогда
		Запись.ДокументРегистрации = Параметры.ЗначенияЗаполнения.ДокументРегистрации;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СрокХраненияМесяцевПриИзменении(Элемент)
	ЗаполнитьСрокГодности();
КонецПроцедуры

&НаКлиенте
Процедура ДатаВыработкиКонецПриИзменении(Элемент)
	ЗаполнитьСрокГодности();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыиФункции

&НаКлиенте
Процедура ЗаполнитьСрокГодности()
	СекундВДне = гкс_ОбщегоНазначенияКлиентСервер.СекундВДне();
	Если ЗначениеЗаполнено(Запись.ДатаВыработкиКонец) И ЗначениеЗаполнено(Запись.СрокХраненияМесяцев) Тогда 
		Запись.СрокГодности = 
			ДобавитьМесяц(Запись.ДатаВыработкиКонец, Запись.СрокХраненияМесяцев) - СекундВДне;
	КонецЕсли;	                                     
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПарамерыЗаполнены(Параметры, Запись)
	Возврат Параметры.Свойство("ЗначенияЗаполнения")
		И ТипЗнч(Параметры.ЗначенияЗаполнения) = Тип("Структура")
		И Параметры.ЗначенияЗаполнения.Свойство("ДокументРегистрации")
		И ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения.ДокументРегистрации)
		И Не ЗначениеЗаполнено(Запись.ДокументРегистрации); 
КонецФункции

#КонецОбласти

