#Область ПрограммныйИнтерфейс

#Область ПечатьТТН

// Обработчик команды печати ТТН.
//
// Параметры:
//	ОписаниеКоманды - Структура - структура с описанием команды.
//
// Возвращаемое значение:
//  Неопределено - возвращать результат не требуется.
//
Функция ВыполнитьКомандуПечати_ТТН(ОписаниеКоманды) Экспорт
	                                     
	ПараметрыФормы = Новый Структура("Печать", Истина);
	ДополнительныеПараметры = Новый Структура("ОписаниеКоманды", ОписаниеКоманды);
	
	ОповещениеПродолжения = Новый ОписаниеОповещения(
			"ЗавершениеВводаДополнительнойИнформации", 
			ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("Обработка.гкс_ПечатьТТН_Беларусь.Форма.Форма",
		ПараметрыФормы,
		ОписаниеКоманды.Форма,
		ОписаниеКоманды.Форма.УникальныйИдентификатор, , ,
		ОповещениеПродолжения);
	
	Возврат Неопределено;	
	
КонецФункции 

#КонецОбласти 

#Область ПриемныйАкт_ЗПП14

// Обработчик команды печати приемный акт.
//
// Параметры:
//	ОписаниеКоманды - Структура - структура с описанием команды.
//
// Возвращаемое значение:
//  Неопределено - возвращать результат не требуется.
//
Функция ВыполнитьКомандуПечати_ПриемныйАкт_ЗПП14(ОписаниеКоманды) Экспорт
	                                     
	ПараметрыФормы = Новый Структура("Печать", Истина);
	ДополнительныеПараметры = Новый Структура("ОписаниеКоманды", ОписаниеКоманды);
	
	ОповещениеПродолжения = Новый ОписаниеОповещения(
			"ЗавершениеВводаДополнительнойИнформации", 
			ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("Обработка.гкс_ПечатьПриемныйАкт_ЗПП14.Форма.Форма",
		ПараметрыФормы,
		ОписаниеКоманды.Форма,
		ОписаниеКоманды.Форма.УникальныйИдентификатор, , ,
		ОповещениеПродолжения);
	
	Возврат Неопределено;	
	
КонецФункции

#КонецОбласти

#Область АктРасхожденияВеса

// Обработчик команды печати Акт расхождения веса.
//
// Параметры:
//	ОписаниеКоманды - Структура - структура с описанием команды.
//
// Возвращаемое значение:
//  Неопределено - возвращать результат не требуется.
//
Функция ВыполнитьКомандуПечати_АктРасхожденияВеса(ОписаниеКоманды) Экспорт
	                                     
	ПараметрыФормы = Новый Структура("Печать", Истина);
	ДополнительныеПараметры = Новый Структура("ОписаниеКоманды", ОписаниеКоманды);
	
	ОповещениеПродолжения = Новый ОписаниеОповещения(
			"ЗавершениеВводаДополнительнойИнформации", 
			ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("Обработка.гкс_ПечатьАктРасхожденияВеса.Форма.Форма",
		ПараметрыФормы,
		ОписаниеКоманды.Форма,
		ОписаниеКоманды.Форма.УникальныйИдентификатор, , ,
		ОповещениеПродолжения);
	
	Возврат Неопределено;	
	
КонецФункции

#КонецОбласти

#Область АктВозврата

// Обработчик команды печати Акт возврата.
//
// Параметры:
//	ОписаниеКоманды - Структура - структура с описанием команды.
//
// Возвращаемое значение:
//  Неопределено - возвращать результат не требуется.
// 
Функция ВыполнитьКомандуПечати_АктВозврата(ОписаниеКоманды) Экспорт
	                                     
	ПараметрыФормы = Новый Структура("Печать", Истина);
	ДополнительныеПараметры = Новый Структура("ОписаниеКоманды", ОписаниеКоманды);
	
	ОповещениеПродолжения = Новый ОписаниеОповещения(
			"ЗавершениеВводаДополнительнойИнформации", 
			ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("Обработка.гкс_ПечатьАктВозврата_Беларусь.Форма.Форма",
					ПараметрыФормы,
					ОписаниеКоманды.Форма,
					ОписаниеКоманды.Форма.УникальныйИдентификатор, , ,
					ОповещениеПродолжения);

	Возврат Неопределено;	
	
КонецФункции


#КонецОбласти

// Выводит печатную форму
//
// Параметры:
//	ПараметрыПечати - Структура - структура с описанием команды. 
//	ДополнительныеПараметры - Структура 
//
Процедура ЗавершениеВводаДополнительнойИнформации(ПараметрыПечати, ДополнительныеПараметры) Экспорт
	
	ОписаниеКоманды = ДополнительныеПараметры.ОписаниеКоманды;
	
	Если ТипЗнч(ПараметрыПечати) = Тип("Структура") Тогда
		
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
			ОписаниеКоманды.МенеджерПечати,
			ОписаниеКоманды.Идентификатор,
			ОписаниеКоманды.ОбъектыПечати,
			ОписаниеКоманды.Форма,
			ПараметрыПечати);		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти