#Область СлужебныепроцедурыиФункции

Функция ПолучитьПараметрыСервера(Знач Псевдоним) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СервераОчередей.АдресСервера КАК АдресСервера,
	|	ВЫБОР
	|		КОГДА СервераОчередей.Порт = 0
	|			ТОГДА 5672
	|		ИНАЧЕ СервераОчередей.Порт
	|	КОНЕЦ КАК Порт,
	|	ВЫБОР
	|		КОГДА СервераОчередей.Логин = """"
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ СервераОчередей.Логин
	|	КОНЕЦ КАК Логин,
	|	СервераОчередей.Пароль КАК Пароль,
	|	ВЫБОР
	|		КОГДА СервераОчередей.ВиртуальныйХост = """"
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ СервераОчередей.ВиртуальныйХост
	|	КОНЕЦ КАК ВиртуальныйХост
	|ИЗ
	|	РегистрСведений.УдалитьСервераОчередей КАК СервераОчередей
	|ГДЕ
	|	СервераОчередей.Псевдоним = &Псевдоним";
	
	Запрос.УстановитьПараметр("Псевдоним", Псевдоним);
	
	Результат = Запрос.Выполнить();
	Параметры = Новый Структура;
	Для Каждого Колонка Из Результат.Колонки Цикл
		Параметры.Вставить(Колонка.Имя);
	КонецЦикла;
	
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Параметры, Выборка);
	КонецЕсли;
	
	Возврат Параметры;
	
КонецФункции

#КонецОбласти