
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Перем ПараметрыВыгрузкиОбъектов;
	
	Параметры.Свойство("ПараметрыВыгрузкиОбъектов", ПараметрыВыгрузкиОбъектов);
	
	Если НЕ ЗначениеЗаполнено(ПараметрыВыгрузкиОбъектов) Тогда
		
		ТекстИсключения = НСтр("'Форма предназначена только для вызова из формы элемента ""Получатели данных""!!!'");
		ВызватьИсключение ТекстИсключения;
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ПараметрыВыгрузкиОбъектов, "ИмяПОД, ИдентифкаторСтроки");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьНастройку(Команда)
	
	Результат = Новый Структура;
	
	Если НЕ Модифицированность Тогда		
		Результат.Вставить("БезИзменений");		
	Иначе
		
		Результат.Вставить("ИмяПОД", ИмяПОД);
		Результат.Вставить("ИдентифкаторСтроки", ИдентифкаторСтроки);

	КонецЕсли;
				
	ЭтотОбъект.Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти

