// @strict-types

#Область ПрограммныйИнтерфейс

// Есть автоматическое формирование документов для точки маршрута.
// 
// Параметры:
//  ТочкаМаршрута - СправочникСсылка.гкс_ТочкиМаршрута - 
// 
// Возвращаемое значение:
//  Булево - Включено автоматическое формирование документов для точки маршрута
//
Функция ЕстьАвтоматическоеФормированиеДокументовДляТочкиМаршрута(ТочкаМаршрута) Экспорт
	
	ИмяНастройки = "АвтоматическоеФормированиеДокументов";
	ВсеНастройкиТочкиМаршрута = РегистрыСведений
	                               .гкс_НастройкиПриемкаПЛКПоТочкамМаршрута
	                               .ВсеНастройкиТочкиМаршрута(ТочкаМаршрута);
	
	ОписаниеТипаБулево = Новый ОписаниеТипов("Булево"); 
	Результат = ОписаниеТипаБулево.ПривестиЗначение(ВсеНастройкиТочкиМаршрута[ИмяНастройки]);
	
	Возврат Результат;
	
КонецФункции

// Возвращает путь для выгрузки файлов для САРА
// 
// Возвращаемое значение:
//  Строка - Каталог САРА
//
Функция КаталогСАРА() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.гкс_ПутьКДокументамСАРА.Получить();
	
КонецФункции

#КонецОбласти
