#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
// Отправка статистики сообщений.
//
// Параметры:
//  ТипСообщений - Строка
Процедура ОтправкаСтатистикиСообщений(ТипСообщений) Экспорт
	Запрос = Новый Запрос;

	ЭтоВходящие = (ТипСообщений = "Входящие");
	СостоянияНеОбработано = Новый Массив;
	СостояниеОшибка = Новый Массив;


	Если ЭтоВходящие Тогда
		Запрос.Текст = ЗапросСостояниеВходящихСообщений();
		СостоянияНеОбработано.Добавить(Перечисления.гкс_СостоянияВходящихСообщенийRMQ.Зарегистрировано);
		СостоянияНеОбработано.Добавить(Перечисления.гкс_СостоянияВходящихСообщенийRMQ.ВОбработке);

		СостояниеОшибка.Добавить(Перечисления.гкс_СостоянияВходящихСообщенийRMQ.ОшибкаОбработки);

	Иначе
		Запрос.Текст = ЗапросСостояниеИсходящихСообщений();

		СостоянияНеОбработано.Добавить(Перечисления.гкс_СостоянияИсходящихСообщенийRMQ.Подготовлено);

		СостояниеОшибка.Добавить(Перечисления.гкс_СостоянияИсходящихСообщенийRMQ.ОшибкаОбработкиПолучателем);
		СостояниеОшибка.Добавить(Перечисления.гкс_СостоянияИсходящихСообщенийRMQ.ОшибкаФормированияСостояния);

	КонецЕсли;



	Запрос.УстановитьПараметр("Состояние", СостоянияНеОбработано);
	Запрос.УстановитьПараметр("СостояниеОшибка", СостояниеОшибка);

	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;

	Выборка = Результат.Выбрать();
	Выборка.Следующий();

	СтрокаСоединенияИнформационнойБазы = СтрокаСоединенияИнформационнойБазы();

	ИмяБазы = "";

	Если Не гкс_ОбщегоНазначенияКлиентСервер.ИнформационнаяБазаФайловая(СтрокаСоединенияИнформационнойБазы) Тогда
		ПараметрыСоединения = гкс_СтроковыеФункцииКлиентСервер.ПараметрыИзСтроки(СтрокаСоединенияИнформационнойБазы());
		ПараметрыСоединения.Свойство("Ref", ИмяБазы);
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ИмяБазы) Тогда
		Возврат;
	КонецЕсли;


	СтруктураСообщения = Новый Структура;
	СтруктураСообщения.Вставить("DateTime", XMLСтрока(ТекущаяДатаСеанса()));
	СтруктураСообщения.Вставить("BaseName", ИмяБазы);
	СтруктураСообщения.Вставить("Type", ТипСообщений);
	СтруктураСообщения.Вставить("MessageCount", Выборка.Всего);
	СтруктураСообщения.Вставить("Unprocessed", Выборка.НеОбработано);
	СтруктураСообщения.Вставить("ErrorCount", Выборка.Ошибки);

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураСообщения);

	Сообщение = ЗаписьJSON.Закрыть();
	гкс_ОчередьСообщенийRMQ.ПроизвольноеСообщениеRMQ(Сообщение);

КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
Функция ЗапросСостояниеВходящихСообщений()
	Возврат "ВЫБРАТЬ
	|	гкс_СостоянияВходящихСообщений.Сообщение КАК Сообщение,
	|	МАКСИМУМ(гкс_СостоянияВходящихСообщений.УниверсальнаяДатаСобытияВМиллисекундах) КАК
	|		УниверсальнаяДатаСобытияВМиллисекундах
	|ПОМЕСТИТЬ ВТ_ДатыВходящих
	|ИЗ
	|	РегистрСведений.гкс_СостоянияВходящихСообщений КАК гкс_СостоянияВходящихСообщений
	|СГРУППИРОВАТЬ ПО
	|	гкс_СостоянияВходящихСообщений.Сообщение
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сообщение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.НеОбработано КАК НеОбработано,
	|	Т.Ошибки КАК Ошибки,
	|	Т.Всего КАК Всего
	|ИЗ
	|	(ВЫБРАТЬ
	|		КОЛИЧЕСТВО(гкс_СостоянияВходящихСообщений.Сообщение) КАК НеОбработано,
	|		NULL КАК Ошибки,
	|		NULL КАК Всего
	|	ИЗ
	|		ВТ_ДатыВходящих КАК ВТ_ДатыВходящих
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СостоянияВходящихСообщений КАК гкс_СостоянияВходящихСообщений
	|			ПО ВТ_ДатыВходящих.Сообщение = гкс_СостоянияВходящихСообщений.Сообщение
	|			И
	|				гкс_СостоянияВходящихСообщений.УниверсальнаяДатаСобытияВМиллисекундах = ВТ_ДатыВходящих.УниверсальнаяДатаСобытияВМиллисекундах
	|	ГДЕ
	|		гкс_СостоянияВходящихСообщений.Состояние В (&Состояние)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		0,
	|		КОЛИЧЕСТВО(гкс_СостоянияВходящихСообщений.Сообщение),
	|		NULL
	|	ИЗ
	|		ВТ_ДатыВходящих КАК ВТ_ДатыВходящих
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СостоянияВходящихСообщений КАК гкс_СостоянияВходящихСообщений
	|			ПО ВТ_ДатыВходящих.Сообщение = гкс_СостоянияВходящихСообщений.Сообщение
	|			И
	|				гкс_СостоянияВходящихСообщений.УниверсальнаяДатаСобытияВМиллисекундах = ВТ_ДатыВходящих.УниверсальнаяДатаСобытияВМиллисекундах
	|	ГДЕ
	|		гкс_СостоянияВходящихСообщений.Состояние В (&СостояниеОшибка)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		0,
	|		0,
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ДатыВходящих.Сообщение)
	|	ИЗ
	|		ВТ_ДатыВходящих КАК ВТ_ДатыВходящих) КАК Т
	|СГРУППИРОВАТЬ ПО
	|	Т.НеОбработано,
	|	Т.Ошибки,
	|	Т.Всего";
КонецФункции

Функция ЗапросСостояниеИсходящихСообщений()
	Возврат "ВЫБРАТЬ
	|	гкс_СостоянияИсходящихСообщений.Сообщение КАК Сообщение,
	|	МАКСИМУМ(гкс_СостоянияИсходящихСообщений.УниверсальнаяДатаСобытияВМиллисекундах) КАК
	|		УниверсальнаяДатаСобытияВМиллисекундах
	|ПОМЕСТИТЬ ВТ_ДатыВходящих
	|ИЗ
	|	РегистрСведений.гкс_СостоянияИсходящихСообщений КАК гкс_СостоянияИсходящихСообщений
	|СГРУППИРОВАТЬ ПО
	|	гкс_СостоянияИсходящихСообщений.Сообщение
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сообщение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.НеОбработано КАК НеОбработано,
	|	Т.Ошибки КАК Ошибки,
	|	Т.Всего КАК Всего
	|ИЗ
	|	(ВЫБРАТЬ
	|		КОЛИЧЕСТВО(гкс_СостоянияИсходящихСообщений.Сообщение) КАК НеОбработано,
	|		NULL КАК Ошибки,
	|		NULL КАК Всего
	|	ИЗ
	|		ВТ_ДатыВходящих КАК ВТ_ДатыВходящих
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СостоянияИсходящихСообщений КАК гкс_СостоянияИсходящихСообщений
	|			ПО ВТ_ДатыВходящих.Сообщение = гкс_СостоянияИсходящихСообщений.Сообщение
	|			И
	|				гкс_СостоянияИсходящихСообщений.УниверсальнаяДатаСобытияВМиллисекундах = ВТ_ДатыВходящих.УниверсальнаяДатаСобытияВМиллисекундах
	|	ГДЕ
	|		гкс_СостоянияИсходящихСообщений.Состояние В (&Состояние)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		0,
	|		КОЛИЧЕСТВО(гкс_СостоянияИсходящихСообщений.Сообщение),
	|		NULL
	|	ИЗ
	|		ВТ_ДатыВходящих КАК ВТ_ДатыВходящих
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СостоянияИсходящихСообщений КАК гкс_СостоянияИсходящихСообщений
	|			ПО ВТ_ДатыВходящих.Сообщение = гкс_СостоянияИсходящихСообщений.Сообщение
	|			И
	|				гкс_СостоянияИсходящихСообщений.УниверсальнаяДатаСобытияВМиллисекундах = ВТ_ДатыВходящих.УниверсальнаяДатаСобытияВМиллисекундах
	|	ГДЕ
	|		гкс_СостоянияИсходящихСообщений.Состояние В (&СостояниеОшибка)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		0,
	|		0,
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ДатыВходящих.Сообщение)
	|	ИЗ
	|		ВТ_ДатыВходящих КАК ВТ_ДатыВходящих) КАК Т
	|СГРУППИРОВАТЬ ПО
	|	Т.НеОбработано,
	|	Т.Ошибки,
	|	Т.Всего";
КонецФункции
#КонецОбласти


#КонецЕсли
