#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ИнициализироватьИспользованиеРегламентныхЗаданийWarehouse();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьИспользованиеРегламентныхЗаданийWarehouse()
	
	УстановитьПривилегированныйРежим(Истина);
	
	РегЗадания = Метаданные.РегламентныеЗадания;	
	ИзменитьЗапистьЗначениеРегламентногоЗадания(РегЗадания.гкс_ПолучениеДанныхWarehouse);
	ИзменитьЗапистьЗначениеРегламентногоЗадания(РегЗадания.гкс_ОбработкаВходящихДанныхWarehouse);
	
КонецПроцедуры

Процедура ИзменитьЗапистьЗначениеРегламентногоЗадания(РегЗаданияМетаданные)
	
	Отбор = Новый Структура;
	Отбор.Вставить("Метаданные", РегЗаданияМетаданные);
	
	МассивЗаданий = РегламентныеЗадания.ПолучитьРегламентныеЗадания(Отбор);
	
	Для Каждого Задание Из МассивЗаданий Цикл
		Если Задание.Использование <> Значение Тогда
			Задание.Использование = Значение;
			Задание.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

