#Область ПрограммныйИнтерфейс

#Область Проведение
// Формирует параметры для проведения документа по регистрам учетного механизма через общий механизм проведения.
//
// Параметры:
//  Документ - ДокументОбъект - записываемый документ
//  Свойства - ФиксированнаяСтруктура - свойства документа (См. ПроведениеДокументов.СвойстваДокумента).
//
// Возвращаемое значение:
//  Структура - параметры учетного механизма (См. ПроведениеДокументов.ПараметрыУчетногоМеханизма()).
//
Функция ПараметрыДляПроведенияДокумента(Документ, Свойства) Экспорт
	
	Параметры = гкс_ПроведениеДокументов.ПараметрыУчетногоМеханизма();
	
	// Проведение
	Если Не Свойства.РежимЗаписи = РежимЗаписиДокумента.Запись Тогда		
		Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыСведений.гкс_ВнешниеПробы);
		Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыСведений.гкс_ВнешниеПробыПоЗаявкамНаПеревозку);
		Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыСведений.гкс_ВнешниеПробыРегистрации);
		Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыСведений.гкс_КонтрольЗаполненияВнешнихПроб);
	КонецЕсли;
		
	Возврат Параметры;
	
КонецФункции

// Процедура формирования движений по подчиненным регистрам.
//
// Параметры:
//   ТаблицыДляДвижений - Структура - таблицы данных документа
//   Движения - КоллекцияДвижений - коллекция наборов записей движений документа
//   Отказ - Булево - признак отказа от проведения документа.
//
Процедура ОтразитьДвижения(ТаблицыДляДвижений, Движения, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ТаблицыДляДвижений.Свойство("Таблицагкс_ВнешниеПробы") 
		И ЗначениеЗаполнено(ТаблицыДляДвижений.Таблицагкс_ВнешниеПробы) Тогда
		
		Движения.гкс_ВнешниеПробы.Записывать = Истина;
		Движения.гкс_ВнешниеПробы.Загрузить(ТаблицыДляДвижений.Таблицагкс_ВнешниеПробы);				
	КонецЕсли;
	
	Если ТаблицыДляДвижений.Свойство("Таблицагкс_ВнешниеПробыПоЗаявкамНаПеревозку")	
		И ЗначениеЗаполнено(ТаблицыДляДвижений.Таблицагкс_ВнешниеПробыПоЗаявкамНаПеревозку) Тогда
		
		Движения.гкс_ВнешниеПробыПоЗаявкамНаПеревозку.Записывать = Истина;
		Движения.гкс_ВнешниеПробыПоЗаявкамНаПеревозку.Загрузить(
			ТаблицыДляДвижений.Таблицагкс_ВнешниеПробыПоЗаявкамНаПеревозку);		
	КонецЕсли;
	
	Если ТаблицыДляДвижений.Свойство("Таблицагкс_ВнешниеПробыРегистрации")
		И ЗначениеЗаполнено(ТаблицыДляДвижений.Таблицагкс_ВнешниеПробыРегистрации) Тогда
		
		Движения.гкс_ВнешниеПробыРегистрации.Записывать = Истина;
		Движения.гкс_ВнешниеПробыРегистрации.Загрузить(ТаблицыДляДвижений.Таблицагкс_ВнешниеПробыРегистрации);				
	КонецЕсли;
	
	Если ТаблицыДляДвижений.Свойство("Таблицагкс_КонтрольЗаполненияВнешнихПроб")	
		И ЗначениеЗаполнено(ТаблицыДляДвижений.Таблицагкс_КонтрольЗаполненияВнешнихПроб) Тогда
		
		Движения.гкс_КонтрольЗаполненияВнешнихПроб.Записывать = Истина;
		Движения.гкс_КонтрольЗаполненияВнешнихПроб.Загрузить(
			ТаблицыДляДвижений.Таблицагкс_КонтрольЗаполненияВнешнихПроб);	
	КонецЕсли;
	
КонецПроцедуры

// Возникает перед выполнением записи регистров документа.
//
// Параметры:
//  Документ - ДокументОбъект - записываемый документ
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - менеджер временных таблиц,
//								используемый для хранения таблиц контроля изменений регистров.
//  Отказ - Булево - признак отказа от проведения документа.
//
Процедура ПередЗаписьюДвиженийДокумента(Документ, МенеджерВременныхТаблиц, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Возникает после выполнения записи регистров документа.
//
// Параметры:
//  Документ - ДокументОбъект - записываемый документ
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - менеджер временных таблиц,
//								используемый для хранения таблиц контроля изменений регистров.
//  Отказ - Булево - признак отказа от проведения документа.
//
Процедура ПослеЗаписиДвиженийДокумента(Документ, МенеджерВременныхТаблиц, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

// Получает занчения показателей внешней пробы с типом "лот на 1000т"
//
// Параметры:
//	ВнешняяПроба - ДокументСсылка.гкс_ВнешняяПроба - Документ внешней пробы
//
// Возвращаемое значение: 
//		ТаблицаЗначений - таблица значений внешних проб
//
Функция ЗначенияВнешнейПробы(ВнешняяПроба) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВнешняяПробаКачественныеПоказатели.Показатель КАК Показатель,
		|	ВнешняяПробаКачественныеПоказатели.Значение КАК ЗначениеПоказателя
		|ИЗ
		|	Документ.гкс_ВнешняяПроба.КачественныеПоказатели КАК ВнешняяПробаКачественныеПоказатели
		|ГДЕ
		|	ВнешняяПробаКачественныеПоказатели.Ссылка = &Ссылка
		|	И ВнешняяПробаКачественныеПоказатели.ТипВнешнейПробы = ЗНАЧЕНИЕ(Справочник.гкс_ТипыВнешнихПробWarehouse.ЛотНаТысячуТон)
		|	И ВнешняяПробаКачественныеПоказатели.Показатель <> ЗНАЧЕНИЕ(Справочник.гкс_ПоказателиАнализовНоменклатуры.ПустаяСсылка)
		|	И ВнешняяПробаКачественныеПоказатели.Значение <> 0";
	
	Запрос.УстановитьПараметр("Ссылка", ВнешняяПроба);
		
	РезультатЗапроса = Запрос.Выполнить();
		
	Возврат РезультатЗапроса.Выгрузить();

КонецФункции	

#КонецОбласти