
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
		
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		гкс_ЗаполнениеДокументов.ЗаполнитьПоСтруктуре(ЭтотОбъект, ДанныеЗаполнения);
		Если ДанныеЗаполнения.Свойство("Регистрация") И ТипЗнч(ДанныеЗаполнения["Регистрация"]) = Тип("Массив") Тогда
			ЗаполнитьСписокРегистрацийИзМассива(ДанныеЗаполнения["Регистрация"]);
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	
	Префикс = ПолучитьПрефиксПоТекущейДате();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПрефиксПоТекущейДате()
	
	//ШаблонПрефикса = "%Год%%Месяц%%День%";
	ТекущаяДата = ТекущаяДатаСеанса();
	Префикс = Формат(ТекущаяДата, "ДФ=yyyyddMM;");
	
	Возврат Префикс;
	
КонецФункции

Процедура ЗаполнитьСписокРегистрацийИзМассива(МассивРегистраций)
	
	Для Каждого Регистрация Из МассивРегистраций Цикл
		НовРегистрация = СписокРегистраций.Добавить();
		НовРегистрация.ДокументРегистрации = Регистрация;	
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли