#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура; 
	ПараметрыФормы.Вставить("ОбъектыСобытий", ОбъектыСобытийИзВыделенныхСтрок(ПараметрКоманды));
	ОткрытьФорму("Обработка.гкс_УправлениеОбъектамиИнтеграции.Форма.ПовторноеФормированиеСообщенийОбъектов", 
	             ПараметрыФормы, 
	             ПараметрыВыполненияКоманды.Источник, 
	             ПараметрыВыполненияКоманды.Уникальность, 
	             ПараметрыВыполненияКоманды.Окно, 
	             ПараметрыВыполненияКоманды.НавигационнаяСсылка);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыиФункции

&НаСервере
Функция ОбъектыСобытийИзВыделенныхСтрок(ПараметрКоманды)    
	
	Запрос = Новый Запрос;   
	Запрос.УстановитьПараметр("Ссылки", ПараметрКоманды);
	Запрос.Текст = ТекстЗапросаОбъектыСобытийИзВыделенныхСтрок();
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Объект");
	
КонецФункции

&НаСервере
Функция ТекстЗапросаОбъектыСобытийИзВыделенныхСтрок()    
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИсходящиеСообщенияВыгруженныеОбъекты.Объект КАК Объект
	|ИЗ
	|	Справочник.ИсходящиеСообщения.ВыгруженныеОбъекты КАК ИсходящиеСообщенияВыгруженныеОбъекты
	|ГДЕ
	|	ИсходящиеСообщенияВыгруженныеОбъекты.Ссылка В (&Ссылки)";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти