#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если НЕ ЗначениеЗаполнено(ПараметрКоманды) Тогда
		гкс_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("'Не выбрано сообщение(я) для возврата в очередь'"));
		Возврат;		
	КонецЕсли;
	
	ВернутьвОчередь(ПараметрКоманды);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВернутьвОчередь(Объекты)
	
	УстановитьПривилегированныйРежим(Истина);	
	Обработки.гкс_УправлениеОбъектамиИнтеграции.ВернутьОбъектыВОчередь(Объекты);
	
КонецПроцедуры

#КонецОбласти
