
#Область ПрограммныйИнтерфейс

// Возвращает Тип регистрации по Виду операции фрахта.
// 
// Параметры:
//  ВидОперации - ПеречислениеСсылка.гкс_ВидыОперацийФрахта - анализируемый Вид операции.
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.гкс_ТипРегистрации - Найденный Тип регистрации по виду операции фрахта.
Функция ТипРегистрацииПоВидуОперацииФрахта(ВидОперации) Экспорт
	
	Если ВидОперации = ПредопределенноеЗначение("Перечисление.гкс_ВидыОперацийФрахта.ОтгрузкаПродукции") Тогда
		ТипРегистрации = ПредопределенноеЗначение("Перечисление.гкс_ТипРегистрации.Отгрузка");
	ИначеЕсли ВидОперации = ПредопределенноеЗначение("Перечисление.гкс_ВидыОперацийФрахта.ПоставкаСырья") Тогда
		ТипРегистрации = ПредопределенноеЗначение("Перечисление.гкс_ТипРегистрации.Приемка");
	Иначе
		ТипРегистрации = ПредопределенноеЗначение("Перечисление.гкс_ТипРегистрации.ПустаяСсылка");
	КонецЕсли;
	
	Возврат ТипРегистрации;
	
КонецФункции

// Возвращает Вид операции фрахта по Типу регистрации.
// 
// Параметры:
//  ТипРегистрации - ПеречислениеСсылка.гкс_ТипРегистрации - анализируемый Тип регистрации.
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.гкс_ВидыОперацийФрахта - Найденный Вид операции фрахта по тип регистрации.
Функция ВидОперацииФрахтаПоТипуРегистрации(ТипРегистрации) Экспорт
	
	Если ТипРегистрации = ПредопределенноеЗначение("Перечисление.гкс_ТипРегистрации.Отгрузка") Тогда
		ВидОперации = ПредопределенноеЗначение("Перечисление.гкс_ВидыОперацийФрахта.ОтгрузкаПродукции");
	ИначеЕсли ТипРегистрации = ПредопределенноеЗначение("Перечисление.гкс_ТипРегистрации.Приемка") Тогда
		ВидОперации = ПредопределенноеЗначение("Перечисление.гкс_ВидыОперацийФрахта.ПоставкаСырья");
	Иначе
		ВидОперации = ПредопределенноеЗначение("Перечисление.гкс_ВидыОперацийФрахта.ПустаяСсылка");
	КонецЕсли;
	
	Возврат ВидОперации;
	
КонецФункции

#КонецОбласти