#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Процедура добавляет запись в регистр по переданным значениям структуры.
Процедура ДобавитьЗапись(Запись, Загрузка = Ложь) Экспорт
	
    гкс_ОбменДаннымиСервер.ДобавитьЗаписьВРегистрСведений(Запись, "гкс_РегистрацииПоЭлектроннойОчереди",
    	Загрузка);
		
КонецПроцедуры

// Удаляет набор записей в регистре по переданным значениям структуры.
//
// Параметры:
//  Запись - Структура - структура, по значениям которой необходимо удалить набор записей.
//  Загрузка - Булево - признак, выполнять загрузку в режиме обмена или нет
// 
Процедура УдалитьЗапись(Запись, Загрузка = Ложь) Экспорт
	
    гкс_ОбменДаннымиСервер.УдалитьНаборЗаписейВРегистреСведений(Запись, "гкс_РегистрацииПоЭлектроннойОчереди",
    	Загрузка);
		
КонецПроцедуры

#КонецОбласти

// Получить документ записи в очередь для документа регистрации
// 
// Параметры:
//  ДокументРегистрации - ДокументСсылка.гкс_РегистрацияНаПЛК - документ для которого идет поиск
// 
// Возвращаемое значение:
//  ДокументСсылка.гкс_ЗаписьВОчередьПриемкиПЛК
//	или ДокументСсылка.гкс_ЗаписьВОчередьОтгрузкиПЛК - найденный документ записи в электронную очередь
//
Функция ИнформацияОЗаписиВОчереди(Знач ДокументРегистрации) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	РегистрацииПоЭлектроннойОчереди.ЗаписьВОчередь КАК ЗаписьВОчередь
	|ИЗ
	|	РегистрСведений.гкс_РегистрацииПоЭлектроннойОчереди КАК РегистрацииПоЭлектроннойОчереди
	|ГДЕ
	|	РегистрацииПоЭлектроннойОчереди.РегистрацияНаПЛК = &Регистрация
	|	И НЕ РегистрацииПоЭлектроннойОчереди.ЗаписьВОчередь ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Регистрация", ДокументРегистрации);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда 	
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат = Выборка.ЗаписьВОчередь; 
	Иначе
		Результат = Неопределено;
	КонецЕсли;	
	
	Возврат Результат;
		
КонецФункции

#КонецОбласти

#КонецЕсли