#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	гкс_ФормыОбъектовИАС.ПриСозданииНаСервереФормыСпискаСообщений(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьИдентификаторов();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если (ИмяСобытия = "ИзменениеСостоянийСообщений" И Параметр = "Справочник.ИсходящиеСообщения")
		ИЛИ ИмяСобытия = "ПовторноСформированныСообщенияПоОбъектамСобытий" Тогда
		Элементы.Список.Обновить();	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказатьИдентификаторы(Команда)

	Элементы.ПоказатьИдентификаторы.Пометка = НЕ Элементы.ПоказатьИдентификаторы.Пометка;
	УстановитьВидимостьИдентификаторов();
	 	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиТекущиеСостоянияСообщений(Команда)
	ПеренестиТекущиеСостоянияСообщенийСервер();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "Состояние" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Отбор = Новый Структура("Сообщение", Элементы.Список.ТекущаяСтрока);
				
		ОткрытьФорму("РегистрСведений.гкс_СостоянияИсходящихСообщений.ФормаСписка",
		Новый Структура("Отбор, ИсторияСообщения", Отбор, Истина),
		ЭтотОбъект,
		ЭтотОбъект.УникальныйИдентификатор,
		,
		,
		Новый ОписаниеОповещения("ОбновитьСписок", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьСписок(Результат, ДополнительныеПараметры) Экспорт
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьИдентификаторов()
	
	Элементы.ИдентификаторСообщения.Видимость = Элементы.ПоказатьИдентификаторы.Пометка;
	Элементы.КорневойИдентификаторСообщения.Видимость = Элементы.ПоказатьИдентификаторы.Пометка;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьВыборкуТекущихСостоянийИсходящихСообщений()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СостоянияИсходящихСообщений.Сообщение КАК Сообщение,
	|	СостоянияИсходящихСообщений.УчастникОбмена КАК УчастникОбмена,
	|	МАКСИМУМ(СостоянияИсходящихСообщений.УниверсальнаяДатаСобытияВМиллисекундах) КАК УниверсальнаяДатаСобытияВМиллисекундах
	|ПОМЕСТИТЬ ВТ_МаксимыльныеСостояния
	|ИЗ
	|	РегистрСведений.гкс_СостоянияИсходящихСообщений КАК СостоянияИсходящихСообщений
	|
	|СГРУППИРОВАТЬ ПО
	|	СостоянияИсходящихСообщений.Сообщение,
	|	СостоянияИсходящихСообщений.УчастникОбмена
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сообщение,
	|	УчастникОбмена,
	|	УниверсальнаяДатаСобытияВМиллисекундах
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксимыльныеСостояния.Сообщение КАК Сообщение,
	|	МаксимыльныеСостояния.УчастникОбмена КАК УчастникОбмена,
	|	МаксимыльныеСостояния.УниверсальнаяДатаСобытияВМиллисекундах КАК УниверсальнаяДатаСобытияВМиллисекундах,
	|	СостоянияИсходящихСообщений.Состояние КАК Состояние
	|ИЗ
	|	ВТ_МаксимыльныеСостояния КАК МаксимыльныеСостояния
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СостоянияИсходящихСообщений КАК СостоянияИсходящихСообщений
	|		ПО (МаксимыльныеСостояния.Сообщение = СостоянияИсходящихСообщений.Сообщение
	|				И МаксимыльныеСостояния.УчастникОбмена = СостоянияИсходящихСообщений.УчастникОбмена
	|				И МаксимыльныеСостояния.УниверсальнаяДатаСобытияВМиллисекундах = СостоянияИсходящихСообщений.УниверсальнаяДатаСобытияВМиллисекундах)";
	
	Возврат Запрос.Выполнить().Выбрать();

КонецФункции

&НаСервереБезКонтекста
Процедура ПеренестиТекущиеСостоянияСообщенийСервер()
	
	НачатьТранзакцию();
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.гкс_СостоянияИсходящихСообщений");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		
		ВыборкаЗаписей = СформироватьВыборкуТекущихСостоянийИсходящихСообщений();
		
		Набор = РегистрыСведений.гкс_ТекущиеСостоянияСообщений.СоздатьНаборЗаписей();
		
		Пока ВыборкаЗаписей.Следующий() Цикл
			
			Запись = Набор.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, ВыборкаЗаписей);
			
		КонецЦикла;
		
		Набор.Записать();
		
		ЗафиксироватьТранзакцию();
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = Нстр("ru = 'Перенос состояний произведен успешно.'");
		Сообщение.Сообщить();
		
	Исключение
		
		ОтменитьТранзакцию();
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Перенос состояний исходящих сообщений'"),
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
			
		ВызватьИсключение ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
			
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти
