
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает ссылку на Источник по Идентификатору события.
// 
// Параметры:
//  ИдентификаторСобытия - Строка - Идентификатор события для отбора записей.
// 
// Возвращаемое значение:
//  ДокументСсылка.гкс_НаправлениеНаРазгрузку, Неопределено - надейнный Источник.
Функция ИсточникПоИдентификаторуСобытия(ИдентификаторСобытия) Экспорт 
	
	Источник = Неопределено;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИдентификаторСобытия", ИдентификаторСобытия);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПодтвержденияДоставкиСообщений.Источник КАК Источник
	|ИЗ
	|	РегистрСведений.гкс_ПодтвержденияДоставкиСообщений.СрезПоследних(, ИдентификаторСобытия = &ИдентификаторСобытия) КАК
	|		ПодтвержденияДоставкиСообщений";
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда 
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Источник = Выборка.Источник;
		
	КонецЕсли;
	
	Возврат Источник;
	
КонецФункции

// Проверяет наличие записей по Состоянию и Идентификатору сообщения.
// 
// Параметры:
//  Состояние - ПеречислениеСсылка.гкс_СостоянияИсходящихСообщенийRMQ
//  ИдентификаторСообщения - Строка
// 
// Возвращаемое значение:
//  Булево - Истина, если для переданных параметров найдена запись.
Функция СостояниеСообщенияОтражено(Состояние, ИдентификаторСообщения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Состояние", Состояние);
	Запрос.УстановитьПараметр("ИдентификаторСообщения", ИдентификаторСообщения);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПодтвержденияДоставкиСообщений.ИдентификаторСобытия КАК ИдентификаторСобытия
	|ИЗ
	|	РегистрСведений.гкс_ПодтвержденияДоставкиСообщений.СрезПоследних(, Состояние = &Состояние
	|	И ИдентификаторСообщения = &ИдентификаторСообщения) КАК ПодтвержденияДоставкиСообщений";
	РезультатЗапроса = Запрос.Выполнить();
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

// Состояние соответствующее успешной обработке входящего сообщения.
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.гкс_СостоянияИсходящихСообщенийRMQ - Состояние успешно для входящего сообщения
Функция СостояниеУспешноДляВходящегоСообщения() Экспорт 
	Возврат Перечисления.гкс_СостоянияИсходящихСообщенийRMQ.ДоставленоИОбработано;
КонецФункции

// Состояние соответствующее ошибке обработки входящего сообщения.
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.гкс_СостоянияИсходящихСообщенийRMQ - Состояние ошибка для входящего сообщения
Функция СостояниеОшибкаДляВходящегоСообщения() Экспорт 
	Возврат Перечисления.гкс_СостоянияИсходящихСообщенийRMQ.ОшибкаОбработкиПолучателем;
КонецФункции

#КонецОбласти

#КонецЕсли