#Область ПрограммныйИнтерфейс
Функция ПрочитатьДанныеИзРегистра(ДокументПеревозки) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	гкс_СписокСюрвейеров.Номер КАК Номер,
	               |	гкс_СписокСюрвейеров.Сюрвейер КАК Сюрвейер,
	               |	гкс_СписокСюрвейеров.Отказ КАК Отказ,
	               |	гкс_СписокСюрвейеров.Примечание КАК Примечание,
	               |	гкс_СписокСюрвейеров.ДокументПеревозки
	               |ИЗ
	               |	РегистрСведений.гкс_СписокСюрвейеров КАК гкс_СписокСюрвейеров
	               |ГДЕ
	               |	гкс_СписокСюрвейеров.ДокументПеревозки = &ДокументПеревозки
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Номер";
	Запрос.УстановитьПараметр("ДокументПеревозки", ДокументПеревозки);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Возврат Результат.Выгрузить();
	КонецЕсли;	
КонецФункции	

Процедура ЗаписатьДанныеВРегистр(ДокументПеревозки, ТаблицаДанных)  Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Набор = РегистрыСведений.гкс_СписокСюрвейеров.СоздатьНаборЗаписей();
	Набор.Отбор.ДокументПеревозки.Установить(ДокументПеревозки);
	Набор.Прочитать();
	Набор.Загрузить(ТаблицаДанных);
	Набор.Записать(Истина);
КонецПроцедуры	
#КонецОбласти

