#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Фрахт.ТочкаМаршрута)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

// Создает таблицу значений по структуре пустого набора записей.
// 
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица набора записей
Функция ТаблицаНабораЗаписей() Экспорт
	Возврат СоздатьНаборЗаписей().Выгрузить();
КонецФункции

// Добавляет новые записи в Регистр.
// 
// Параметры:
//  ТаблицаНабораЗаписей - ТаблицаЗначений - Структура таблицы должна совпадать со структурой набора записей.
Процедура ДобавитьНовыеЗаписи(ТаблицаНабораЗаписей) Экспорт
	
	Если ТаблицаНабораЗаписей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Загрузить(ТаблицаНабораЗаписей);
	НаборЗаписей.Записать(РежимЗамещения.Добавление);
	
КонецПроцедуры

// Удаляет записи из Регистра.
// 
// Параметры:
//  ТаблицаНабораЗаписей - ТаблицаЗначений - Структура таблицы должна совпадать со структурой набора записей.
Процедура УдалитьЗаписи(ТаблицаНабораЗаписей) Экспорт
	
	Если ТаблицаНабораЗаписей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Загрузить(ТаблицаНабораЗаписей);
	НаборЗаписей.Записать(РежимЗамещения.Удаление);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли