#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
    
#Область ПрограммныйИнтерфейс
 
// Процедура добавляет запись в регистр по переданным значениям структуры.
Процедура ДобавитьЗапись(Запись, Загрузка = Ложь) Экспорт
    
    гкс_ОбменДаннымиСервер.ДобавитьЗаписьВРегистрСведений(Запись, "гкс_ВнешниеПробы", Загрузка);
    
КонецПроцедуры

// Создает структуру, содержащую имена и значения измерений, ресурсов и реквизитов регистра сведений.
//
// Возвращаемое значение:
//  Структура - коллекция измерений ресурсов и реквизитов.
//
Функция СтруктураЗаписи() Экспорт
	
	Возврат ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(СоздатьМенеджерЗаписи(), 
								Метаданные.РегистрыСведений.гкс_ВнешниеПробы);
    
КонецФункции

// Процедура удаляет набор записей в регистре по переданным значениям структуры.
Процедура УдалитьЗапись(СтруктураЗаписи, Загрузка = Ложь) Экспорт
	
	гкс_ОбменДаннымиСервер.УдалитьНаборЗаписейВРегистреСведений(СтруктураЗаписи, "гкс_ВнешниеПробы", Загрузка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИнициализироватьТаблицуВнешнейПробы() Экспорт
	
	ТипДата 					= Новый ОписаниеТипов("Дата");
	ТипЧисло					= Новый ОписаниеТипов("Число");
	ТипСтрока 					= Новый ОписаниеТипов("Строка");
	ТипВидПробы 				= Новый ОписаниеТипов("ПеречислениеСсылка.гкс_НазначенияИспользованияКачества");
	ТипПродукция 				= Новый ОписаниеТипов("СправочникСсылка.гкс_ПродукцияWarehouse");
	ТипПоказатель 				= Новый ОписаниеТипов("СправочникСсылка.гкс_ПоказателиКачестваWarehouse");
	ТипОрганизация              = Новый ОписаниеТипов("СправочникСсылка.Организации");
	ТипКонтрагенты 				= Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
	ТипТочкиМаршрута 			= Новый ОписаниеТипов("СправочникСсылка.гкс_ТочкиМаршрута");
	ТипТранспортныеСредства 	= Новый ОписаниеТипов("СправочникСсылка.ТранспортныеСредства");
	ТипКлассификаторСтанцийЖД 	= Новый ОписаниеТипов("СправочникСсылка.гкс_КлассификаторСтанцийЖД");
		
	ТаблицаВнешниеПробы = Новый ТаблицаЗначений;
	// Значения шапки
	ТаблицаВнешниеПробы.Колонки.Добавить("Период",					ТипДата);
	ТаблицаВнешниеПробы.Колонки.Добавить("ВидПробы",				ТипВидПробы);
	ТаблицаВнешниеПробы.Колонки.Добавить("ДатаПробы",				ТипДата);
	ТаблицаВнешниеПробы.Колонки.Добавить("ДатаПогрузки", 			ТипДата);
	ТаблицаВнешниеПробы.Колонки.Добавить("ДатаИзменения", 			ТипДата);
	ТаблицаВнешниеПробы.Колонки.Добавить("ИДКомпозитнойПробы", 		ТипСтрока);
	ТаблицаВнешниеПробы.Колонки.Добавить("ИДПробы", 				ТипСтрока);
	ТаблицаВнешниеПробы.Колонки.Добавить("Комментарий", 			ТипСтрока);
	ТаблицаВнешниеПробы.Колонки.Добавить("МестоИнспекции", 			ТипСтрока);
	ТаблицаВнешниеПробы.Колонки.Добавить("НомерДокумента", 			ТипСтрока);
	ТаблицаВнешниеПробы.Колонки.Добавить("НомерЗаявки", 			ТипСтрока);

	// Значение справочные
	ТаблицаВнешниеПробы.Колонки.Добавить("СтанцияОтправления", 		ТипКлассификаторСтанцийЖД);
	ТаблицаВнешниеПробы.Колонки.Добавить("СтанцияНазначения", 		ТипКлассификаторСтанцийЖД);
	ТаблицаВнешниеПробы.Колонки.Добавить("Сюрвейер", 				ТипКонтрагенты);
	ТаблицаВнешниеПробы.Колонки.Добавить("Элеватор", 				ТипТочкиМаршрута);
	ТаблицаВнешниеПробы.Колонки.Добавить("НомерТС", 				ТипСтрока);
	ТаблицаВнешниеПробы.Колонки.Добавить("ТранспортноеСредство", 	ТипТранспортныеСредства);
	ТаблицаВнешниеПробы.Колонки.Добавить("Показатель", 				ТипПоказатель);
	ТаблицаВнешниеПробы.Колонки.Добавить("Продукция", 				ТипПродукция);
	ТаблицаВнешниеПробы.Колонки.Добавить("Организация", 			ТипОрганизация);
	// Значение показателей
	ТаблицаВнешниеПробы.Колонки.Добавить("ВесБрутто", 				ТипЧисло);
	ТаблицаВнешниеПробы.Колонки.Добавить("ВесТары", 				ТипЧисло);
	ТаблицаВнешниеПробы.Колонки.Добавить("ВесНетто", 				ТипЧисло);
	ТаблицаВнешниеПробы.Колонки.Добавить("ЗначениеПоказателя", 		ТипЧисло);
	
	Возврат ТаблицаВнешниеПробы;
	
КонецФункции

Функция ВнешниеПробыПоВходящимДанным(ВнешняяПробаСсылка) Экспорт
	
	СтруктураДвижений = Документы.гкс_ВнешняяПроба.ДанныеДокументаДляПроведения(ВнешняяПробаСсылка, 
		Новый Структура("гкс_ВнешниеПробы, гкс_КонтрольЗаполненияВнешнихПроб"));
		
	Если СтруктураДвижений.Свойство("Таблицагкс_КонтрольЗаполненияВнешнихПроб") 
		И Не ЗначениеЗаполнено(СтруктураДвижений.Таблицагкс_КонтрольЗаполненияВнешнихПроб) Тогда
		Результат = СтруктураДвижений.Таблицагкс_ВнешниеПробы;
	Иначе
		Результат = Неопределено;
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
