// @strict-types

#Область ПрограммныйИнтерфейс

// Дата окончания периода сертификации.
//
// Возвращаемое значение:
//  Дата - Дата окончания периода сертификации
//
Функция ДатаОкончанияПериодаСертификации() Экспорт

	Возврат Константы.гкс_ДатаОкончанияПериодаСертификацииПоУмолчанию.Получить();

КонецФункции

// Возвращает массив нормативных показателей по условиям.
//
// Параметры:
//  ТочкаМаршрута - СправочникСсылка.гкс_ТочкиМаршрута - ПЛК
//  Номенклатура - СправочникСсылка.Номенклатура - Номенклатура
//  ВидПеревозки - ПеречислениеСсылка.гкс_ТипыТранспортныхСредствДоставки - Вид перевозки
//  НазначениеИспользованияКачества - ПеречислениеСсылка.гкс_НазначенияИспользованияКачества -
//  Период - Неопределено, Дата, Структура - Период
//
//  Массив из Структура
//			*Показатель - СправочникСсылка.гкс_ПоказателиАнализовНоменклатуры - Показатель усиленного контроля
//			*ЕдиницаИзмерения - СправочникСсылка.УпаковкиЕдиницыИзмерения - единица измерения показателя
//
Функция НормативныеПоказатели(ТочкаМаршрута, Номенклатура, ВидПеревозки, НазначениеИспользованияКачества,
	Период = Неопределено) Экспорт

    УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НормативнаяСертификация.ПоказательАнализа КАК Показатель,
		|	НормативнаяСертификация.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	НормативнаяСертификация.ОтклонятьКачество КАК ОтклонятьКачество,
		|	НормативнаяСертификация.ИскатьВнешниеПробы КАК ИскатьВнешниеПробы
		|ИЗ
		|	РегистрСведений.гкс_РезультатыНормативнойСертификацииНоменклатуры.СрезПоследних(
		|			&ДатаОкончания,
		|			Номенклатура = &Номенклатура
		|				И ТочкаМаршрута = &ТочкаМаршрута
		|				И ВидПеревозки = &ВидПеревозки
		|				И НазначениеИспользованияКачества = &НазначениеИспользованияКачества) КАК НормативнаяСертификация
		|ГДЕ
		|	НормативнаяСертификация.ПериодС <= &ДатаНачала
		|	И НормативнаяСертификация.ПериодПо >= НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ)";

	Если ТипЗнч(Период) = Тип("Дата") Тогда

		ДатаНачала = Период;
		ДатаОкончания = Период;

	ИначеЕсли ТипЗнч(Период) = Тип("Структура")
	И Период.Свойство("ДатаНачала") И Период.Свойство("ДатаОкончания") Тогда

		ДатаНачала = ?(ЗначениеЗаполнено(Период.ДатаНачала), Период.ДатаНачала, ТекущаяДатаСеанса());
		ДатаОкончания = ?(ЗначениеЗаполнено(Период.ДатаОкончания),
							Период.ДатаОкончания, ДатаОкончанияПериодаСертификации());

	Иначе
		ДатаНачала = ТекущаяДатаСеанса();
		ДатаОкончания = ДатаНачала;
	КонецЕсли;

	Запрос.УстановитьПараметр("ТочкаМаршрута", ТочкаМаршрута);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ВидПеревозки", ВидПеревозки);
	Запрос.УстановитьПараметр("НазначениеИспользованияКачества", НазначениеИспользованияКачества);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);

	РезультатЗапроса = Запрос.Выполнить();

	Если Не РезультатЗапроса.Пустой() Тогда
		Данные = РезультатЗапроса.Выгрузить();
		Результат = ОбщегоНазначения.ТаблицаЗначенийВМассив(Данные);
	Иначе
		Результат = Новый Массив;
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Подбирает спецификацию по фактическим значениям лабораторного анализа.
//
// Параметры:
//  ЛабораторныйАнализ - ДокументОбъект.гкс_ЛабораторныйАнализ - лабораторный анализ
//
// Возвращаемое значение:
// 	ДокументСсылка.гкс_НормативнаяСертификацияНоменклатуры - Нормативная спецификация
//
Функция НормативнаяСертификацияПоФактическомуКачеству(ЛабораторныйАнализ) Экспорт

	Если ТипЗнч(ЛабораторныйАнализ.гкс_ДокументРегистрации) <> Тип("ДокументСсылка.гкс_РегистрацияНаПЛК") Тогда
		Возврат Документы.гкс_НормативнаяСертификацияНоменклатуры.ПустаяСсылка();
	КонецЕсли;

	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Номенклатура", ЛабораторныйАнализ.Номенклатура);
	Запрос.УстановитьПараметр("ТочкаМаршрута", ЛабораторныйАнализ.ТочкаМаршрута);
	Запрос.УстановитьПараметр("ВидПеревозки", ЛабораторныйАнализ.гкс_ВидПеревозки);
	Запрос.УстановитьПараметр("НазначениеИспользованияКачества", ЛабораторныйАнализ.гкс_НазначениеИспользованияКачества);

	Запрос.УстановитьПараметр("КачественныеПоказатели", ЛабораторныйАнализ.КачественныеПоказатели.Выгрузить());

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЛабораторныйАнализКачественныеПоказатели.Показатель КАК Показатель,
	|	ЛабораторныйАнализКачественныеПоказатели.Значение КАК Значение
	|ПОМЕСТИТЬ ВТ_РезультатыАнализа
	|ИЗ
	|	&КачественныеПоказатели КАК ЛабораторныйАнализКачественныеПоказатели
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Номенклатура КАК Номенклатура,
	|	&ТочкаМаршрута КАК ТочкаМаршрута,
	|	&ВидПеревозки КАК ВидПеревозки,
	|	&НазначениеИспользованияКачества КАК НазначениеИспользованияКачества,
	|	ЕСТЬNULL(СегментацияКачестваНоменклатуры.СлужебнаяНоменклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК СлужебнаяНоменклатура
	|ПОМЕСТИТЬ ВТ_КлючиПоиска
	|ИЗ
	|	Документ.гкс_ЛабораторныйАнализ КАК ЛабораторныйАнализ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СегментацияКачестваНоменклатуры КАК СегментацияКачестваНоменклатуры
	|		ПО (СегментацияКачестваНоменклатуры.Номенклатура = &Номенклатура)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КлючиПоиска.Номенклатура КАК Номенклатура,
	|	ВТ_КлючиПоиска.ТочкаМаршрута КАК ТочкаМаршрута,
	|	ВТ_КлючиПоиска.ВидПеревозки КАК ВидПеревозки,
	|	ВТ_КлючиПоиска.НазначениеИспользованияКачества КАК НазначениеИспользованияКачества,
	|	ВТ_КлючиПоиска.СлужебнаяНоменклатура КАК СлужебнаяНоменклатура,
	|	НормативнаяСертификацияНоменклатуры.Ссылка КАК НормативнаяСертификация
	|ПОМЕСТИТЬ ВТ_КлючиПоискаИСпецификация
	|ИЗ
	|	ВТ_КлючиПоиска КАК ВТ_КлючиПоиска
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_НормативнаяСертификацияНоменклатуры КАК НормативнаяСертификацияНоменклатуры
	|		ПО ВТ_КлючиПоиска.ТочкаМаршрута = НормативнаяСертификацияНоменклатуры.ТочкаМаршрута
	|			И ВТ_КлючиПоиска.ВидПеревозки = НормативнаяСертификацияНоменклатуры.гкс_ВидПеревозки
	|			И ВТ_КлючиПоиска.НазначениеИспользованияКачества = НормативнаяСертификацияНоменклатуры.гкс_НазначениеИспользованияКачества
	|			И ВТ_КлючиПоиска.СлужебнаяНоменклатура = НормативнаяСертификацияНоменклатуры.Номенклатура
	|			И (НормативнаяСертификацияНоменклатуры.Проведен)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КлючиПоискаИСпецификация.Номенклатура КАК Номенклатура,
	|	ВТ_КлючиПоискаИСпецификация.СлужебнаяНоменклатура КАК СлужебнаяНоменклатура,
	|	ВТ_КлючиПоискаИСпецификация.НормативнаяСертификация КАК НормативнаяСертификация,
	|	НормативнаяСертификацияНоменклатурыАнализы.ПоказательАнализа КАК Показатель,
	|	НормативнаяСертификацияНоменклатурыАнализы.ЗначениеПоказателя КАК ЗначениеМин,
	|	НормативнаяСертификацияНоменклатурыАнализы.МаксЗначениеПоказателя КАК ЗначениеМакс,
	|	ЕСТЬNULL(ПриоритетыПоказателейКачества.Приоритет, 0) КАК Приоритет,
	|	ВТ_РезультатыАнализа.Значение КАК Значение
	|ПОМЕСТИТЬ ВТ_ТаблицаПодбора
	|ИЗ
	|	ВТ_КлючиПоискаИСпецификация КАК ВТ_КлючиПоискаИСпецификация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_НормативнаяСертификацияНоменклатуры.Анализы КАК НормативнаяСертификацияНоменклатурыАнализы
	|		ПО ВТ_КлючиПоискаИСпецификация.НормативнаяСертификация = НормативнаяСертификацияНоменклатурыАнализы.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_ПриоритетыПоказателейКачества КАК ПриоритетыПоказателейКачества
	|		ПО (НормативнаяСертификацияНоменклатурыАнализы.ПоказательАнализа = ПриоритетыПоказателейКачества.Показатель)
	|			И ВТ_КлючиПоискаИСпецификация.Номенклатура = ПриоритетыПоказателейКачества.Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РезультатыАнализа КАК ВТ_РезультатыАнализа
	|		ПО (НормативнаяСертификацияНоменклатурыАнализы.ПоказательАнализа = ВТ_РезультатыАнализа.Показатель)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ПриоритетыПоказателейКачества.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ ВТ_ПриоритетыМаксимум
	|ИЗ
	|	РегистрСведений.гкс_ПриоритетыПоказателейКачества КАК ПриоритетыПоказателейКачества
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КлючиПоиска КАК ВТ_КлючиПоиска
	|		ПО (ВТ_КлючиПоиска.Номенклатура = ПриоритетыПоказателейКачества.Номенклатура)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КлючиПоискаИСпецификация.НормативнаяСертификация КАК НормативнаяСертификация,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НормативнаяСертификацияНоменклатурыАнализы.ПоказательАнализа) КАК КоличествоПоказателей
	|ПОМЕСТИТЬ ВТ_ИтогиПоСпецификации
	|ИЗ
	|	ВТ_КлючиПоискаИСпецификация КАК ВТ_КлючиПоискаИСпецификация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_НормативнаяСертификацияНоменклатуры.Анализы КАК НормативнаяСертификацияНоменклатурыАнализы
	|		ПО ВТ_КлючиПоискаИСпецификация.НормативнаяСертификация = НормативнаяСертификацияНоменклатурыАнализы.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_КлючиПоискаИСпецификация.НормативнаяСертификация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаПодбора.СлужебнаяНоменклатура КАК СлужебнаяНоменклатура,
	|	ВТ_ТаблицаПодбора.НормативнаяСертификация КАК НормативнаяСертификация,
	|	ВТ_ТаблицаПодбора.Показатель КАК Показатель,
	|	ВТ_ТаблицаПодбора.ЗначениеМин КАК ЗначениеМин,
	|	ВТ_ТаблицаПодбора.ЗначениеМакс КАК ЗначениеМакс,
	|	ВТ_ТаблицаПодбора.Приоритет КАК Приоритет,
	|	ВТ_ТаблицаПодбора.Значение КАК Значение,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаПодбора.ЗначениеМакс > ВТ_ТаблицаПодбора.Значение
	|				И ВТ_ТаблицаПодбора.Значение >= ВТ_ТаблицаПодбора.ЗначениеМин
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВходитВДиапазон,
	|	ВЫБОР
	|		КОГДА ВТ_ПриоритетыМаксимум.Приоритет = ВТ_ТаблицаПодбора.Приоритет
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВысшийПриоритет,
	|	ЕСТЬNULL(ВТ_ИтогиПоСпецификации.КоличествоПоказателей, 0) КАК КоличествоПоказателей
	|ПОМЕСТИТЬ ВТ_ТаблицаОценок
	|ИЗ
	|	ВТ_ТаблицаПодбора КАК ВТ_ТаблицаПодбора
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтогиПоСпецификации КАК ВТ_ИтогиПоСпецификации
	|		ПО ВТ_ТаблицаПодбора.НормативнаяСертификация = ВТ_ИтогиПоСпецификации.НормативнаяСертификация,
	|	ВТ_ПриоритетыМаксимум КАК ВТ_ПриоритетыМаксимум
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаОценок.СлужебнаяНоменклатура КАК СлужебнаяНоменклатура,
	|	ВТ_ТаблицаОценок.НормативнаяСертификация КАК НормативнаяСертификация,
	|	СУММА(ВТ_ТаблицаОценок.ВходитВДиапазон * ВТ_ТаблицаОценок.ВысшийПриоритет * ВТ_ТаблицаОценок.Приоритет) + ВЫБОР
	|		КОГДА СУММА(ВТ_ТаблицаОценок.ВходитВДиапазон) = МАКСИМУМ(ВТ_ТаблицаОценок.КоличествоПоказателей)
	|				И МАКСИМУМ(ВТ_ТаблицаОценок.КоличествоПоказателей) <> 0
	|			ТОГДА 10
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Коэффициент
	|ПОМЕСТИТЬ ВТ_Расчет
	|ИЗ
	|	ВТ_ТаблицаОценок КАК ВТ_ТаблицаОценок
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТаблицаОценок.СлужебнаяНоменклатура,
	|	ВТ_ТаблицаОценок.НормативнаяСертификация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВТ_Расчет.СлужебнаяНоменклатура КАК СлужебнаяНоменклатура,
	|	ВТ_Расчет.НормативнаяСертификация КАК НормативнаяСертификация,
	|	ВТ_Расчет.Коэффициент КАК Коэффициент
	|ИЗ
	|	ВТ_Расчет КАК ВТ_Расчет
	|ГДЕ
	|	ВТ_Расчет.Коэффициент <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Коэффициент УБЫВ";

	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		Результат = ВыборкаДетальныеЗаписи.НормативнаяСертификация;
	Иначе
		Результат = Документы.гкс_НормативнаяСертификацияНоменклатуры.ПустаяСсылка();
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Показатели усиленного контроля.
// НазначениеИспользования - ПеречислениеСсылка.гкс_НазначенияИспользованияКачества -
// ЛабораторныйАнализ Лабораторный анализ
//
// Параметры:
//  РегистрацияНаПЛК Регистрация на ПЛК
//  НазначениеИспользования Назначение использования
//
// Возвращаемое значение:
//  Массив из Структура - *Показатель - СправочникСсылка.гкс_ПоказателиАнализовНоменклатуры - Показатель усиленного контроля
// *ЕдиницаИзмерения - СправочникСсылка.УпаковкиЕдиницыИзмерения - единица измерения показателя
Функция ПоказателиУсиленногоКонтроля(РегистрацияНаПЛК, НазначениеИспользования) Экспорт

	Результат = Новый Массив;

	Если Не ПолучитьФункциональнуюОпцию("гкс_ИспользоватьУсиленныйКонтрольКачества") Тогда
		Возврат Результат;
	КонецЕсли;

	ТипПробы = Неопределено;
	ДокументыРегистрации = Неопределено;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ПоказателиУсиленногоКонтроляПоРегистрации.Показатель КАК Показатель,
		|	ПоказателиАнализовНоменклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	РегистрСведений.гкс_ПоказателиУсиленногоКонтроляПоРегистрации КАК ПоказателиУсиленногоКонтроляПоРегистрации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.гкс_ПоказателиАнализовНоменклатуры КАК ПоказателиАнализовНоменклатуры
		|		ПО ПоказателиУсиленногоКонтроляПоРегистрации.Показатель = ПоказателиАнализовНоменклатуры.Ссылка
		|ГДЕ
		|	ПоказателиУсиленногоКонтроляПоРегистрации.ДокументРегистрации В (&ДокументыРегистрации)
		|	И ПоказателиУсиленногоКонтроляПоРегистрации.НазначениеИспользования = &НазначениеИспользования
		|	И ПоказателиУсиленногоКонтроляПоРегистрации.ТипПробы = &ТипПробы";

	Запрос.УстановитьПараметр("НазначениеИспользования", НазначениеИспользования);

	Если ТипЗнч(РегистрацияНаПЛК) = Тип("ДокументСсылка.гкс_РегистрацияНаПЛК") Тогда
		ТипПробы = Перечисления.гкс_ТипыПроб.Единичная;

		ДокументыРегистрации = Новый ТаблицаЗначений;
		ДокументыРегистрации.Колонки.Добавить("ДокументРегистрации",
			Новый ОписаниеТипов("ДокументСсылка.гкс_РегистрацияНаПЛК"));
		НоваяСтрока = ДокументыРегистрации.Добавить();
		НоваяСтрока.ДокументРегистрации = РегистрацияНаПЛК;
	Иначе
		ТипПробы = Перечисления.гкс_ТипыПроб.Композитная;
		ДокументыРегистрации = РегистрацияНаПЛК.СписокРегистраций.Выгрузить( ,"ДокументРегистрации");
	КонецЕсли;

	Запрос.УстановитьПараметр("ДокументыРегистрации", ДокументыРегистрации);
	Запрос.УстановитьПараметр("ТипПробы", ТипПробы);


	РезультатЗапроса = Запрос.Выполнить();

	Если Не РезультатЗапроса.Пустой() Тогда
		Данные = РезультатЗапроса.Выгрузить();
		Результат = ОбщегоНазначения.ТаблицаЗначенийВМассив(Данные);
	Иначе
		Результат = Новый Массив;
	КонецЕсли;

	Возврат Результат;

КонецФункции


#КонецОбласти
