#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ТаблицаЗначений") Тогда
		
		Отклонения = ДанныеЗаполнения.Скопировать(, "ВариантОтклонения");
		Отклонения.Свернуть("ВариантОтклонения");
		
		Комментарий = "";
		
		Для Каждого Отклонение Из Отклонения Цикл
			
			ОтборВариант = Новый Структура("ВариантОтклонения", Отклонение.ВариантОтклонения);
			ДанныеОтклонения = ДанныеЗаполнения.НайтиСтроки(ОтборВариант);
			
			Если Отклонение.ВариантОтклонения = "По нормативу" Тогда
				ОтклонениеПоНормативу = Истина;
				ОтклонениеПоСпецификации = Ложь;
			Иначе
				ОтклонениеПоНормативу = Ложь;
				ОтклонениеПоСпецификации = Истина;
			КонецЕсли;	
						
			Заголовок = "Норматив:";
			Шаблон = " %1, %2, норма: %3 : %4;";
			
			Если ОтклонениеПоСпецификации Тогда
				Заголовок = "Договор:";
				Шаблон = " %1, %2, договор: %3 : %4;";
			КонецЕсли;;
			
			Комментарий = Комментарий + Заголовок;
			Для Каждого СтрокаПоказатель Из ДанныеОтклонения Цикл
				Если ОтклонениеПоНормативу 
					И Отклонение.ВариантОтклонения = "По нормативу"
					И НЕ СтрокаПоказатель.ЕстьСертификация Тогда
					
					Комментарий = Комментарий + Символы.ПС + НСтр("ru='Не найдены настройки нормативов качества'");
					Прервать;
					
				КонецЕсли;
				
				Комментарий = Комментарий + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон,
				СтрокаПоказатель.Показатель,
				СтрокаПоказатель.Значение,
				СтрокаПоказатель.МинЗначение,
				СтрокаПоказатель.МаксЗначение);
				
			КонецЦикла;
			
			Комментарий = Комментарий + Символы.ПС;
			
		КонецЦикла;
			
		СтрокаНабора = ЭтотОбъект.Добавить();
		СтрокаНабора.Комментарий = Комментарий;
		СтрокаНабора.ДокументРегистрации = ДанныеЗаполнения[0].ДокументРегистрации; 
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте'", ОбщегоНазначенияКлиент.КодОсновногоЯзыка());
#КонецЕсли