
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьНастройки(СсылкаНаТабло) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НастройкаЭлектронногоТабло.ТочкаМаршрута КАК ТочкаМаршрута,
	|	НастройкаЭлектронногоТабло.ВидТабло КАК ВидТабло,
	|	НастройкаЭлектронногоТабло.Табло КАК Табло,
	|	НастройкаЭлектронногоТабло.Номенклатура КАК Номенклатура,
	|	НастройкаЭлектронногоТабло.Весы КАК Весы,
	|	НастройкаЭлектронногоТабло.ЯмаРазгрузки КАК ЯмаРазгрузки,
	|	НастройкаЭлектронногоТабло.ВидПеревозки КАК ВидПеревозки
	|ИЗ
	|	РегистрСведений.гкс_НастройкаЭлектронногоТабло КАК НастройкаЭлектронногоТабло
	|ГДЕ
	|	НастройкаЭлектронногоТабло.Табло = &Табло";
	
	Запрос.УстановитьПараметр("Табло", СсылкаНаТабло);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		НомерСтроки = 0;
		ДанныеЗапроса = РезультатЗапроса.Выгрузить();
		Результат = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ДанныеЗапроса[НомерСтроки]);
	Иначе	
		Результат = Неопределено;	
	КонецЕсли;
	
	Возврат Результат;
							
КонецФункции

#КонецОбласти

#КонецЕсли
