#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ПараметрКоманды = Неопределено Тогда		
		Возврат;	
	Конецесли;
	
	УстановитьСостояниеПопуститьОбработку(ПараметрКоманды);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьСостояниеПопуститьОбработку(Объекты)
	
	УстановитьПривилегированныйРежим(Истина);
	Обработки.гкс_УправлениеОбъектамиИнтеграции.ПропуститьОбработку(Объекты);
	
КонецПроцедуры

#КонецОбласти
