#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	гкс_ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	гкс_ПроведениеДокументов.ПриЗаписиДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьБлокировкуНастроекНазначенияРазгрузки(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	гкс_ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьБлокировкуНастроекНазначенияРазгрузки(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	гкс_ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Устанавливается принудительная управляемая блокировка измерений регистра цен номенклатуры
Процедура УстановитьБлокировкуНастроекНазначенияРазгрузки(Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.гкс_НастройкиНазначенияРазгрузки");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		ЭлементБлокировки.УстановитьЗначение("ТочкаМаршрута", ТочкаМаршрута);
		ЭлементБлокировки.УстановитьЗначение("Номенклатура", Номенклатура);
		ЭлементБлокировки.УстановитьЗначение("ВидПеревозки", ВидПеревозки);
	
		Блокировка.Заблокировать();
		
	Исключение
		
		Отказ = Истина;
		
		ТекстСообщения = НСтр(
		"ru = 'Не удалось изменить движения документа ""%1"" 
		|по причине:
		|%2'");
		ТекстСообщения = СтрШаблон(
			ТекстСообщения,
			СокрЛП(ЭтотОбъект),
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Управляемая блокировка'"),
			УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		
	КонецПопытки; 
	
КонецПроцедуры

#КонецОбласти


#КонецЕсли