#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда 
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаПечать(Команда)
	
	ОтпускРазрешилДолжность = гкс_ПриемкаТранспортаВызовСервера.ДолжностьОтветственного(ОтпускРазрешил);
	
	ДанныеПечати = Новый Структура;
	ДанныеПечати.Вставить("ОтпускРазрешил", ОтпускРазрешил);
	ДанныеПечати.Вставить("ОтпускРазрешилДолжность", ОтпускРазрешилДолжность);
	
	// по умолчанию отправитель тоже лицо, что и разрешил отпуск
	ДанныеПечати.Вставить("СдалОтправитель", ОтпускРазрешил);
	ДанныеПечати.Вставить("СдалОтправительДолжность", ОтпускРазрешилДолжность);
	
	Закрыть(Новый Структура("ДанныеПечати", ДанныеПечати));
	
КонецПроцедуры

#КонецОбласти


