
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ИнициализироватьРеквизитыФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	УстановитьВидимостьДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ЗаполнитьСписокВыбораТрюмов(Объект.Фрахт);
	 
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	УстановитьВидимостьДоступностьЭлементов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФрахтПриИзменении(Элемент)
	ЗаполнитьСписокВыбораТрюмов(Объект.Фрахт);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗакончитьСмену(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		ВыполнитьЗакрытиеСмены();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьСмену(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		ВыполнитьОткрытиеСмены();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервереБезКонтекста
Функция ТекущаяДатаСеансаНаСервере()
	
	Возврат ТекущаяДатаСеанса();
	
КонецФункции

&НаСервере
Функция ЭтоНовыйДокумент()
	
	Возврат Параметры.Ключ.Пустая();
	
КонецФункции

&НаСервере
Процедура ИнициализироватьРеквизитыФормы()
	
	Если ЭтоНовыйДокумент() Тогда
		Объект.ПроизводственныеСутки = ТекущаяДатаСеанса();
		Объект.Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступностьЭлементов()
	Элементы.Фрахт.ТолькоПросмотр = ЗначениеЗаполнено(Объект.ДатаНачала);
	Элементы.ФормаНачатьСмену.Доступность = Не ЗначениеЗаполнено(Объект.ДатаНачала);
	Элементы.ФормаЗакончитьСмену.Доступность = Не ЗначениеЗаполнено(Объект.ДатаОкончания);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОткрытиеСмены()
	
	Если Объект.ДатаНачала = гкс_ОбщегоНазначенияКлиентСервер.ПустаяДата() Тогда 
		Объект.ДатаНачала = ТекущаяДатаСеансаНаСервере();
	КонецЕсли;
	
	Записать();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗакрытиеСмены()

	Если Объект.ДатаОкончания = гкс_ОбщегоНазначенияКлиентСервер.ПустаяДата() Тогда 
		Объект.ДатаОкончания = ТекущаяДатаСеансаНаСервере();
	КонецЕсли;
	
	Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокВыбораТрюмов(Фрахт)
	
	КоллекцияТрюмов = гкс_МорскаяЛогистикаВызовСервера.ТрюмыФрахта(Фрахт);
	Элементы.ОбработкаСуднаТрюм.СписокВыбора.ЗагрузитьЗначения(КоллекцияТрюмов);
	
КонецПроцедуры

#КонецОбласти