
#Область ПрограммныйИнтерфейс

Процедура ПровестиВзвешивание(РегистрацияНаПЛК, Весы, ДокументВзвешивание) Экспорт
	
	Если РегистрыСведений.гкс_СостоянияРегистрации.УжеУбыл(РегистрацияНаПЛК) Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru='Машина по документу %1 уже убыла!';"), РегистрацияНаПЛК);
		ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка, РегистрацияНаПЛК.Метаданные(), РегистрацияНаПЛК, ТекстСообщения);
		Возврат;
	КонецЕсли;

	МаксимальноеКоличествоОпросов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Весы, "МаксимальноеКоличествоОпросов");
		
	МассивПоказаний = гкс_ОбменДаннымиСВесами.РезультатыВзвешивания(
		XMLСтрока(РегистрацияНаПЛК), Весы, МаксимальноеКоличествоОпросов, Истина);
			
	Если ЗначениеЗаполнено(МассивПоказаний) Тогда
			
		ВесВДокументе = ВесВДокументе(РегистрацияНаПЛК, Весы);
		ВесФактический = ФактическийВес(МассивПоказаний, ВесВДокументе);
		
		Если ВесФактический.Вес = 0 Тогда
			ТекстСообщения = НСтр("ru = 'Получен нулевой вес!'");
			ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Ошибка, РегистрацияНаПЛК.Метаданные(), РегистрацияНаПЛК, ТекстСообщения);
			Возврат;
		КонецЕсли;
		
		ТипВзвешивания = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Весы, "ТипВзвешивания");
		ДокументВзвешивание = Документы.гкс_Взвешивание.ПоРегистрацииИТипуВзвешивания(РегистрацияНаПЛК, ТипВзвешивания);
		
		ДанныеЗаполнения = ДанныеЗаполненияВзвешивание(РегистрацияНаПЛК, Весы, ВесФактический);
		ЗаполнитьДокументВзвешивание(ДокументВзвешивание, ДанныеЗаполнения); 
	КонецЕсли;	
	
КонецПроцедуры

// Метод формирует коллекцию с данными для заполнения документа взвешивания.
// 
// Параметры:
//  РегистрацияНаПЛК - ДокументСсылка.гкс_РегистрацияНаПЛК - Регистрация на ПЛК
//  Весы - СправочникСсылка.гкс_ОборудованиеПЛК - Весы
//  ДанныеВзвешивания - Структура - Данные взвешивания:
//  					* Вес - Число 
// 						* ВесНеСтабилен - Булево
// 
// Возвращаемое значение:
//  Структура - Данные заполнения взвешивание:
// * Организация - СправочникСсылка.Организации
// * ТочкаМаршрута - СправочникСсылка.гкс_ТочкиМаршрута
// * ТипРегистрации - ПеречислениеСсылка.гкс_ТипРегистрации
// * Весы - СправочникСсылка.гкс_ОборудованиеПЛК
// * ДокументРегистрации - ДокументСсылка.гкс_РегистрацияНаПЛК 
// * Вес - Число
// * ВесНеСтабилен - Булево 
// * ВесВведенВручную - Булево 
// * Дата - Дата 
// * МестнаяДата - Дата 
// * ТипВзвешивания - ПеречислениеСсылка.гкс_ТипыВзвешивания 
Функция ДанныеЗаполненияВзвешивание(РегистрацияНаПЛК, Весы, ДанныеВзвешивания) Экспорт
	
	ДанныеЗаполненния = Новый Структура("Организация,ТочкаМаршрута,ТипРегистрации");
	
	ДанныеЗаполненния.Вставить("Весы", Весы);
	ДанныеЗаполненния.Вставить("ДокументРегистрации", РегистрацияНаПЛК);
	ДанныеЗаполненния.Вставить("Вес", ДанныеВзвешивания.Вес);
	ДанныеЗаполненния.Вставить("ВесНеСтабилен", ДанныеВзвешивания.ВесНеСтабилен);
	ДанныеЗаполненния.Вставить("ВесВведенВручную", Ложь);
	ДанныеЗаполненния.Вставить("Дата", ТекущаяДатаСеанса());
	ДанныеЗаполненния.Вставить("МестнаяДата", ДанныеЗаполненния.Дата);
	
	ТипВзвешивания = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Весы, "ТипВзвешивания");
	ДанныеЗаполненния.Вставить("ТипВзвешивания", ТипВзвешивания);

	ДанныеРегистрации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РегистрацияНаПЛК, 
						"ТипРегистрации, Организация, ТочкаМаршрута");
							
	ЗаполнитьЗначенияСвойств(ДанныеЗаполненния, ДанныеРегистрации);
	
	Возврат ДанныеЗаполненния;
	
КонецФункции

Процедура ЗаполнитьДокументВзвешивание(ДокументВзвешивание, ДанныеЗаполнения) Экспорт

	Если Не ЗначениеЗаполнено(ДокументВзвешивание) Тогда
		ДокументВзвешивание = Документы.гкс_Взвешивание.СформироватьДокумент(ДанныеЗаполнения);
	Иначе
		ВзвешиваниеОбъект = ДокументВзвешивание.ПолучитьОбъект(); 
		ВзвешиваниеОбъект.Заполнить(ДанныеЗаполнения);
		ВзвешиваниеОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ФактическийВес(МассивПоказаний, ВесВДокументе)
	
	ТаблицаИзмерений = Новый ТаблицаЗначений();
	ТаблицаИзмерений.Колонки.Добавить("Вес");
	ТаблицаИзмерений.Колонки.Добавить("Отклонение");
	ТаблицаИзмерений.Колонки.Добавить("ВесНеСтабилен");
	
	Степень = 2;
	Для Каждого ЭлементМассива Из МассивПоказаний Цикл 
		СтрокаТаблицы = ТаблицаИзмерений.Добавить();
		СтрокаТаблицы.Вес 			= ЭлементМассива.Вес;
		СтрокаТаблицы.ВесНеСтабилен	= ЭлементМассива.ВесНеСтабилен;
		СтрокаТаблицы.Отклонение 	= Pow(СтрокаТаблицы.Вес - ВесВДокументе, Степень);
	КонецЦикла;	
	
	ТаблицаИзмерений.Сортировать("Отклонение");
	Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаИзмерений[0]);
	
КонецФункции

Функция ВесВДокументе(РегистрацияНаПЛК, Весы)
	
	ДанныеРегистрации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		РегистрацияНаПЛК, "ТипРегистрации, ВесБрутто, ВесНетто");
	
	ТипВзвешивания = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Весы, "ТипВзвешивания");
	
	Если ДанныеРегистрации.ТипРегистрации = Перечисления.гкс_ТипРегистрации.Приемка Тогда
		Если ТипВзвешивания = Перечисления.гкс_ТипыВзвешивания.Въезд Тогда
			ВесВДокументе = ДанныеРегистрации.ВесБрутто;
		Иначе	
			ВесВДокументе = ДанныеРегистрации.ВесНетто;
		КонецЕсли;
		
	ИначеЕсли ДанныеРегистрации.ТипРегистрации = Перечисления.гкс_ТипРегистрации.Отгрузка Тогда
		Если ТипВзвешивания = Перечисления.гкс_ТипыВзвешивания.Въезд Тогда
			ВесВДокументе = ДанныеРегистрации.ВесНетто;
		Иначе	
			ВесВДокументе = ДанныеРегистрации.ВесБрутто;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ВесВДокументе;
	
КонецФункции

Функция ИмяСобытияЖурналаРегистрации()
	Возврат "Кверион. Автоматическое взвешивание";
КонецФункции

#КонецОбласти
