
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НовыйРежимРаботы = ПолучитьФункциональнуюОпцию("гкс_ИспользоватьНовыйРежимАРМПриемкаТранспорта");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не НовыйРежимРаботы Тогда
		ОткрытьФормуПоРежиму("ОсновнаяФорма");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьФормуАвтоПеревозки(Команда)
	ОткрытьФормуПоРежиму("ФормаАвтоПеревозки");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуЖДПеревозки(Команда)
	ОткрытьФормуПоРежиму("ФормаЖДПеревозки");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуМорскиеПеревозки(Команда)
	ОткрытьФормуПоРежиму("ФормаМорскиеПеревозки");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьФормуПоРежиму(ИмяФормы)

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АвтоПриемка", Параметры.АвтоПриемка);
		
	ПолноеИмяФормы = СтрШаблон("Обработка.гкс_ПриемкаТранспорта.Форма.%1", ИмяФормы);
	ОткрытьФорму(ПолноеИмяФормы, ПараметрыФормы);
	Закрыть();
	
КонецПроцедуры

#КонецОбласти