#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда 
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаПечать(Команда)
		
	ДанныеПечати = Новый Структура;
	ДанныеПечати.Вставить("Подписант", Подписант);
    ДанныеПечати.Вставить("Контрагент", Контрагент);
	ДанныеПечати.Вставить("Подразделение", Подразделение);
	ДанныеПечати.Вставить("ПредставительЛаборатории", ПредставительЛаборатории);
    ДанныеПечати.Вставить("КонтрагентЛаборатории", КонтрагентЛаборатории);
		
	Закрыть(Новый Структура("ДанныеПечати", ДанныеПечати));
	
КонецПроцедуры

#КонецОбласти
