#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПредставлениеДаты = Формат(Данные.ДатаОформления, "ДФ=dd.MM.yyyy;");
	Если ЗначениеЗаполнено(Данные.Статус) Тогда
		Представление = 
			СтрШаблон(НСтр("ru = '%1 от %2 (статус %3)'"), Данные.Идентификатор, ПредставлениеДаты, Данные.Статус);
	Иначе
		Представление = 
			СтрШаблон(НСтр("ru = '%1 от %2 (статус не известен)'"), Данные.Идентификатор, ПредставлениеДаты);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	Поля.Добавить("Идентификатор");
	Поля.Добавить("Статус");
	Поля.Добавить("ДатаОформления");
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти