#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
    
#Область ПрограммныйИнтерфейс                                     
// Процедура записывает / обновляет запись регистра                                       
// Параметры:
// ДокументРегистрации - ДокументСсылка.гкс_РегистрацияНаПЛК                                              
// ТипВзвешивания - ПеречилениеСсылка.гкс_ТипыВзвешивания                                                 
// ТочкаМаршрута - СправочникСсылка.гкс_ТочкиМаршрута
// МестнаяДата - Дата
 Процедура ДобавитьОбновитьЗапись(ДокументРегистрации, ТипВзвешивания, ТочкаМаршрута, МестнаяДата) Экспорт 
	 
	 УстановитьПривилегированныйРежим(Истина);
	 Набор = СоздатьНаборЗаписей();
	 Набор.Отбор.ДокументРегистрации.Установить(ДокументРегистрации);
	 Набор.Прочитать();
	 Если Набор.Количество() = 0 Тогда
		Запись = Набор.Добавить();
		Запись.ДокументРегистрации = ДокументРегистрации;
	Иначе
		Запись = Набор[0];
	КонецЕсли;                                                            
	
	Если ТипВзвешивания = Перечисления.гкс_ТипыВзвешивания.Въезд Тогда
		Запись.ВремяВзвешенТара = МестнаяДата;
	Иначе
		Запись.ВремяВзвешенБрутто = МестнаяДата;	
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Запись.ВремяВзвешенБрутто)
		И ЗначениеЗаполнено(Запись.ВремяВзвешенТара) Тогда
		Разность = Запись.ВремяВзвешенБрутто - Запись.ВремяВзвешенТара;
		Минут = Окр(Разность/гкс_ОбщегоНазначенияКлиентСервер.СекундВМинуте(), 0);
		НормативОтгрузки = РегистрыСведений.гкс_НастройкиПриемкаПЛКПоТочкамМаршрута.НормативОтгрузки(ТочкаМаршрута);
		Отклонение = НормативОтгрузки - Минут;
		Если Отклонение<0 Тогда 
			Запись.ЕстьОтклонение = Истина;  // отклонение в большую сторону
		КонецЕсли;	 
		Запись.ВремяНаПЛК = Минут;
		Запись.Отклонение = Отклонение;
		
	КонецЕсли;	 
	Набор.Записать();
	
КонецПроцедуры	    

// Процедура записывает комментарий в регистр
// Параметры:
// Комментарий - Строка
Процедура ОбновитьКомментарийОтклонения(ДокументРегистрации, Комментарий) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина); 
	
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.ДокументРегистрации.Установить(ДокументРегистрации);    
	Набор.Прочитать();     
	Если Набор.Количество() >0 Тогда
		Запись = Набор[0];
		Запись.Комментарий = Комментарий;
		Набор.Записать();
	КонецЕсли;
	
КонецПроцедуры	   

// Возвращает признак учета времени нахождения ТС на ПЛК
// Параметры:
// ТипРегистрации - ПеречилениеСсылка.гкс_ТипРегистрации                                                 
// ВидПеревозки - ПеречилениеСсылка.гкс_ТипыТранспортныхСредствДоставки                                                 
// ТочкаМаршрута - СправочникСсылка.гкс_ТочкиМаршрута
// Возвращаемое значение:
// - Булево
Функция УчитыватьВремяНахожденияТС(ТипРегистрации, ВидПеревозки, ТочкаМаршрута) Экспорт
	Возврат
		ТипРегистрации = Перечисления.гкс_ТипРегистрации.Отгрузка
		И ВидПеревозки = Перечисления.гкс_ТипыТранспортныхСредствДоставки.Автомобиль 
		И РегистрыСведений.гкс_НастройкиПриемкаПЛКПоТочкамМаршрута.НормативОтгрузки(ТочкаМаршрута) <> 0;
КонецФункции		

// Возвращает данные по времент нахождения на ПЛК по регистрации 
// Параметры:
// ДокументРегистрации - ДокументСсылка.гкс_РегистрацииНаПЛК
// ВозвращаемоеЗначение:
// - Структура
Функция ДанныеПоВремениНахожденияНаПЛК(ДокументРегистрации) Экспорт
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("ДокументРегистрации", ДокументРегистрации);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВремяНахожденияТСНаПЛК.ВремяНаПЛК КАК ВремяНаПЛК,
	               |	ВремяНахожденияТСНаПЛК.Комментарий КАК Комментарий
	               |ИЗ
	               |	РегистрСведений.гкс_ВремяНахожденияТСНаПЛК КАК ВремяНахожденияТСНаПЛК
	               |ГДЕ
	               |	ВремяНахожденияТСНаПЛК.ДокументРегистрации = &ДокументРегистрации";
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Данные = Новый Структура("ВремяНаПЛК, Комментарий");
	Иначе	
		ВыгрузкаЗапроса = Результат.Выгрузить()[0];              
		Данные = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ВыгрузкаЗапроса);
	КонецЕсли;	
	Возврат Данные;
КонецФункции	

#КонецОбласти

#КонецЕсли
