#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Источник 		= ПараметрыВыполненияКоманды.Источник;
	Отбор 			= Новый Структура("ВходящиеДанные", Источник.Объект.Ссылка);
	ПараметрыФормы 	= Новый Структура("Отбор", Отбор);
	
	ОткрытьФорму("РегистрСведений.гкс_ВнешниеПробы.ФормаСписка", 
		ПараметрыФормы, 
		Источник, 
		ПараметрыВыполненияКоманды.Уникальность, 
		ПараметрыВыполненияКоманды.Окно, 
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
		
КонецПроцедуры

#КонецОбласти