#Если ТолстыйКлиентОбычноеПриложение ИЛИ Сервер ИЛИ ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Возвращает ссылку на произвольный предопределенный объект по имени.
//
// Параметры:
//	ИмяПредопределенного - Строка - Имя предопределенного элемента в конфигурации.
//
// Возвращаемое значение:
//  ЛюбаяСсылка - ссылка на предопределенный элемент.
//  Неопределено - если предопределенный элемент есть в метаданных, но не создан в ИБ.
//
Функция ПроизвольныйПредопределенныйОбъект(ИмяПредопределенного) Экспорт
    
    ПолноеИмяПредопределенного = 
                   "ПланВидовХарактеристик.гкс_ПроизвольныеПредопределенныеОбъекты." + ИмяПредопределенного;
    
    Возврат ОбщегоНазначения
                 .ЗначениеРеквизитаОбъекта(ПредопределенноеЗначение(ПолноеИмяПредопределенного), "СсылкаНаОбъект");
    
КонецФункции

// Заполнить предопределенный объект.
//
// Параметры:
//  ПараметрыОбновления Параметры обновления
Процедура ЗаполнитьПредопределенныйОбъект(ПараметрыОбновления = Неопределено) Экспорт

ИмяЖурналаОбновленияИБ = "ОбновлениеИБ.ЗаполнитьПредопределенныйОбъект";
    НаименованиеВидаНоменклатуры = "Эталоны качества";
    
    Попытка
		
		Запрос = Новый Запрос();
        Запрос.Текст =
            "ВЫБРАТЬ ПЕРВЫЕ 1
            |   ВидыНоменклатуры.Ссылка КАК Ссылка
            |ИЗ
            |   Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
            |ГДЕ
            |   ВидыНоменклатуры.Наименование = &Наименование
            |   И ВидыНоменклатуры.ПометкаУдаления = ЛОЖЬ";
        Запрос.УстановитьПараметр("Наименование", НаименованиеВидаНоменклатуры);
        Результат = Запрос.Выполнить().Выбрать();
        ЭталоныКачества = Неопределено;
        Если Результат.Следующий() Тогда
            ЭталоныКачества = Результат.Ссылка;
        КонецЕсли;
        
        Если НЕ ЗначениеЗаполнено(ЭталоныКачества) Тогда
            ЗаписьЖурналаРегистрации(
                ИмяЖурналаОбновленияИБ,
                УровеньЖурналаРегистрации.Предупреждение,
                ,
                ,
                СтрШаблон("Не найден вид номенклатуры '%1'", НаименованиеВидаНоменклатуры));
            Возврат;
        КонецЕсли;
        
        // Получаем предопределенный элемент ПВХ
        ПВХыЭталоныКачества = ВидыНоменклатурыЭталоныКачества.ПолучитьОбъект();
        ПВХыЭталоныКачества.СсылкаНаОбъект = ЭталоныКачества;
        ПВХыЭталоныКачества.Записать();
        
        ЗаписьЖурналаРегистрации(
            ИмяЖурналаОбновленияИБ,
            УровеньЖурналаРегистрации.Информация,
            ,
            ,
            "Успешно заполнен предопределенный объект ВидыНоменклатурыЭталоныКачества");
        
    Исключение
        ТекстОшибки = ОписаниеОшибки();
        ЗаписьЖурналаРегистрации(
            ИмяЖурналаОбновленияИБ,
            УровеньЖурналаРегистрации.Ошибка,
            ,
            ,
            "Ошибка при выполнении обработчика: " + ТекстОшибки);
        ВызватьИсключение;
    КонецПопытки;    

    
КонецПроцедуры

#КонецОбласти 

#КонецЕсли