
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ФормаВладелец = ПараметрыВыполненияКоманды.Источник;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ОтборПоДаннымДокумента(ПараметрКоманды)); 
	ОткрытьФорму("РегистрСведений.гкс_СРПВСтатусыОформленияВагонов.ФормаСписка",
		ПараметрыФормы, ФормаВладелец, ФормаВладелец.УникальныйИдентификатор, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ОтборПоДаннымДокумента(ПараметрКоманды)
	
	ИдентификаторОтправки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		ПараметрКоманды, "ИдентификаторОтправки");
	Отбор = Новый Структура;
	Отбор.Вставить("КлючАналитикиСРПВ", ИдентификаторОтправки);
	
	Возврат Отбор;
	
КонецФункции

#КонецОбласти