#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Возвращает структуру записи
//
// Возвращаемое значение:
//  Структура - структура записи.
//
Функция СтруктураЗаписи() Экспорт

    СтруктураЗаписи = Новый Структура;

	СтруктураЗаписи.Вставить("ДокументРегистрации");
	СтруктураЗаписи.Вставить("ПроизводственныеСутки");
	СтруктураЗаписи.Вставить("Поставщик");
	СтруктураЗаписи.Вставить("Номенклатура");
	СтруктураЗаписи.Вставить("ТранспортноеСредство");


    Возврат СтруктураЗаписи;

КонецФункции

// Зарегистрировать приемку транспорта без входного контроля.
//
// Параметры:
//  ДанныеРегистрации Данные регистрации
Процедура ЗарегистрироватьПриемкуТранспортаБезВходногоКонтроля(ДанныеРегистрации) Экспорт


	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.ДокументРегистрации.Установить(ДанныеРегистрации.ДокументРегистрации);

	НоваяЗапись = Набор.Добавить();
	НоваяЗапись.ДокументРегистрации = ДанныеРегистрации.ДокументРегистрации;
	НоваяЗапись.ПроизводственныеСутки = ДанныеРегистрации.ПроизводственныеСутки;
	НоваяЗапись.Поставщик = ДанныеРегистрации.Поставщик;
	НоваяЗапись.Номенклатура = ДанныеРегистрации.Номенклатура;
	НоваяЗапись.ТранспортноеСредство = ДанныеРегистрации.ТранспортноеСредство;

	Набор.Записать();

КонецПроцедуры

// Проверить приемку транспорта без входного контроля.
//
// Параметры:
//  ДокументРегистрации Документ регистрации
//
// Возвращаемое значение:
//  Булево - Проверить приемку транспорта без входного контроля
Функция ПроверитьПриемкуТранспортаБезВходногоКонтроля(ДокументРегистрации) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПриемкаТранспортаБезВходногоКонтроля.ДокументРегистрации КАК ДокументРегистрации
	|ИЗ
	|	РегистрСведений.гкс_ПриемкаТранспортаБезВходногоКонтроля КАК ПриемкаТранспортаБезВходногоКонтроля
	|ГДЕ
	|	ПриемкаТранспортаБезВходногоКонтроля.ДокументРегистрации = &ДокументРегистрации";

	Запрос.УстановитьПараметр("ДокументРегистрации", ДокументРегистрации);

	Результат = Запрос.Выполнить();
	Возврат НЕ Результат.Пустой();

КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
