
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Данные = ТекущийОбъект.Настройки.Получить();
	СписокПолучатель.ЗагрузитьЗначения(Данные.Получатель);
	СписокСостоянияРегистрации.ЗагрузитьЗначения(Данные.СостоянияРегистрации);
	ИнтервалВремениНапоминания = Данные.ИнтервалВремениНапоминания;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения) Тогда
		СписокПолучатель.ЗагрузитьЗначения(Параметры.ЗначенияЗаполнения.Получатель);
		СписокСостоянияРегистрации.ЗагрузитьЗначения(Параметры.ЗначенияЗаполнения.СостоянияРегистрации);
		ИнтервалВремениНапоминания = Параметры.ЗначенияЗаполнения.ИнтервалВремениНапоминания;
	КонецЕсли
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Данные = Новый Структура("Получатель, СостоянияРегистрации, ИнтервалВремениНапоминания", 
	СписокПолучатель.ВыгрузитьЗначения(), СписокСостоянияРегистрации.ВыгрузитьЗначения(), ИнтервалВремениНапоминания);
	ТекущийОбъект.Настройки = Новый ХранилищеЗначения(Данные);
		
КонецПроцедуры

#КонецОбласти