#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("СформироватьКомпозитнуюПробу") Тогда

		ЗаполнитьЗначенияСвойств(Объект, Параметры.ДопПараметры);
		СтанцияОтправленияПредставление = Параметры.ДопПараметры.СтанцияОтправленияПредставление;
		ТабРегистраций = гкс_ПриемкаНаПЛКСервер.ПолучитьСписокРегистрацийВКомпозит(Параметры.ДопПараметры);

		Если ТабРегистраций.Количество() > 0 Тогда
			Объект.ТаблицаРегистраций.Загрузить(ТабРегистраций);
		Иначе
			Отказ = Истина;
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокРегистраций

&НаКлиенте
Процедура СписокРегистрацийДокументРегистрацииПриИзменении(Элемент)

	ТекущиеДанные = Элементы.СписокРегистраций.ТекущиеДанные;
	ТекущиеДанные.ВесНетто = ПолучитьВесНетто(ТекущиеДанные.ДокументРегистрации);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаСформироватьКомпозитнуюПробу(Команда)

	СформироватьДокумент();
	Закрыть();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьДокумент()

	Если Объект.ТаблицаРегистраций.Количество() > 0 Тогда

		ПараметрыСоздания = Новый Структура;
		ПараметрыСоздания.Вставить("ТочкаМаршрута", Объект.ТочкаМаршрута);
		ПараметрыСоздания.Вставить("ПроизводственныеСуткиРегистрации", Объект.ПроизводственныеСуткиРегистрации);
		ПараметрыСоздания.Вставить("ТаблицаРегистраций", Объект.ТаблицаРегистраций.Выгрузить());
		ПараметрыСоздания.Вставить("ТипПробы", Перечисления.гкс_ТипыПроб.Композитная);
		ПараметрыСоздания.Вставить("ЭтоУсиленныйКонтрольДляТС", Ложь);
		Документы.гкс_ФормированиеНомераПробы.ДокументПромежуточногоКомпозита(ПараметрыСоздания);

	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьВесНетто(ДокументРегистрации)

	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументРегистрации, "ВесНетто");

КонецФункции

#КонецОбласти
