
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СерверыОчередейRMQ(Команда)
	ОткрытьФорму("Справочник.СерверыОчередейRMQ.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ИсходящиеСообщения(Команда)
	ОткрытьФорму("Справочник.ИсходящиеСообщения.ФормаСписка");	
КонецПроцедуры

&НаКлиенте
Процедура ЗаданияНаОтправку(Команда)
	ОткрытьФорму("Справочник.ЗаданияОтправкиИсходящихСообщений.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ПодпискиНаСобытия(Команда)
	ОткрытьФорму("Справочник.ПодпискиНаОчередиСообщений.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикиСобытий(Команда)
	ОткрытьФорму("Справочник.ОбработчикиСобытийRMQ.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура гкс_МоделиДанныхXDTO(Команда)
	ОткрытьФорму("Справочник.гкс_МоделиДанныхXDTO.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура гкс_ТочкиОбмена(Команда)
	ОткрытьФорму("Справочник.гкс_ТочкиОбменаRMQ.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура гкс_ФорматыОбмена(Команда)
	ОткрытьФорму("Справочник.гкс_ФорматыОбменаИАС.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура гкс_ПолучателиДанных(Команда)
	ОткрытьФорму("Справочник.гкс_ПолучателиДанныхRMQ.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура гкс_НастройкиХраненияСлужебныхДанных(Команда)
	ОткрытьФорму("РегистрСведений.гкс_НастройкиИнтеграционногоАдаптера.ФормаЗаписи");
КонецПроцедуры

&НаКлиенте
Процедура гкс_ВходящиеСообщения(Команда)
	ОткрытьФорму("Справочник.гкс_ВходящиеСообщенияRMQ.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура гкс_ТаблицаСвязей(Команда)
	ОткрытьФорму("РегистрСведений.гкс_ИдентификаторыСинхронизируемыхОбъектов.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура гкс_ПроизвольныеНастройкиИнтеграции(Команда)
	ОткрытьФорму("Справочник.гкс_ПроизвольныеНастройкиИнтеграций.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура гкс_ЗаданияОбработкиОчередиВходящихСообщенийRMQ(Команда)
	ОткрытьФорму("Справочник.гкс_ЗаданияОбработкиОчередиВходящихСообщенийRMQ.ФормаСписка");
КонецПроцедуры

#КонецОбласти
