#Область ПрограммныйИнтерфейс

#Область РегламентныеЗадания

// Обработчик регламентного задания "гкс_ПолучениеДанныхWarehouse".
//
Процедура ПолучениеДанныхWarehouse() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(
		Метаданные.РегламентныеЗадания.гкс_ПолучениеДанныхWarehouse);
		
	Если Не ПолучитьФункциональнуюОпцию("гкс_ИспользоватьИнтеграциюСWarehouse") Тогда
		ВызватьИсключение НСтр("ru = 'Регламентное задание недоступно по функциональным опциям.'");
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Если ПолучитьФункциональнуюОпцию("гкс_ИспользоватьМетодИзмененныеВнешниеПробыЗаПериод") Тогда
		Документы.гкс_ВнешняяПроба.ЗагрузитьВнешниеПробыЗаПериод("ExternalSamples_GetBetweenUpdatedOnDates");
	Иначе
		Документы.гкс_ВнешняяПроба.ЗагрузитьВнешниеПробыЗаПериод("ExternalSamples_GetBetweenDates");
	КонецЕсли;
		
КонецПроцедуры

// Обработчик регламентного задания "гкс_ОбработкаВходящихДанныхWarehouse".
//
Процедура ОбработкаВходящихДанныхWarehouse() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(
		Метаданные.РегламентныеЗадания.гкс_ОбработкаВходящихДанныхWarehouse);
		
	Если Не ПолучитьФункциональнуюОпцию("гкс_ИспользоватьИнтеграциюСWarehouse") Тогда
		ВызватьИсключение НСтр("ru = 'Регламентное задание недоступно по функциональным опциям.'");
	КонецЕсли;
	
	ОбработатьПроблемныеВнешниеПробы();
		
КонецПроцедуры

// Добавляет команды Warehouse на форму объекта при создании на сервере.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма, из которой вызвана процедура.
//   МестоРазмещенияКоманд - ГруппаФормы - место для размещения, по умолчанию - командная панель формы.
//   ПараметрыОповещения - Структура - параметры, где может быть установлен источник команды.
//
Процедура ПриСозданииНаСервере(Форма, МестоРазмещенияКоманд = Неопределено, ПараметрыОповещения = Неопределено) Экспорт
	
	Попытка
		Если ПолучитьФункциональнуюОпцию("гкс_ИспользоватьИнтеграциюСWarehouse") Тогда
			ДобавитьКомандуЗагрузить(Форма, МестоРазмещенияКоманд);
		КонецЕсли;
	Исключение
		ТекстСообщенияОбОшибке = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(
			ИмяСобытияЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,,,
			ТекстСообщенияОбОшибке);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщенияОбОшибке);
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.РегламентныеЗадания

// Определяет зависимости регламентных заданий и их дополнительные свойства.
//
// Параметры:
//  Настройки - ТаблицаЗначений:
//    * РегламентноеЗадание - ОбъектМетаданныхРегламентноеЗадание - регламентное задание.
//    * ФункциональнаяОпция - ОбъектМетаданныхФункциональнаяОпция - функциональная опция,
//        от которой зависит регламентное задание.
//    * ЗависимостьПоИ - Булево - если регламентное задание зависит более чем
//        от одной функциональной опции и его необходимо включать только тогда,
//        когда все функциональные опции включены, то следует указывать Истина
//        для каждой зависимости.
//        По умолчанию Ложь - если хотя бы одна функциональная опция включена,
//        то регламентное задание тоже включено.
//    * ВключатьПриВключенииФункциональнойОпции - Булево
//                                              - Неопределено - если Ложь, то при
//        включении функциональной опции регламентное задание не будет включаться. Значение
//        Неопределено соответствует значению Истина.
//        По умолчанию - Неопределено.
//    * ДоступноВПодчиненномУзлеРИБ - Булево
//                                  - Неопределено - Истина или Неопределено, если регламентное
//        задание доступно в РИБ.
//        По умолчанию - Неопределено.
//    * ДоступноВАвтономномРабочемМесте - Булево
//                                      - Неопределено - Истина или Неопределено, если регламентное
//        задание доступно в автономном рабочем месте.
//        По умолчанию - Неопределено.
//    * ДоступноВМоделиСервиса - Булево
//                             - Неопределено - Ложь, если необходимо блокировать выполнение регламентного
//        задания (в т.ч. задания очереди) в информационной базе с включенным использованием разделителя.
//        Значение Неопределено трактуется как Истина.
//        По умолчанию - Неопределено.
//    * РаботаетСВнешнимиРесурсами - Булево - Истина, если регламентное задание модифицирует данные
//        во внешних источниках (получение почты, синхронизация данных и т.п.). Не следует устанавливать
//        значение Истина для регламентных заданий, не модифицирующих данные во внешних источниках.
//        Например, регламентное задание ЗагрузкаКурсовВалют. Регламентные задания, работающие с внешними ресурсами,
//        автоматически отключаются в копии информационной базы. По умолчанию - Ложь.
//    * Параметризуется - Булево - Истина, если регламентное задание параметризованное.
//        По умолчанию - Ложь.
//
Процедура ПриОпределенииНастроекРегламентныхЗаданий(Настройки) Экспорт
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.гкс_ПолучениеДанныхWarehouse;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.гкс_ИспользоватьИнтеграциюСWarehouse;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.гкс_ОбработкаВходящихДанныхWarehouse;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.гкс_ИспользоватьИнтеграциюСWarehouse;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.РегламентныеЗадания

#КонецОбласти

// Выполняет запрос к сервису
//
// Параметры:
//   РесурсВебСервиса - СправочникСсылка.гкс_РесурсыВебСервисов
//   ПараметрыЗапроса - Структура
//   ПараметрыПреобразованияJSON - Структура
//
// Возвращаемое значение:
//   Структура - результат выполнения запроса.
//
Функция ВыполнитьЗапросКWarehouse(РесурсВебСервиса, ПараметрыЗапроса = Неопределено, 
									ПараметрыПреобразованияJSON = Неопределено) Экспорт
	
	ПараметрыКоннектора = гкс_РаботаСВебСервисами.ПараметрыКоннектораHTTP(РесурсВебСервиса);
	
	Если ЗначениеЗаполнено(ПараметрыПреобразованияJSON) Тогда		
		ЗаполнитьЗначенияСвойств(ПараметрыКоннектора.ПараметрыПреобразованияJSON, ПараметрыПреобразованияJSON);
	КонецЕсли;
	
	АдресРесурса = гкс_РаботаСВебСервисами.ПолныйАдресРесурса(РесурсВебСервиса, ПараметрыЗапроса);
	
	Если ТипЗнч(ПараметрыЗапроса) = Тип("Структура") И ПараметрыЗапроса.Свойство("params") Тогда
		ЗначенияПараметров = ПараметрыЗапроса.params;
	Иначе
		ЗначенияПараметров = Неопределено;
    КонецЕсли;
			
	Возврат КоннекторHTTP.GetJson(АдресРесурса, ЗначенияПараметров, ПараметрыКоннектора);
	
КонецФункции

// Обрабабатывает документы гкс_ВнешняяПроба по которым были проблемы.
//
Процедура ОбработатьПроблемныеВнешниеПробы() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтрольЗаполненияВнешнихПроб.ВнешняяПроба КАК ВнешняяПроба
		|ИЗ
		|	РегистрСведений.гкс_КонтрольЗаполненияВнешнихПроб КАК КонтрольЗаполненияВнешнихПроб
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СоответствиеОбъектовWarehouse КАК СоответствиеОбъектовWarehouse
		|		ПО КонтрольЗаполненияВнешнихПроб.ОбъектWarehouse = СоответствиеОбъектовWarehouse.СсылкаWarehouse
		|
		|СГРУППИРОВАТЬ ПО
		|	КонтрольЗаполненияВнешнихПроб.ВнешняяПроба";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	МассивСсылок = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивСсылок.Добавить(ВыборкаДетальныеЗаписи.ВнешняяПроба);	
	КонецЦикла;
	
	Документы.гкс_ВнешняяПроба.ОбновитьДаннымиИзWarehouse(МассивСсылок);
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

// Добавить команду "Обновить классификатор".
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма
//  МестоРазмещенияКоманд - ГруппаФормы, Неопределено - Место размещения команд
//
Процедура ДобавитьКомандуЗагрузить(Форма, Знач МестоРазмещенияКоманд)
	
	Если МестоРазмещенияКоманд = Неопределено Тогда
		МестоРазмещенияКоманд = Форма.КоманднаяПанель;
	КонецЕсли;
	
	ИмяКоманды = "гкс_ЗагрузитьКлассификатор";
	
	Если Форма.Команды.Найти(ИмяКоманды) = Неопределено Тогда
		КомандаФормы = Форма.Команды.Добавить(ИмяКоманды);
		КомандаФормы.Действие = "Подключаемый_ВыполнитьКомандуИнтеграции";
		КомандаФормы.Заголовок = НСтр("ru='Загрузить классификатор'");
		КомандаФормы.Подсказка = НСтр("ru='Загрузить классификатор из Warehouse'");
		КомандаФормы.ИзменяетСохраняемыеДанные = Ложь;
		КомандаФормы.Отображение = ОтображениеКнопки.Текст;
	КонецЕсли;
	
	ИсходноеИмяЭлемента = "гкс_ЗагрузитьКлассификатор";
	
	ИмяЭлемента = ИсходноеИмяЭлемента;
	Пока Форма.Элементы.Найти(ИмяЭлемента) <> Неопределено Цикл
		ИмяЭлемента = Форма.Элементы.Найти(ИмяЭлемента).Имя;
		Итератор = СтрЗаменить(ИмяЭлемента, ИсходноеИмяЭлемента, "");
		Итератор = Число(?(ПустаяСтрока(Итератор),"0",Итератор));
		Итератор = Итератор + ?(Итератор = 0, 2, 1);
		ИмяЭлемента = ИсходноеИмяЭлемента + Формат(Итератор,"ЧГ=0");
	КонецЦикла;
	
	НовыйЭлемент = Форма.Элементы.Добавить(ИмяЭлемента, Тип("КнопкаФормы"), МестоРазмещенияКоманд);
	НовыйЭлемент.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды = ИмяКоманды;
	
КонецПроцедуры

#Область ПолучениеВнешнихДанных

// Обновляет данные классификатора для справочника по указанному имени формы.
//
// Параметры:
//   ИмяФормы - Строка - полное имя формы (например, "Справочник.Номенклатура.ФормаСписка")
//
Процедура ЗагрузитьКлассификатор(ИмяФормы) Экспорт
	
	МассивИмяФормы = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИмяФормы, ".");
	Если МассивИмяФормы[0] = "Справочник" Тогда                       	
		ИмяОбъекта = СтрШаблон("%1.%2", МассивИмяФормы[0], МассивИмяФормы[1]);
		Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ИмяОбъекта);
		Менеджер.ОбновитьДанныеССервера();		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбщиеМетоды

// Возвращает локализованное имя события журнала регистрации для интеграции.
//
// Параметры:
//   СобытиеВторогоУровня - Строка - имя события, добавляемое через точку к имени события по умолчанию.
//
// Возвращаемое значение:
//   Строка - Интеграция с Warehouse
//        или Интеграция с Warehouse.<ИмяСобытияВторогоУровня>.
//
Функция ИмяСобытияЖурналаРегистрации(СобытиеВторогоУровня = "")
	
	Если СобытиеВторогоУровня = "" Тогда
		Возврат НСтр("ru = 'Интеграция с Warehouse'",
			ОбщегоНазначения.КодОсновногоЯзыка());
	Иначе
		Возврат СтрШаблон("%1.%2",
			НСтр("ru = 'Интеграция с Warehouse'",
				ОбщегоНазначения.КодОсновногоЯзыка()), СобытиеВторогоУровня);
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти